[{"text":".@JimRenacci has worked so hard on Tax Reductions, Illegal Immigration, the Border and Crime. I need Jim very badly to help our agenda and to keep MAKING AMERICA GREAT AGAIN! He will be a fantastic Senator for the Great State of Ohio, and has my full endorsement!"},{"text":".@JimRenacci has worked so hard on Tax Reductions, Illegal Immigration, the Border and Crime. I need Jim very badly to help our agenda and to keep MAKING AMERICA GREAT AGAIN! He will be a fantastic  Senator for the Great State of Ohio, and has my full endorsement!"},{"text":"Despite the Democrat inspired laws on Sanctuary Cities and the Border being so bad and one sided, I have instructed the Secretary of Homeland Security not to let these large Caravans of people into our Country. It is a disgrace. We are the only Country in the World so naive! WALL"},{"text":"Hard to believe Obstructionists May vote against Mike Pompeo for Secretary of State. The Dems will not approve hundreds of good people, including the Ambassador to Germany. They are maxing out the time on approval process for all, never happened before. Need more Republicans!"},{"text":"Can you believe that despite 93% bad stories from the Fake News Media (should be getting good stories), today we had just about our highest Poll Numbers, including those on Election Day? The American public is wise to the phony an dishonest press. Make America Great Again!"},{"text":"...Hopefully the Senate will not leave Washington until our Ambassadors, Judges and the people who make Washington work are approved. The Democrats are Obstructing the process and we need these people approved for the good of our Country!"},{"text":"RT @realDonaldTrump: States and Cities throughout our Country are being cheated and treated so badly by online retailers. Very unfair to tr…"},{"text":"While Japan and South Korea would like us to go back into TPP, I don’t like the deal for the United States. Too many contingencies and no way to get out if it doesn’t work. Bilateral deals are far more efficient, profitable and better for OUR workers. Look how bad WTO is to U.S."},{"text":"States and Cities throughout our Country are being cheated and treated so badly by online retailers. Very unfair to traditional tax paying stores!"},{"text":"RT @WhiteHouse: Syrian President Bashar al-Assad’s April 7 attack on innocent civilians violated international law, the Chemical Weapons Co…"},{"text":"Slippery James Comey, a man who always ends up badly and out of whack (he is not smart!), will go down as the WORST FBI Director in history, by far!"},{"text":"The big questions in Comey’s badly reviewed book aren’t answered like, how come he gave up Classified Information (jail), why did he lie to Congress (jail), why did the DNC refuse to give Server to the FBI (why didn’t they TAKE it), why the phony memos, McCabe’s $700,000 &amp; more?"},{"text":"Much of the bad blood with Russia is caused by the Fake &amp; Corrupt Russia Investigation, headed up by the all Democrat loyalists, or people that worked for Obama. Mueller is most conflicted of all (except Rosenstein who signed FISA &amp; Comey letter). No Collusion, so they go crazy!"},{"text":"....doing things that nobody thought possible, despite the never ending and corrupt Russia Investigation, which takes tremendous time and focus. No Collusion or Obstruction (other than I fight back), so now they do the Unthinkable, and RAID a lawyers office for information! BAD!"},{"text":"If President Obama had crossed his stated Red Line In The Sand, the Syrian disaster would have ended long ago! Animal Assad would have been history!"},{"text":"Many dead, including women and children, in mindless CHEMICAL attack in Syria. Area of atrocity is in lockdown and encircled by Syrian Army, making it completely inaccessible to outside world. President Putin, Russia and Iran are responsible for backing Animal Assad. Big price..."},{"text":"Lawmakers of the House Judiciary Committee are angrily accusing the Department of Justice of missing the Thursday Deadline for turning over UNREDACTED Documents relating to FISA abuse, FBI, Comey, Lynch, McCabe, Clinton Emails and much more. Slow walking - what is going on? BAD!"},{"text":"China, which is a great economic power, is considered a Developing Nation within the World Trade Organization. They therefore get tremendous perks and advantages, especially over the U.S. Does anybody think this is fair. We were badly represented. The WTO is unfair to U.S."},{"text":"The Fake News Washington Post, Amazon’s “chief lobbyist,” has another (of many) phony headlines, “Trump Defiant As China Adds Trade Penalties.” WRONG! Should read, “Trump Defiant as U.S. Adds Trade Penalties, Will End Barriers And Massive  I.P. Theft.” Typically bad reporting!"},{"text":"So sad that the Department of “Justice” and the FBI are slow walking, or even not giving, the unredacted documents requested by Congress. An embarrassment to our country!"},{"text":"Governor Jerry “Moonbeam” Brown pardoned 5 criminal illegal aliens whose crimes include (1) Kidnapping and Robbery (2) Badly beating wife and threatening a crime with intent to terrorize (3) Dealing drugs. Is this really what the great people of California want? @FoxNews"},{"text":"Obama Administration legalized bump stocks. BAD IDEA. As I promised, today the Department of Justice will issue the rule banning BUMP STOCKS with a mandated comment period. We will BAN all devices that turn legal weapons into illegal machine guns."},{"text":"I called President Putin of Russia to congratulate him on his election victory (in past, Obama called him also). The Fake News Media is crazed because they wanted me to excoriate him. They are wrong! Getting along with Russia (and others) is a good thing, not a bad thing......."},{"text":"Hundreds of good people, including very important Ambassadors and Judges, are being blocked and/or slow walked by the Democrats in the Senate. Many important positions in Government are unfilled because of this obstruction. Worst in U.S. history!"},{"text":"The Democrats continue to Obstruct the confirmation of hundreds of good and talented people who are needed to run our government...A record in U.S. history. State Department, Ambassadors and many others are being slow walked. Senate must approve NOW!"},{"text":"The European Union, wonderful countries who treat the U.S. very badly on trade, are complaining about the tariffs on Steel &amp; Aluminum. If they drop their horrific barriers &amp; tariffs on U.S. products going in, we will likewise drop ours. Big Deficit. If not, we Tax Cars etc. FAIR!"},{"text":"We are deeply saddened by the tragic situation in Yountville and mourn the loss of three incredible women who cared for our Veterans."},{"text":"From Bush 1 to present, our Country has lost more than 55,000 factories, 6,000,000 manufacturing jobs and accumulated Trade Deficits of more than 12 Trillion Dollars. Last year we had a Trade Deficit of almost 800 Billion Dollars. Bad Policies &amp; Leadership. Must WIN again!  #MAGA"},{"text":"@MarkBurnettTV @RealRomaDowney From Bush 1 to present, our Country has lost more than 55,000 factories, 6,000,000 manufacturing jobs and accumulated Trade Deficits of more than 12 Trillion Dollars. Last year we had a Trade Deficit of almost 800 Billion Dollars. Bad policies &amp; leadership. Must win again!  #MAGA"},{"text":"We have large trade deficits with Mexico and Canada. NAFTA, which is under renegotiation right now, has been a bad deal for U.S.A. Massive relocation of companies &amp; jobs. Tariffs on Steel and Aluminum will only come off if new &amp; fair NAFTA agreement is signed. Also, Canada must.."},{"text":"We must protect our country and our workers. Our steel industry is in bad shape. IF YOU DON’T HAVE STEEL, YOU DON’T HAVE A COUNTRY!"},{"text":"Our Steel and Aluminum industries (and many others) have been decimated by decades of unfair trade and bad policy with countries from around the world. We must not let our country, companies and workers be taken advantage of any longer. We want free, fair and SMART TRADE!"},{"text":"Today, in the center of this great Chamber lies Billy Graham – an Ambassador for Christ who reminded the world of the power of prayer and the gift of God’s grace. https://t.co/5aMh8nFPJW"},{"text":"RT @FoxNews: President @realDonaldTrump on Dem FISA memo: \"A lot of bad things happened on the other side, not on this side, but the other…"},{"text":"“School shooting survivor says he quit @CNN Town Hall after refusing scripted question.” @TuckerCarlson. Just like so much of CNN, Fake News. That’s why their ratings are so bad! MSNBC may be worse."},{"text":"....immediately fire back if a savage sicko came to a school with bad intentions. Highly trained teachers would also serve as a deterrent to the cowards that do this. Far more assets at much less cost than guards. A “gun free” school is a magnet for bad people. ATTACKS WOULD END!"},{"text":"Bad ratings @CNN &amp; @MSNBC got scammed when they covered the anti-Trump Russia rally wall-to-wall. They probably knew it was Fake News but, because it was a rally against me, they pushed it hard anyway. Two really dishonest newscasters, but the public is wise!"},{"text":"Very sad that the FBI missed all of the many signals sent out by the Florida school shooter. This is not acceptable. They are spending too much time trying to prove Russian collusion with the Trump campaign - there is no collusion. Get back to the basics and make us all proud!"},{"text":"Cannot believe how BADLY DACA recipients have been treated by the Democrats...totally abandoned! Republicans are still working hard."},{"text":"So many signs that the Florida shooter was mentally disturbed, even expelled from school for bad and erratic behavior. Neighbors and classmates knew he was a big problem. Must always report such instances to authorities, again and again!"},{"text":"Without more Republicans in Congress, we were forced to increase spending on things we do not like or want in order to finally, after many years of depletion, take care of our Military. Sadly, we needed some Dem votes for passage. Must elect more Republicans in 2018 Election!"},{"text":"The Democrats are pushing for Universal HealthCare while thousands of people are marching in the UK because their U system is going broke and not working. Dems want to greatly raise taxes for really bad and non-personal medical care. No thanks!"},{"text":"Thank you to Brandon Judd of the National Border Patrol Council for his strong statement on @foxandfriends that we very badly NEED THE WALL. Must also end loophole of “catch &amp; release” and clean up the legal and other procedures at the border NOW for Safety &amp; Security reasons."},{"text":"....The Wall will be paid for, directly or indirectly, or through longer term reimbursement, by Mexico, which has a ridiculous $71 billion dollar trade surplus with the U.S. The $20 billion dollar Wall is “peanuts” compared to what Mexico makes from the U.S. NAFTA is a bad joke!"},{"text":"I don’t believe the Democrats really want to see a deal on DACA. They are all talk and no action. This is the time but, day by day, they are blowing the one great opportunity they have. Too bad!"},{"text":"The Democrats are all talk and no action. They are doing nothing to fix DACA. Great opportunity missed. Too bad!"},{"text":"Sadly, Democrats want to stop paying our troops and government workers in order to give a sweetheart deal, not a fair deal, for DACA. Take care of our Military, and our Country, FIRST!"},{"text":"....countries which are doing badly. I want a merit based system of immigration and people who will help take our country to the next level. I want safety and security for our people. I want to stop the massive inflow of drugs. I want to fund our military, not do a Dem defund...."},{"text":"Reason I canceled my trip to London is that I am not a big fan of the Obama Administration having sold perhaps the best located and finest embassy in London for “peanuts,” only to build a new one in an off location for 1.2 billion dollars. Bad deal. Wanted me to cut ribbon-NO!"},{"text":"With that being said, I have personally directed the fix to the unmasking process since taking office and today’s vote is about foreign surveillance of foreign bad guys on foreign land. We need it! Get smart!"},{"text":"“House votes on controversial FISA ACT today.” This is the act that may have been used, with the help of the discredited and phony Dossier, to so badly surveil and abuse the Trump Campaign by the previous administration and others?"},{"text":"The Stock Market is setting record after record and unemployment is at a 17 year low. So many things accomplished by the Trump Administration, perhaps more than any other President in first year. Sadly, will never be reported correctly by the Fake News Media!"},{"text":"“The President has accomplished some absolutely historic things during this past year.” Thank you Charlie Kirk of Turning Points USA. Sadly, the Fake Mainstream Media will NEVER talk about our accomplishments in their end of year reviews. We are compiling a long &amp; beautiful list."},{"text":"The Massive Tax Cuts, which the Fake News Media is desperate to write badly about so as to please their Democrat bosses, will soon be kicking in and will speak for themselves. Companies are already making big payments to workers. Dems want to raise taxes, hate these big Cuts!"},{"text":"The people of Alabama will do the right thing. Doug Jones is Pro-Abortion, weak on Crime, Military and Illegal Immigration, Bad for Gun Owners and Veterans and against the WALL. Jones is a Pelosi/Schumer Puppet. Roy Moore will always vote with us. VOTE ROY MOORE!"},{"text":"Another false story, this time in the Failing @nytimes, that I watch 4-8 hours of television a day - Wrong!  Also, I seldom, if ever, watch CNN or MSNBC, both of which I consider Fake News. I never watch Don Lemon, who I once called the “dumbest man on television!” Bad Reporting."},{"text":"Fines and penalties against Wells Fargo Bank for their bad acts against their customers and others will not be dropped, as has incorrectly been reported, but will be pursued and, if anything, substantially increased. I will cut Regs but make penalties severe when caught cheating!"},{"text":"LAST thing the Make America Great Again Agenda needs is a Liberal Democrat in Senate where we have so little margin for victory already. The Pelosi/Schumer Puppet Jones would vote against us 100% of the time. He’s bad on Crime, Life, Border, Vets, Guns &amp; Military. VOTE ROY MOORE!"},{"text":"People who lost money when the Stock Market went down 350 points based on the False and Dishonest reporting of Brian Ross of @ABC News (he has been suspended), should consider hiring a lawyer and suing ABC for the damages this bad reporting has caused - many millions of dollars!"},{"text":"RT @IvankaTrump: Thank you for the warm welcome. I’m excited to be in Hyderabad, India for #GES2017. https://t.co/1U08h5L9Rm"},{"text":"We should have a contest as to which of the Networks, plus CNN and not including Fox, is the most dishonest, corrupt and/or distorted in its political coverage of your favorite President (me). They are all bad. Winner to receive the FAKE NEWS TROPHY!"},{"text":"I endorsed Luther Strange in the Alabama Primary. He shot way up in the polls but it wasn’t enough. Can’t let Schumer/Pelosi win this race. Liberal Jones would be BAD!"},{"text":"The last thing we need in Alabama and the U.S. Senate is a Schumer/Pelosi puppet who is WEAK on Crime, WEAK on the Border, Bad for our Military and our great Vets, Bad for our 2nd Amendment, AND WANTS TO RAISES TAXES TO THE SKY. Jones would be a disaster!"},{"text":"The NFL is now thinking about a new idea - keeping teams in the Locker Room during the National Anthem next season. That’s almost as bad as kneeling! When will the highly paid Commissioner finally get tough and smart? This issue is killing your league!....."},{"text":"It wasn’t the White House, it wasn’t the State Department, it wasn’t father LaVar’s so-called people on the ground in China that got his son out of a long term prison sentence - IT WAS ME. Too bad! LaVar is just a poor man’s version of Don King, but without the hair. Just think.."},{"text":"Border Patrol Officer killed at Southern Border, another badly hurt. We will seek out and bring to justice those responsible. We will, and must, build the Wall!"},{"text":"Sen. Jeff Flake(y), who is unelectable in the Great State of Arizona (quit race, anemic polls) was caught (purposely) on “mike” saying bad things about your favorite President. He’ll be a NO on tax cuts because his political career anyway is “toast.”"},{"text":"The Al Frankenstien picture is really bad, speaks a thousand words. Where do his hands go in pictures 2, 3, 4, 5 &amp; 6 while she sleeps? ....."},{"text":"Need all on the UN Security Council to vote to renew the Joint Investigative Mechanism for Syria to ensure that Assad Regime does not commit mass murder with chemical weapons ever again."},{"text":"...They should realize that these relationships are a good thing, not a bad thing. The U.S. is being respected again. Watch Trade!"},{"text":"While in the Philippines I was forced to watch @CNN, which I have not done in months, and again realized how bad, and FAKE, it is. Loser!"},{"text":"When will all the haters and fools out there realize that having a good relationship with Russia is a good thing, not a bad thing. There always playing politics - bad for our country. I want to solve North Korea, Syria, Ukraine, terrorism, and Russia can greatly help!"},{"text":"...Americans do what we do best: we pull together. We join hands. We lock arms and through the tears and the sadness, we stand strong... https://t.co/qkCPgtKGkA"},{"text":"ISIS just claimed the Degenerate Animal who killed, and so badly wounded, the wonderful people on the West Side, was \"their soldier.\" ....."},{"text":"The @TuckerCarlson opening statement about our once cherished and great FBI was so sad to watch. James Comey's leadership was a disaster!"},{"text":"NYC terrorist was happy as he asked to hang ISIS flag in his hospital room. He killed 8 people, badly injured 12. SHOULD GET DEATH PENALTY!"},{"text":"...\"collusion,\" which doesn't exist. The Dems are using this terrible (and bad for our country) Witch Hunt for evil politics, but the R's..."},{"text":"While not at all presidential I must point out that the Sloppy Michael Moore Show on Broadway was a TOTAL BOMB and was forced to close. Sad!"},{"text":"Just read the nice remarks by President Jimmy Carter about me and how badly I am treated by the press (Fake News). Thank you Mr. President!"},{"text":"Ed Gillespie will turn the really bad Virginia economy #'s around, and fast. Strong on crime, he might even save our great statues/heritage!"},{"text":"Isn't it sad that lightweight Senator Bob Corker, who couldn't get re-elected in the Great State of Tennessee, will now fight Tax Cuts plus!"},{"text":"Bob Corker, who helped President O give us the bad Iran Deal &amp; couldn't get elected dog catcher in Tennessee, is now fighting Tax Cuts...."},{"text":"Democrat Congresswoman totally fabricated what I said to the wife of a soldier who died in action (and I have proof). Sad!"},{"text":"The wonderful people of Puerto Rico, with their unmatched spirit, know how bad things were before the H's. I will always be with them!"},{"text":"Sadly, they and others are Fake News, and the public is just beginning to figure it out! https://t.co/8B8AyA7V1s"},{"text":"With all of the Fake News coming out of NBC and the Networks, at what point is it appropriate to challenge their License? Bad for country!"},{"text":"With Jemele Hill at the mike, it is no wonder ESPN ratings have \"tanked,\" in fact, tanked so badly it is the talk of the industry!"},{"text":"I called Chuck Schumer yesterday to see if the Dems want to do a great HealthCare Bill. ObamaCare is badly broken, big premiums. Who knows!"},{"text":"Heading over to the @UN to meet with Ambassador @NikkiHaley and all of her great representatives! #USA🇺🇸"},{"text":"...owed to Wall Street and the banks which, sadly, must be dealt with. Food, water and medical are top priorities - and doing well. #FEMA"},{"text":"Great solidarity for our National Anthem and for our Country. Standing with locked arms is good, kneeling is not acceptable. Bad ratings!"},{"text":"Arizona had a 116% increase in ObamaCare premiums last year, with deductibles very high. Chuck Schumer sold John McCain a bill of goods. Sad"},{"text":"The greatest influence over our election was the Fake News Media \"screaming\" for Crooked Hillary Clinton. Next, she was a bad candidate!"},{"text":"I was saddened to see how bad the ratings were on the Emmys last night - the worst ever. Smartest people of them all are the \"DEPLORABLES.\""},{"text":"I spoke with President Moon of South Korea last night. Asked him how Rocket Man is doing. Long gas lines forming in North Korea. Too bad!"},{"text":"ESPN is paying a really big price for its politics (and bad programming). People are dumping it in RECORD numbers. Apologize for untruth!"},{"text":"FLORIDA- \nVisit https://t.co/pdBaD9t8SK to find shelters, road closures, &amp; evacuation routes. Helpful Twitter list: https://t.co/BUMVlxGFe8 https://t.co/ncnuqCeB5K"},{"text":"Will be leaving for Missouri soon for a speech on tax cuts and tax reform - so badly needed!"},{"text":"..(enthusiastic, dynamic and fun) and the American Legion - V.A. (respectful and strong). Too bad the Dems have no one who can change tones!"},{"text":"...(enthusiastic, dynamic and fun) and the American Legion - V.A. (respectful and strong). To bad the Dems have no one who can change tones!"},{"text":"...(enthusiastic, dynamic and fun) and the American Legion - V.A. (respectful and strong).To bad the Dems have no one who can change tones!"},{"text":"Sad to see the history and culture of our great country being ripped apart with the removal of our beautiful statues and monuments. You....."},{"text":"Made additional remarks on Charlottesville and realize once again that the #Fake News Media will never be satisfied...truly bad people!"},{"text":"Condolences to the family of the young woman killed today, and best regards to all of those injured, in Charlottesville, Virginia. So sad!"},{"text":"Am in Bedminster for meetings &amp; press conference on V.A. &amp; all that we have done, and are doing, to make it better-but Charlottesville sad!"},{"text":"Senator @lisamurkowski of the Great State of Alaska really let the Republicans, and our country, down yesterday. Too bad!"},{"text":"So many stories about me in the @washingtonpost are Fake News. They are as bad as ratings challenged @CNN. Lobbyist for Amazon and taxes?"},{"text":"The Amazon Washington Post fabricated the facts on my ending massive, dangerous, and wasteful payments to Syrian rebels fighting Assad....."},{"text":"It's hard to read the Failing New York Times or the Amazon Washington Post because every story/opinion, even if should be positive, is bad!"},{"text":"It's very sad that Republicans, even some that were carried over the line on my back, do very little to protect their President."},{"text":"The ABC/Washington Post Poll, even though almost 40% is not bad at this time, was just about the most inaccurate poll around election time!"},{"text":"My son Donald did a good job last night. He was open, transparent and innocent. This is the greatest Witch Hunt in political history. Sad!"},{"text":"The G 20 Summit was a great success for the U.S. - Explained that the U.S. must fix the many bad trade deals it has made. Will get done!"},{"text":"Crazy Joe Scarborough and dumb as a rock Mika are not bad people, but their low rated show is dominated by their NBC bosses. Too bad!"},{"text":"Watched low rated @Morning_Joe for first time in long time. FAKE NEWS. He called me to stop a National Enquirer article. I said no! Bad show"},{"text":"...to Mar-a-Lago 3 nights in a row around New Year's Eve, and insisted on joining me. She was bleeding badly from a face-lift. I said no!"},{"text":"I heard poorly rated @Morning_Joe speaks badly of me (don't watch anymore). Then how come low I.Q. Crazy Mika, along with Psycho Joe, came.."},{"text":"New Sugar deal negotiated with Mexico is a very good one for both Mexico and the U.S. Had no deal for many years which hurt U.S. badly."},{"text":"I certainly hope the Democrats do not force Nancy P out. That would be very bad for the Republican Party - and please let Cryin' Chuck stay!"},{"text":"After 7 months of investigations &amp; committee hearings about my \"collusion with the Russians,\"  nobody has been able to show any proof. Sad!"},{"text":"You are witnessing the single greatest WITCH HUNT in American political history - led by some very bad and conflicted people!  #MAGA"},{"text":"Rep. Steve Scalise of Louisiana, a true friend and patriot, was badly injured but will fully recover. Our thoughts and prayers are with him."},{"text":"The Fake News Media has never been so wrong or so dirty. Purposely incorrect stories and phony sources to meet their agenda of hate. Sad!"},{"text":"Pathetic excuse by London Mayor Sadiq Khan who had to think fast on his \"no reason to be alarmed\" statement. MSM is working hard to sell it!"},{"text":".@foxandfriends  Dems are taking forever to approve my people, including Ambassadors. They are nothing but OBSTRUCTIONISTS! Want approvals."},{"text":"We have a MASSIVE trade deficit with Germany, plus they pay FAR LESS than they should on NATO &amp; military. Very bad for U.S. This will change"},{"text":"The Democrats have said some of the worst things about James Comey, including the fact that he should be fired, but now they play so sad!"},{"text":"Wow,the Fake News media did everything in its power to make the Republican Healthcare victory look as bad as possible.Far better than Ocare!"},{"text":"FBI Director Comey was the best thing that ever happened to Hillary Clinton in that he gave her a free pass for many bad deeds! The phony..."},{"text":"North Korea disrespected the wishes of China &amp; its highly respected President when it launched, though unsuccessfully, a missile today. Bad!"},{"text":"Democrats are trying to bail out insurance companies from disastrous #ObamaCare, and Puerto Rico with your tax dollars. Sad!"},{"text":"The U.S. recorded its slowest economic growth in five years (2016). GDP up only 1.6%. Trade deficits hurt the economy very badly."},{"text":"Eventually, but at a later date so we can get started early, Mexico will be paying, in some form, for the badly needed border wall."},{"text":"The Democrats don't want money from budget going to border wall despite the fact that it will stop drugs and very bad MS 13 gang members."},{"text":"Republicans must get out today and VOTE in Georgia 6. Force runoff and easy win! Dem Ossoff will raise your taxes-very bad on crime &amp; 2nd A."},{"text":"Democrat Jon Ossoff would be a disaster in Congress. VERY weak on crime and illegal immigration, bad for jobs and wants higher taxes. Say NO"},{"text":"The weak illegal immigration policies of the Obama Admin. allowed bad MS 13 gangs to form in cities across U.S. We are removing them fast!"},{"text":"The Fake Media (not Real Media) has gotten even worse since the election. Every story is badly slanted. We have to hold them to the truth!"},{"text":"The recent Kansas election (Congress) was a really big media event, until the Republicans won. Now they play the same game with Georgia-BAD!"},{"text":"So sad to hear of the terrorist attack in Egypt. U.S. strongly condemns. I have great..."},{"text":"..not associated with Russia. Trump team spied on before he was nominated.\" If this is true, does not get much bigger. Would be sad for U.S."},{"text":"The Republican House Freedom Caucus was able to snatch defeat from the jaws of victory. After so many bad years they were ready for a win!"},{"text":"After seven horrible years of ObamaCare (skyrocketing premiums &amp; deductibles, bad healthcare), this is finally your chance for a great plan!"},{"text":"North Korea is behaving very badly. They have been \"playing\" the United States for years. China has done little to help!"},{"text":"Arnold Schwarzenegger isn't voluntarily leaving the Apprentice, he was fired by his bad (pathetic) ratings, not by me. Sad end to great show"},{"text":"How low has President Obama gone to tapp my phones during the very sacred election process. This is Nixon/Watergate. Bad (or sick) guy!"},{"text":"Just out: The same Russian Ambassador that met Jeff Sessions visited the Obama White House 22 times, and 4 times last year alone."},{"text":"For first time the failing @nytimes will take an ad (a bad one) to help save its failing reputation. Try reporting accurately &amp; fairly!"},{"text":"FAKE NEWS media knowingly doesn't tell the truth. A great danger to our country. The failing @nytimes has become a joke. Likewise @CNN. Sad!"},{"text":"The so-called angry crowds in home districts of some Republicans are actually, in numerous cases, planned out by liberal activists. Sad!"},{"text":"The Democrats had to come up with a story as to why they lost the election, and so badly (306), so they made up a story - RUSSIA. Fake news!"},{"text":"I am so proud of my daughter Ivanka. To be abused and treated so badly by the media, and to still hold her head so high, is truly wonderful!"},{"text":"Just cannot  believe a judge would put our country in such peril. If something happens blame him and court system. People pouring in. Bad!"},{"text":"The judge opens up our country to potential terrorists and others that do not have our best interests at heart. Bad people are very happy!"},{"text":"Because the ban was lifted by a judge, many very bad and dangerous people may be pouring into our country. A terrible decision"},{"text":"What is our country coming to when a judge can halt a Homeland Security travel ban and anyone, even with bad intentions, can come into U.S.?"},{"text":"After being forced to apologize for its bad and inaccurate coverage of me after winning the election, the FAKE NEWS @nytimes is still lost!"},{"text":"Yes, Arnold Schwarzenegger did a really bad job as Governor of California and even worse on the Apprentice...but at least he tried hard!"},{"text":"Everybody is arguing whether or not it is a BAN. Call it what you want, it is about keeping bad people (with bad intentions) out of country!"},{"text":"If the ban were announced with a one week notice, the \"bad\" would rush into our country during that week. A lot of bad \"dudes\" out there!"},{"text":"The joint statement of former presidential candidates John McCain &amp; Lindsey Graham is wrong - they are sadly weak on immigration. The two..."},{"text":"Spoke at the Congressional @GOP Retreat in Philadelphia, PA. this afternoon w/ @VP, @SenateMajLdr, @SpeakerRyan. Th… https://t.co/ALSADGrwoe"},{"text":"of jobs and companies lost. If Mexico is unwilling to pay for the badly needed wall, then it would be better to cancel the upcoming meeting."},{"text":"Watched protests yesterday but was under the impression that we just had an election! Why didn't these people vote? Celebs hurt cause badly."},{"text":".@TheAlabamaBand was great last night in D.C. playing for 147 Diplomats and Ambassadors from countries around the world. Thanks Alabama!"},{"text":"No wonder the Today Show on biased @NBC is doing so badly compared to its glorious past. Little credibility!"},{"text":".@NBCNews is bad but Saturday Night Live is the worst of NBC. Not funny, cast is terrible, always a complete hit job. Really bad television!"},{"text":"mention crime infested) rather than falsely complaining about the election results. All talk, talk, talk - no action or results. Sad!"},{"text":"James Clapper called me yesterday to denounce the false and fictitious report that was illegally circulated. Made up, phony facts.Too bad!"},{"text":"\"groveling\" when he totally changed a 16 year old story that he had written in order to make me look bad. Just more very dishonest media!"},{"text":"Having a good relationship with Russia is a good thing, not a bad thing. Only \"stupid\" people, or fools, would think that it is bad! We....."},{"text":"The Democrats, lead by head clown Chuck Schumer, know how bad ObamaCare is and what a mess they are in. Instead of working to fix it, they.."},{"text":"Happy New Year to all, including to my many enemies and those who have fought me and lost so badly they just don't know what to do. Love!"},{"text":"The United Nations has such great potential but right now it is just a club for people to get together, talk and have a good time. So sad!"},{"text":"The big loss yesterday for Israel in the United Nations will make it much harder to negotiate peace.Too bad, but we will get it done anyway!"},{"text":"Just watched @NBCNightlyNews - So biased, inaccurate and bad, point after point. Just can't get much worse, although @CNN is right up there!"},{"text":"If the press would cover me accurately &amp; honorably, I would have far less reason to \"tweet.\" Sadly, I don't know if that will ever happen!"},{"text":"Just tried watching Saturday Night Live - unwatchable! Totally biased, not funny and the Baldwin impersonation just can't get any worse. Sad"},{"text":"I thought that @CNN would get better after they failed so badly in their support of Hillary Clinton however, since election, they are worse!"},{"text":"\"@FiIibuster: @jeffzeleny Pathetic - you have no sufficient evidence that Donald Trump did not suffer from voter fraud, shame! Bad reporter."},{"text":"Trump is going to be our President. We owe him an open mind and the chance to lead.\" So much time and money will be spent - same result! Sad"},{"text":"The Green Party scam to fill up their coffers by asking for impossible recounts is now being joined by the badly defeated &amp; demoralized Dems"},{"text":"Bus crash in Tennessee so sad &amp; so terrible. Condolences to all family members and loved ones. These beautiful children will be remembered!"},{"text":"Many people would like to see @Nigel_Farage represent Great Britain as their Ambassador to the United States. He would do a great job!"},{"text":"The ONLY bad thing about winning the Presidency is that I did not have the time to go through a long but winning trial on Trump U. Too bad!"},{"text":"The @nytimes sent a letter to their subscribers apologizing for their BAD coverage of me. I wonder if it will change - doubt it?"},{"text":"Look at the way Crooked Hillary is handling the e-mail case and the total mess she is in. She is unfit to be president. Bad judgement!"},{"text":"If my people said the things about me that Podesta &amp; Hillary's people said about her, I would fire them out of self respect. \"Bad instincts\""},{"text":"As election looms, some bad news for Clinton, Democrats:\nhttps://t.co/7aWWVQPjTo"},{"text":"What They Are Saying About @realDonaldTrump's GREAT Debate and @HillaryClinton's Bad Performance… https://t.co/1O86a49vJZ"},{"text":"Bernie Sanders on HRC: Bad Judgement. John Podesta on HRC: Bad Instincts. #BigLeagueTruth #Debate"},{"text":"The election is absolutely being rigged by the dishonest and distorted media pushing Crooked Hillary - but also at many polling places - SAD"},{"text":"They let Crooked &amp; the Gang off the hook for the crime, but it looks like the cover-up is just as bad. Unbelievable! https://t.co/eWjHoq20Dw"},{"text":"Our very weak and ineffective leader, Paul Ryan, had a bad conference call where his members went wild at his disloyalty."},{"text":"CNN is the worst - fortunately they have bad ratings because everyone knows they are biased. https://t.co/oFRfNY2rUY"},{"text":"RT @atensnut: How many times must it be said? Actions speak louder than words. DT said bad things!HRC threatened me after BC raped me."},{"text":"The media and establishment want me out of the race so badly -  I WILL NEVER DROP OUT OF THE RACE, WILL NEVER LET MY SUPPORTERS DOWN! #MAGA"},{"text":"RT @TeamTrump: Obama-Clinton FAILED foreign policy:\n-Bad nuclear deal\n-Ransom payment to leading state sponsor of terror\n-Sharing classifie…"},{"text":"Wow, did you just hear Bill Clinton's statement on how bad ObamaCare is. Hillary not happy. As I have been saying, REPEAL AND REPLACE!"},{"text":"Wow, just saw the really bad @CNN ratings. People don't want to watch bad product that only builds up Crooked Hillary."},{"text":"The so-called Commission on Presidential Debates admitted to us that the DJT audio &amp; sound level was very bad. So why didn't they fix it?"},{"text":"I won the debate if you decide without watching the totally one-sided \"spin\" that followed. This despite the really bad microphone."},{"text":"Using Alicia M in the debate as a paragon of virtue just shows that Crooked Hillary suffers from BAD JUDGEMENT! Hillary was set up by a con."},{"text":"Wow, did you see how badly @CNN (Clinton News Network) is doing in the ratings. With people like @donlemon, who could expect any more?"},{"text":"HILLARY'S BAD TAX HABIT! https://t.co/x3FBy8Hdq2"},{"text":".@HillaryClinton channels John Kerry on trade: she was for bad trade deals before she was against them. #TPP #Debates2016"},{"text":"Really sad news: The great Arnold Palmer, the \"King,\" has died. There was no-one like him - a true champion! He will be truly missed."},{"text":"Many on the team and staff of Bernie Sanders have been treated badly by the Hillary Clinton campaign - and they like Trump on trade, a lot!"},{"text":"Crooked Hillary's bad judgement forced her to announce that she would go to Charlotte on Saturday to grandstand. Dem pols said no way, dumb!"},{"text":"Never met but never liked dopey Robert Gates. Look at the mess the U.S. is in. Always speaks badly of his many bosses, including Obama."},{"text":"My lawyers want to sue the failing @nytimes so badly for irresponsible intent. I said no (for now), but they are watching. Really disgusting"},{"text":"The failing @nytimes has gone nuts that Crooked Hillary is doing so badly. They are willing to say anything, has become a laughingstock rag!"},{"text":"Really sad that Republicans would allow themselves to be used in a Clinton ad. Lindsey Graham, Romney, Flake, Sass. SUPREME COURT, REMEMBER!"},{"text":"Henry McMaster, Lt. Governor of South Carolina who endorsed me, beat failed @CNN announcer Bakari Sellers, so badly. Funny!"},{"text":"President Obama &amp; Putin fail to reach deal on Syria - so what else is new? Obama is not a natural deal maker. Only makes bad deals!"},{"text":"The Great State of Arizona, where I just had a massive rally (amazing people), has a very weak and ineffective Senator, Jeff Flake. Sad!"},{"text":"Now that African-Americans are seeing what a bad job Hillary type policy and management has done to the inner-cities, they want TRUMP!"},{"text":"Crooked Hillary's brainpower is highly overrated.Probably why her decision making is so bad or, as stated by Bernie S, she has BAD JUDGEMENT"},{"text":"Look how bad it is getting! How much more crime, how many more shootings, will it take for African-Americans and Latinos to vote Trump=SAFE!"},{"text":"So many in the African-American community are doing so badly, poverty and crime way up, employment and jobs way down: I will fix it, promise"},{"text":"Certain Republicans who have lost to me would rather save face by fighting me than see the U.S.Supreme Court get proper appointments. Sad!"},{"text":"Morning Joe's weakness is its low ratings. I don't watch anymore but I heard he went wild against Rudy Giuliani and #2A - sad &amp; irrelevant!"},{"text":"Michael Morell, the lightweight former Acting Director of C.I.A., and a man who has made serious bad calls, is a total Clinton flunky!"},{"text":"Hillary Clinton is being badly criticized for her poor performance in answering questions. Let us all see what happens!"},{"text":"Hillary Clinton has bad judgment and is unfit to serve as President.\nhttps://t.co/3EzG620fpT"},{"text":"Hillary Clinton should not be given national security briefings in that she is a lose cannon with extraordinarily bad judgement &amp; insticts."},{"text":"Even Bill is tired of the lies, SAD! https://t.co/LPk1OkwH9P"},{"text":"General John Allen, who I never met but spoke against me last night, failed badly in his fight against ISIS. His record = BAD  #NeverHillary"},{"text":"The media coverage this morning of the very average Clinton speech and Convention is a joke. @CNN and the little watched @Morning_Joe = SAD!"},{"text":"The Democratic Convention has paid ZERO respect to the great police and law enforcement professionals of our country. No recognition - SAD!"},{"text":"The invention of email has proven to be a very bad thing for Crooked Hillary in that it has proven her to be both incompetent and a liar!"},{"text":"Pocahontas bombed last night! Sad to watch."},{"text":"Why aren't the Democrats speaking about ISIS, bad trade deals, broken borders, police and law and order. The Republican Convention was great"},{"text":"Sad to watch Bernie Sanders abandon his revolution. We welcome all voters who want to fix our rigged system and bring back our jobs."},{"text":"Hillary was involved in the e-mail scandal because she is the only one with judgement so bad that such a thing could have happened!"},{"text":"How much BAD JUDGEMENT was on display by the people in DNC in writing those really dumb e-mails, using even religion, against Bernie!"},{"text":"Crooked Hillary Clinton was not at all loyal to the person in her rigged system that pushed her over the top, DWS. Too bad Bernie flamed out"},{"text":"Sorry folks, but Bernie Sanders is exhausted, just can't go on any longer. He is trying to dismiss the new e-mails and DNC disrespect. SAD!"},{"text":"Wow, President Obama's brother, Malik, just announced that he is voting for me. Was probably treated badly by president-like everybody else!"},{"text":"The Crooked Hillary V.P. choice is VERY disrespectful to Bernie Sanders and all of his supporters. Just another case of BAD JUDGEMENT by H!"},{"text":"The Wikileaks e-mail release today was so bad to Sanders that it will make it impossible for him to support her, unless he is a fraud!"},{"text":"Pocahontas wanted V.P. slot so badly but wasn't chosen because she has done nothing in the Senate. Also, Crooked Hillary hates her!"},{"text":"I will be on @60Minutes tonight at 7:00 P.M. with Mike Pence talking about LAW AND ORDER and many other subjects! Bad times for divided USA!"},{"text":"It doesn't matter that Crooked Hillary has experience, look at all of the bad decisions she has made. Bernie said she has bad judgement!"},{"text":"As the days and weeks go by,  we see what a total mess our country (and world) is in - Crooked Hillary Clinton led Obama into bad decisions!"},{"text":"Donate Today To Help Make America Great Again! You Can Help Stop Crooked Hillary Clinton! https://t.co/VlObaDG4eR https://t.co/mBDwW5orrd"},{"text":"Very sad that a person who has made so many mistakes, Crooked Hillary Clinton, can put out such false and vicious ads with her phony money!"},{"text":"Is Supreme Court Justice Ruth Bader Ginsburg going to apologize to me for her misconduct? Big mistake by an incompetent judge!"},{"text":"Despite spending $500k a day on TV ads alone #CrookedHillary falls flat in nationwide @QuinnipiacPoll. Having ZERO impact. Sad!!"},{"text":"Is President Obama trying to destroy Israel with all his bad moves? Think about it and let me know!"},{"text":"To all the Bernie voters who want to stop bad trade deals &amp; global special interests, we welcome you with open arms. People first."},{"text":"The media is so dishonest. If I make a statement, they twist it and turn it to make it sound bad or foolish.They think the public is stupid!"},{"text":"Isn't it sad that on a day of national tragedy Hillary Clinton is answering softball questions about her email lies on @CNN?"},{"text":"Crooked Hillary has once again been proven to be a person who is dishonest, incompetent and of very bad judgement."},{"text":"Crooked Hillary Clinton is unfit to serve as President of the U.S. Her temperament is weak and her opponents are strong. BAD JUDGEMENT!"},{"text":"The system is rigged. General Petraeus got in trouble for far less. Very very unfair! As usual, bad judgment."},{"text":"As Bernie Sanders said, Hillary Clinton has bad judgement. Bill's meeting was probably initiated and demanded by Hillary!"},{"text":"For reasons only they can explain, the @USChamber wants to continue our bad trade deals rather than renegotiating and making them better."},{"text":"Yet another terrorist attack, this time in Turkey. Will\nthe world ever realize what is going on? So sad."},{"text":"Hillary Clinton’s Presidency would be catastrophic for\nthe future of our country. She is ill-fit with bad judgment."},{"text":"\"@kridan1: Canceled cable - sick of their bad coverage of you and the fawning over Clinton ... Listened to your great speech on YouTube\""},{"text":"Crooked Hillary Clinton got Brexit wrong. I said LEAVE will win. She has no sense of markets and such bad judgement. Only a question of time"},{"text":"Clinton is trying to wash away her bad judgement call on BREXIT with big dollar ads. Disgraceful!"},{"text":"George Will, one of the most overrated political pundits (who lost his way long ago), has left the Republican Party.He's made many bad calls"},{"text":"If you want to know about Hillary Clinton's honesty &amp; judgment, ask the family of Ambassador Stevens."},{"text":"I am \"the king of debt.\"That has been great for me as a businessman, but is bad for the country. I made a fortune off of debt, will fix U.S."},{"text":"I will be making a big speech tomorrow to discuss the failed policies and bad judgment of Crooked Hillary Clinton."},{"text":"Crooked Hillary Clinton is totally unfit to be our president-really bad judgement and a temperament, according to new book, which is a mess!"},{"text":"Really bad shooting in Orlando. Police investigating possible terrorism. Many people dead and wounded."},{"text":"Sad case- @USATODAY did article saying I don't pay bills- false, only don't pay when work is shoddy, bad, or not done! They should do same!"},{"text":"Nobody is watching @Morning_Joe anymore. Gone off the deep end - bad ratings. You won't believe what I am watching now!"},{"text":"A former Secret Service Agent for President Clinton excoriates Crooked Hillary describing her as ERRATIC &amp; VIOLENT. Bad temperament for pres"},{"text":"I am getting bad marks from certain pundits because I have a small campaign staff. But small is good, flexible, save money and number one!"},{"text":"A massive blow to Obama's message - only 38,000 new jobs for month in just issued jobs report. That's REALLY bad!"},{"text":"Crooked Hillary is being badly criticized (for a Wall Street paid for ad) by PolitiFact for a false ad on me on women. She is a total fraud!"},{"text":"Crooked Hillary Clinton has not held a news conference in more than 7 months. Her record is so bad she is unable to answer tough questions!"},{"text":"Hillary Clinton is unfit to be president. She has bad judgement, poor leadership skills and a very bad and destructive track record. Change!"},{"text":"Bad performance by Crooked Hillary Clinton! Reading poorly from the telepromter! She doesn't even look presidential!"},{"text":"Bernie Sanders was right when he said that Crooked Hillary Clinton was not qualified to be president because she suffers from BAD judgement!"},{"text":"Crooked Hillary Clinton has zero natural talent - she should not be president. Her temperament is bad and her decision making ability-zilch!"},{"text":"So I raised/gave $5,600,000 for the veterans and the media makes me look bad! They do anything to belittle - totally biased."},{"text":"I have raised/given a tremendous amount of money to our great VETERANS, and have got nothing but bad publicity for doing so. Watch!"},{"text":"The Inspector General's report on Crooked Hillary Clinton is a disaster. Such bad judgement and temperament cannot be allowed in the W.H."},{"text":"Crooked Hillary Clinton overregulates, overtaxes and doesn't care about jobs. Most importantly, she suffers from plain old bad judgement!"},{"text":"Amazingly, with all of the money I have raised for the vets, I have got nothing but bad publicity from the dishonest and disgusting media."},{"text":"Hillary Clinton is not qualified to be president because her judgement has been proven to be so bad! Would be four more years of stupidity!"},{"text":"Failing @NYTimes will always take a good story about me and make it bad. Every article is unfair and biased. Very sad!"},{"text":"I said that Crooked Hillary Clinton is \"not qualified\" to be president because she has \"very bad judgement\" - Bernie said the same thing!"},{"text":"Bernie Sanders is being treated very badly by the Democrats - the system is rigged against him. Many of his disenfranchised fans are for me!"},{"text":"Michael Barbaro, the author of the now discredited @nytimes hit piece on me with women, has in past tweeted badly about me. He should resign"},{"text":"Crooked Hillary can't close the deal with Bernie Sanders. Will be another bad day for her!"},{"text":"Bernie Sanders is being treated very badly by the Dems. The system is rigged against him. He should run as an independent! Run Bernie, run."},{"text":"Wow, @CNN is really working hard to make me look as bad  as possible. Very unprofessional. Hurting in ratings - bad television!"},{"text":"Big wins in West Virginia and Nebraska. Get ready for November - Crooked Hillary, who is looking very bad against Crazy Bernie, will lose!"},{"text":"Hillary has bad judgment! https://t.co/LhcIU6kmxs"},{"text":"Crooked Hillary just can't close the deal with Bernie. It will be the same way with ISIS, and China on trade, and Mexico at the border. Bad!"},{"text":"Crooked Hillary has ZERO leadership ability. As Bernie Sanders says, she has bad judgement. Constantly playing the women's card - it is sad!"},{"text":"Wow, Lyin' Ted Cruz really went wacko today. Made all sorts of crazy charges. Can't function under pressure - not very presidential. Sad!"},{"text":"The economy is bad and getting worse-almost ZERO growth this quarter. Nobody can beat me on the economy (and jobs). MAKE AMERICA GREAT AGAIN"},{"text":"Lyin' Ted Cruz, who can never beat Hillary Clinton and has NO path to victory, has chosen a V.P.candidate who failed badly in her own effort"},{"text":"I am in Indiana where we just had a great rally. Fantastic people! Staying at a Holiday Inn Express - new and clean, not bad!"},{"text":"How bad is the New York Times—the most inaccurate coverage constantly. Always trying to belittle. Paper has lost its way!"},{"text":"Passing what was once a vibrant manufacturing area in Pennsylvania. So sad! #MakeAmericaGreatAgain https://t.co/RYWjgPh9Ja"},{"text":"Lyin' Ted and Kasich are mathematically dead and totally desperate. Their donors &amp; special interest groups are not happy with them. Sad!"},{"text":"I am happy to hear how badly the @nytimes is doing. It is a seriously failing paper with readership which is way down. Becoming irrelevant!"},{"text":"I win a state in votes and then get non-representative delegates because they are offered all sorts of goodies by Cruz campaign. Bad system!"},{"text":"\"@vivhall3: @realDonaldTrump here your delegate replaced at CO GOP convention. https://t.co/NxYhzdcMS0\" Very sad!"},{"text":"Wow, @Politico is in total disarray \nwith almost everybody quitting. Good\nnews -- bad, dishonest journalists! https://t.co/xTvGLDXY5O"},{"text":"Wisconsin has suffered a great loss of jobs and trade, but if I win, all of the bad things happening in the U.S. will be rapidly reversed!"},{"text":"Is it possible for @megynkelly to cover anyone but Donald Trump on her terrible show. She totally misrepresents my words and positions! BAD."},{"text":"The United States cannot continue to make such bad, one-sided trade deals. There are only so many jobs we can give up. No more!"},{"text":"Europe and the U.S. must immediately stop taking in people from Syria. This will be the destruction of civilization as we know it! So sad!"},{"text":".@TheView T.V. show, which is failing so badly that it will soon be taken off thr air, is constantly asking me to go on. I TELL THEM \"NO\""},{"text":"It is amazing how @LindseyGrahamSC gets on so many T.V. shows talking negatively about me when I beat him so badly (ZERO) in his pres run!"},{"text":"President Obama looks and sounds so ridiculous making his speech in Cuba, especially in the shadows of Brussels. He is being treated badly!"},{"text":"So the highly overrated anchor, @megynkelly, is allowed to constantly say bad things about me on her show, but I can't fight back? Wrong!"},{"text":"Why is it that the horrendous protesters, who scream, curse punch, shut down roads/doors during my RALLIES,  are never blamed by media? SAD!"},{"text":".@WSJ is bad at math. The good news is, nobody cares what they say in their editorials anymore, especially me!"},{"text":"Crazy @megynkelly is now complaining that  @oreillyfactor did not defend her against me - yet her bad show is a total hit piece on me.Tough!"},{"text":"Stuart Stevens, the failed campaign manager of Mitt Romney's historic loss, is now telling the Republican Party what to do with Trump. Sad!"},{"text":"Sadly, this kind of stuff even happened to Ronald Reagan. There is nothing nice about it! #MakeAmericaGreatAgain \nhttps://t.co/jC7cn1v18u"},{"text":"Gov Kasich voted for NAFTA, which devastated Ohio and is now pushing TPP hard- bad for American workers!"},{"text":"The failing @nytimes is truly one of the worst newspapers. They knowingly write lies and never even call to fact check. Really bad people!"},{"text":"Mitt Romney had his chance and blew it. Lindsey Graham ran for president, got ZERO, and quit! Why are they now spokesmen against me? Sad!"},{"text":"The Club for Growth is a very dishonest group. They represent conservative values terribly &amp; are bad for America. https://t.co/rnGoaprYuA"},{"text":"Because of me, the Republican Party has taken in millions of new voters, a record. If they are not careful, they will all leave. Sad!"},{"text":"Mitt Romney didn't show his tax return until SEPTEMBER 21, 2012, and then only after being humiliated by Harry R! A bad messenger for estab!"},{"text":"\"@fairess369: It is a sad commentary little boy Marco Rubio can't win in his home state. Floridians despise him as a opportunist phony.\""},{"text":"\"@conservativevin:  @ahernandez85a Romney should have been a tough guy with Obama. He cowered and lost. BADLY! He's not relevant!\""},{"text":"The polls show that I picked up many Jeb Bush supporters. That is how I got to 46%. When others drop out, I will pick up more.  Sad but true"},{"text":"In all of television- the only one who said anything bad about last nights landslide victory-- was dopey @KarlRove. He should be fired!"},{"text":"Make sure you get on the Trump line and are not mislead by the Cruz people. They are bad! BE CAREFUL."},{"text":"Ted Cruz does not have the right \"temperment\" to be President. Look at the way he totally panicked in firing his director of comm. BAD!"},{"text":"Ted Cruz only talks tough on immigration now because he did so badly in S.C. He is in favor of amnesty and weak on illegal immigration."},{"text":"Just watched the very incompetent Mitt Romney Campaign Strategist, Stuart Stevens. Now I know why Mitt lost so badly. Stevens is a clown!"},{"text":"Ted Cruz should be disqualified from his fraudulent win in Iowa. Weak RNC and Republican leadership probably won't let this happen! Sad."},{"text":"I wonder if President Obama would have attended the funeral of Justice Scalia if it were held in a Mosque? Very sad that he did not go!"},{"text":"New CBS National Poll just out - massive lead for Trump. The Wall Street Journal/NBC Poll is a total joke. No wonder WSJ is doing so badly!"},{"text":"\"@babo_sirin: BUSTED AGAIN: @TedCruz in Hot Water Over Possibly Illegal Fundraising #SCPrimary https://t.co/aaTtAbfOXx\" The guy is bad news"},{"text":"I am the only one who can fix this. Very sad. Will not happen under my watch! #MakeAmericaGreatAgain \nhttps://t.co/8MQ4imuTTi"},{"text":"Lightweight @JebBush is spending a fortune of special interest against me in SC. False advertising- desperate and sad!"},{"text":".@MarkHalperin showed a focus group on @Morning_Joe me using a very bad word. I never said the word, left an open blank. Please apologize!"},{"text":"Like the worthless @NYDailyNews, looks like @politico will be going out of business. Bad reporting- no money, no cred!"},{"text":"Now that Bush has wasted $120 million of special interest money on his failed campaign, he says he would end super PACs. Sad!"},{"text":"Ted Cruz didn't win Iowa, he stole it. That is why all of the polls were so wrong and why he got far more votes than anticipated. Bad!"},{"text":"The Cruz campaign issued a dishonest and deceptive get out the vote ad calling voters \"in violation.\" They are now under investigation. Bad!"},{"text":"The new e-mail release is a disaster for Hillary Clinton. At a minimum, how can someone with such bad judgement be our next president?"},{"text":".@bobvanderplaats begged me to do an event while asking organizers for $100,000 for himself—a bad guy!"},{"text":"\"@DittoPost: @realDonaldTrump @Crusade4Honesty @BornToBeGOP @megynkelly I believe in Trump!!!\""},{"text":"\"@Crusade4Honesty:  @BornToBeGOP @megynkelly  Megan can not contain her bias, it's in every show, Fox owners Saudi Prince agnstT\""},{"text":"Cruz lies are almost as bad as Jeb's. These politicians will do anything to stay at the trough!"},{"text":"The only reason irrelevant @GlennBeck doesn't like me is I refused to do his failing show - asked many times. Very few listeners - sad!"},{"text":"National Review is a failing publication that has lost it's way. It's circulation is way down w its influence being at an all time low. Sad!"},{"text":"New Day on CNN treats me very badly. @AlisynCamerota is a disaster. Not going to watch anymore."},{"text":"Sad sack @JebBush has just done another ad on me, with special interest money, saying I won't beat Hillary - I WILL. But he can't beat me."},{"text":"So sad that @CNN and many others refused to show the massive crowd at the arena yesterday in Oklahoma. Dishonest reporting!"},{"text":"Wacko @glennbeck is a sad answer to the @SarahPalinUSA endorsement that Cruz so desperately wanted. Glenn is a failing, crying, lost soul!"},{"text":"Sadly, there is no way that Ted Cruz can continue running in the Republican Primary unless he can erase doubt on eligibility. Dems will sue!"},{"text":".@MajorCBS Major Garrett of @CBSNews covers me very inaccurately. Total agenda, bad reporter!"},{"text":"The @TheView @ABC, once great when headed by @BarbaraJWalters, is now in total freefall. Whoopi Goldberg is terrible. Very sad!"},{"text":"Wow @UnionLeader circulation in NH has dropped from 75,000 to around 10—bad management. No wonder they begged me for ads."},{"text":".@JebBush is a sad case. A total embarrassment to both himself and his family, he just announced he will continue to spend on Trump hit ads!"},{"text":"Do you believe that The State Department, on NEW YEAR'S EVE, just released more of Hillary's e-mails. They just want it all to end. BAD!"},{"text":"I would feel sorry for @JebBush and how badly he is doing with his campaign other than for the fact he took millions of $'s of hit ads on me"},{"text":"Thank you Hilton Head, South Carolina! #MakeAmericaGreatAgain #Trump2016 https://t.co/TBAD5MeYCE"},{"text":"Remember that Bill Clinton was brought in to help Hillary against Obama in 2008. He was terrible, failed badly, and was called a racist!"},{"text":"Many of the great jobs that the people of our country want are long gone, shipped to other countries. We now are part time, sad! I WILL FIX!"},{"text":"The middle-class has worked so hard, are not getting the kind of jobs that they have long dreamed of - and no  effective raise in years. BAD"},{"text":"It begins, Republican Party of Virginia, controlled by the RNC, is working hard to disallow independent, unaffiliated and new voters. BAD!"},{"text":"Our great VETERANS are being treated very badly because of corruption and incompetence at the V.A. That will stop, I will fix this quickly!"},{"text":".@HallieJackson Why didn't you report Hillary lying about the ISIS video. Bad reporting. Perhaps @NBC will do better next year-but doubt it!"},{"text":"In the ridiculous @JebBush ad about me, Jeb is speaking to me during the debate, but doesn't allow my answer, which destroys him - SO SAD!"},{"text":"It is hard to believe I am winning by so much when I am treated so badly by the media.  New @CNN Poll amazing in ALL categories. 21 pt. Lead"},{"text":".@FoxNews treats me so badly. Using old Quinnipiac Poll where I have a much smaller lead than the just out @CNN Poll. All negative!"},{"text":"The @washingtonpost, which is the lobbyist (power) for not imposing taxes on #Amazon, today did a nasty cartoon attacking @tedcruz kids. Bad"},{"text":"It is a shame that the biased media is able to so incorrectly define a word for the public when they know that the definition is wrong. Sad!"},{"text":"When I said that Hillary Clinton got schlonged by Obama, it meant got beaten badly. The media knows this. Often used word in politics!"},{"text":"For those on TV defending my use of the word \"schlonged,\" bc #MSM is giving it false meaning-tell them it means beaten badly. Dishonest #MSM"},{"text":"Once again, #MSM is dishonest. \"Schlonged\" is not vulgar. When I said Hillary got \"schlonged\" that meant beaten badly."},{"text":"Very sad what happened last night at the Miss Universe Pageant. I sold it 6 months ago for a record price. This would never have happened!"},{"text":"Hillary Clinton spokesperson admitted that their was no ISIS video of me. Therefore, Hillary LIED at the debate last night. SAD!"},{"text":"We need a #POTUS with great strength &amp; stamina. Hillary does not have that.\n#Trump2016 https://t.co/n2C6bAdYNa https://t.co/cUy3VaDAGo"},{"text":"I won every debate so far according to all debate polls including @DRUDGE_REPORT, @TIME @Slate and more. Too bad dopey @megynkelly lies!"},{"text":"I wonder if @megynkelly and her flunkies have written their scripts yet about my debate performance tonight. No matter how well I do - bad!"},{"text":".@megynkelly is very bad at math. She was totally unable to figure out the difference between me and Cruz in the new Monmouth Poll 41to14."},{"text":"The United Kingdom is trying hard to disguise their massive  Muslim problem. Everybody is wise to what is happening, very sad! Be honest."},{"text":".@secupp, who can't believe that her candidate has bombed so badly, is one of the dumber pundits on T.V. Hard to watch, zero talent! @CNN"},{"text":"The failing @nytimes does not mention the new @CNN Poll that has me leading Iowa by a massive 13 points - I am at 33%. Maggie Haberman, sad!"},{"text":"\"@GeneMcGee6: @realDonaldTrump @seanhannity is so great towards you. Just doesn't like people on his show to bad mouth you. He is great .\""},{"text":"Heading to Manassas, Virginia, for a rally. Will have a moment of silence for the victims of the California shootings. So sad!"},{"text":"California shooting looks very bad. Good luck to law enforcement and God bless. This is when our police are so appreciated!"},{"text":"When will @CNN get some real political talent rather than political commentators like Errol Louis, who doesn't have a clue! Others bad also."},{"text":"Just watched Cookie Roberts on @ABC. Her predictions have been so wrong for so long that she has lost all credibility. Just another sad case"},{"text":"\"@JacoH: @CNN @realDonaldTrump I can't believe how low CNN can go. Obviously a bunch of Killary fans.\" @CNN only says negative-bad reporters"},{"text":"\"@nobaddog: @RepBJNikkel @CindyBlackwel12 JohnKasich  All you career Politicians are shaking in your shoes for fear Trump gets elected\""},{"text":"The numbers at the @nytimes  are so dismal, especially advertising revenue, that big help will be needed fast. A once great institution-SAD!"},{"text":"So, since the people at the @nytimes have made all bad decisions over the last decade, why do people care what they write. Incompetent!"},{"text":".ccolvinj @AP is one of the truly bad reporters---working for an organization that has totally lost its way. Stories are fictional garbage."},{"text":"It's too bad so few people showed up to @bobvanderplaats Family Leader dinner. Next year I'll try &amp; be there- and they'll have a huge crowd!"},{"text":"We're stuck with the worst mayor in the United States. Too bad, but New York City will survive!"},{"text":".@AP is doing very badly. I can say from experience their reporting is terrible &amp; highly inaccurate. Sadly, they are now irrelevant!"},{"text":"One of the saddest things in journalism is what happened to the formerly great @AP. They have lost their way and are no longer credible."},{"text":"\"@tasteofaz: Poll: Trump Surges to 42% Nationally; ‘Bad News for Marco Rubio’ https://t.co/9IrLrlpjfM @realdonaldtrump\"  Great news!"},{"text":"President Obama said \"ISIL continues to shrink\" in an interview just hours before the horrible attack in Paris. He is just so bad! CHANGE."},{"text":".@seanhannity  Carly, whose campaign is dead, is making false statements about me in order to salvage hope! Sad."},{"text":"I never said that China was in the bad TPP trade deal but that China would come in the back door at a later date. @CNN @FoxBusiness"},{"text":"Marco Rubio is totally weak on illegal immigration &amp; in favor of easy amnesty. A lightweight choker - bad for #USA!"},{"text":"@BillKristol has become a sad case. His magazine is failing badly, probably doesn't have long to go, and his predictions are always wrong!"},{"text":"So sad that Obama rejected Keystone Pipeline. Thousands of jobs, good for the environment, no downside!"},{"text":"Such bad reporting: A puff piece on Ben Carson in the @nytimes states that Carson \"is trying to solidify his lead.\" But I am #1, easily! Sad"},{"text":"If Jeb Bush were more competent he could not have lost the skirmish with Marco in the debate. BAD facts for Marco if properly delivered!"},{"text":"The @WSJ Wall Street Journal loves to write badly about me. They better be careful or I will unleash big time on them. Look forward to it!"},{"text":"Wow, just heard really bad stuff about the failing  @politico. How much longer  will they be around? Some very untalented reporters."},{"text":"Does anybody think that @CNBC will get their fictitious  polling numbers corrected sometime prior to the start of the debate. Sad!"},{"text":"\"@hoosierclinger: Good job @realDonaldTrump for badgering Ford. Why didnt POTUS or Hillary care about those UAW jobs in Ohio?\""},{"text":"Word is that Ford Motor, because of my constant badgering at packed events, is going to cancel their deal to go to Mexico and stay in U.S."},{"text":"\"@Thuglife602: @realDonaldTrump Bad position for Jeb, if his Mommy, Daddy and brother get involved the skeletons come back out of the closet"},{"text":"I think Joe Biden made correct decision for him &amp; his family. Personally, I would rather run against Hillary because her record is so bad."},{"text":"I should release the sad and totally apologetic letter that Penn @pennjillette hand delivered to me. Minds would be changed very fast!"},{"text":"Jeb, why did your brother attack and destabalize the Middle East by attacking Iraq when there were no weapons of mass destruction? Bad info?"},{"text":"\"@JohnNew2015:  @lance_combrink Well, @KarlRove is an establishment hack big government RINO whose only hope is @JebBush - That's sad, eh!?\""},{"text":"\"@SHLOMO_ABADDON: @TODAYshow @MLauer @realDonaldTrump Matt will vote for Trump i just know he will !\""},{"text":"Every poll, Time, Drudge, Slate and others, said I won both debates - but heard Megyn Kelly had her two puppets say bad stuff. I don't watch"},{"text":".@marcthiessen is a failed Bush speechwriter whose work was so bad that he has never been able to make a comeback. A third rate talent!"},{"text":"\"@Angie58493041: @sadmexi @realDonaldTrump sucess of Mr Trump is another success of america 2015\""},{"text":"\"@magnifier661: @realDonaldTrump they make Jeb Bush look like the energizer bunny #DemDebate #USADJT2016\""},{"text":"\"@keksec_org: The only winner of the #DemDebate is @realDonaldTrump.\"  This is not a great debate - a little sad!"},{"text":"The hardest thing Clinton has to do is defend her bad decision making including Iraq vote, e-mails etc."},{"text":"\"@rjdicksii: @realDonaldTrump. These cats are like bad used car salesmen.\""},{"text":"\"@wayway71: @realDonaldTrump Webb is OUT!!\"  Bad opening!  #DemDebate"},{"text":"We will all have fun and hopefully learn something tonight. I will shoot straight and call it as I see it, both the good and the bad. Enjoy!"},{"text":"\"@StreckerJosh: The Hillary love fest on CNN is ridiculous. I feel bad for the other candidates...especially the non-criminal ones.\""},{"text":"Should be interesting but too bad the three guys at《1% will be taking up so much time -  but who knows, maybe a star will be born (unlikely)"},{"text":"\"@Politics_Reddit: That feminist who called out Trump last night? She's a Jeb intern. http://t.co/aRroatryt6\"  Jeb always gets caught, sad!"},{"text":"Little Barry Diller, who lost a fortune on Newsweek and Daily Beast, only writes badly about me. He is a sad and pathetic figure. Lives lie!"},{"text":"Wacky @glennbeck who always seems to be crying (worse than Boehner) speaks badly of me only because I refuse to do his show--a real nut job!"},{"text":"If Stuart Stevens' book is as bad as his horrible political advice to Mitt Romney, don't waste your money. Arrogant guy but a zero!"},{"text":"\"@4udirtyrat: @realDonaldTrump 9 million MORE out of work because of this BAD DEAL.Will have over 100 MILLION out of work. Nice going Obama\""},{"text":"\"@AndreaTantaros: DonaldTrump is right. And sadly Christians were treated better under Hussein &amp; Gaddafi than ISIS. https://t.co/AZdLqydRM1"},{"text":"\"@polemicism: Okay okay @realDonaldTrump was right: LaGuardia Airport is a total dump. Like really, really bad.\""},{"text":"I will be interviewed on @seanhannity tonight at 10:00. Many things, mostly bad, to talk about!"},{"text":"\"@EthaBrooke: @cs1racefan @realDonaldTrump @MittRomney The truth about Romney...he didn't want the presidency bad enough!\"  He choked!"},{"text":"\"@barreto_eugenio:  @MittRomney it's sad, but GOP does not want you as their candidate. But we the people do. Latinos for Trump.\""},{"text":"\"@kissmeandrocco: @realDonaldTrump who ever thinks Donald trump is a bad person u just don't want a good country\" Thank you."},{"text":"I am attracting the biggest crowds, by far, and the best poll numbers, also by far.   Much of the media is totally dishonest. So sad!"},{"text":"Am I morally obligated to defend the president every time somebody says something bad or controversial about him? I don't think so!"},{"text":"Would be really bad if columnist Mike Lupica left the @NYDailyNews.  A wonderful and talented guy!"},{"text":"See you in D.C. tomorrow at 1:00 P.M. at the Capitol to protest the horribly negotiated deal with Iran. Really sad!"},{"text":"\"@LettyNTX: Obama left our American hostages in Iran. #Trump2016 @realDonaldTrump\" Sadly, so true!"},{"text":"Jeb is spending millions of dollars on “hit” ads funded by lobbyists &amp; special interests. Bad system."},{"text":"Just out - new PPP NATIONAL POLL has me in first place by a wide margin at 29%. I wonder why only @FoxNews has not reported this? Too bad!"},{"text":"Great American heroes who averted an attack in France. THANK YOU! Spencer Stone, Anthony Sadler, &amp; Alex Skarlatos. http://t.co/5P0tX9Mq8u"},{"text":"Jeb Bush never uses his last name on advertising, signage, materials etc. Is he ashamed of the name BUSH? A pretty sad situation. Go Jeb!"},{"text":"Jeb Bush is weak on illegal immigration, in favor of common core, bad on women's health issues and thinks the Iraq war was a good thing."},{"text":"How is Bernie Sanders going to defend our country if he can't even defend his own microphone? Very sad!"},{"text":"The polls have been really amazing--we are all tired of incompetent politicians and bad deals! http://t.co/wZiNNsvZx2"},{"text":".@FoxNews you should be ashamed of yourself. I got you the highest debate ratings in your history &amp; you say nothing but bad..."},{"text":"\"@BADfundraisers: @realDonaldTrump All Donald Trump knows how to do is win! Go Trump 2016!\" I do love winning!"},{"text":"When people find out how bad a job Scott Walker has done in WI, they won’t be voting for him. Massive deficit, bad jobs forecast, a mess."},{"text":"\"@g_pluth: @RedNationRising Hats off to @realDonaldTrump for sticking it to liberal msm. @DMRegister\" A horrible newspaper, failing badly."},{"text":"\"@AlbertoZambrano: @HeinzFGuderian   Well get your facts straight. McCain was so bad he gave us Obama. He gave arms to Islamic terrorists\""},{"text":"One of the reasons I am no fan of John McCain is that our Vets are being treated so badly by him and the politicians. I will fix VA quickly."},{"text":"It's driving @ariannahuff &amp; the money losing @HuffingtonPost post crazy that I am #1 in their poll and they only write bad stories about me!"},{"text":"No deal is better than a bad deal. America out negotiated again.  #Iran"},{"text":"I hope the boycott of @Macys continues forever. So many people are cutting up their cards. Macy's stores suck and they are bad for U.S.A."},{"text":"Has anyone seen the financials of @Univision. They are doing really badly. Too much debt and not enough viewers. Need money fast. Funny!"},{"text":"Iran continues to delay the nuclear deal while doing many bad things behind our backs. Time to WALK and double the sanctions. Stop payments!"},{"text":"Via @businessinsider by @hunterw: “TRUMP UNLOADS: Hillary Clinton was 'the worst' and is 'extremely bad'” http://t.co/lPGSlczakP"},{"text":"My heartfelt condolences to the family of Kathryn Steinle. Very, very sad!"},{"text":"\"@JUSTTHETRUTHTV: @WFinchner @realDonaldTrump @Macys So? How does that change that very bad people are coming over the boarder?\""},{"text":"\"@babyylissa: Obama calls immigrants gang bangers&amp;criminals but Trump gets attacked for calling SOME illegals from SOME countries bad people"},{"text":"\"@MARGIE352: @Highlander6700 @Macys They were taken out of context. Trying to make him look bad to the American Hispanic community.\""},{"text":"\"@JulUSN: @realDonaldTrump  They look bad. @Macys screwed up BigTime!They are so hypocritical,YOUR Right &amp; they know it!\""},{"text":"\"@MARGIE352: Listen to what he says. You will know in your heart it is the truth. We are in a bad way. he is the only one who gets it.\""},{"text":"I love Mexico but not the unfair trade deals that the US so stupidly makes with them. Really bad for US jobs, only good for Mexico."},{"text":"I hear that dopey political pundit, Lawrence O'Donnell, one of the dumber people on television, is about to lose his show-no ratings?Too bad"},{"text":"Sadly, I will no longer be doing @foxandfriends at 7:00 A.M. on Mondays. This is because I am running for president and law prohibits. LOVE!"},{"text":"Just watched Brian Williams on @TODAYshow - very sad! Brian should get on with a new life and not start all over at @msnbc. Stop apologizing"},{"text":"Should not pass--bad deal! https://t.co/AR4Ugjru9t"},{"text":"“Our runaway judiciary is badly in need of restraint by Congress.” - Phyllis Schlafly"},{"text":"The Trans-Pacific Partnership will increase our trade deficits &amp; send even more jobs overseas. This is a bad deal. Time for smart trade!"},{"text":"Too bad I don't get this for political speeches- they cost me a fortune! https://t.co/dR4gV4vUHe"},{"text":"While Jon Stewart is a joke, not very bright and totally overrated, some losers and haters will miss him &amp; his dumb clown humor. Too bad!"},{"text":"For those of you that have conveniently forgotten, dummy Jon Stewart is a bad filmmaker. His last effort was a real bomb (in all ways)!"},{"text":"For those of you that have conveniently fotgotten, dummy Jon Stewart is a bad filmmaker. His last effort was a real bomb (in all ways)!"},{"text":"While Jon Stewart is a joke, not very bright and totally overrated, some losers and haters will miss him and his dumb clown humor. Too bad!"},{"text":"Wow, the economy is really bad! GROSS DOMESTIC PRODUCT down 0.7% in 1st. quarter - and getting worse. I TOLD YOU SO! Only I can fix."},{"text":"\"@meltsch: @FoxNewsInsider @realDonaldTrump @greta I agree with this man in every way , too bad more americans don't wake up .\""},{"text":"\"@meltsch: @FoxNewsInsider @realDonaldTrump @greta I agree with this man in every way , too bad more americans don't wake up .\""},{"text":"I would like to wish everyone, including all haters and losers (of which, sadly, there are many) a truly happy and enjoyable Memorial Day!"},{"text":"I told @megynkelly that @oreillyfactor and I had identical views on a certain issue and she cut it out of the taped interview. Why? Too bad!"},{"text":"\"@obadafidii: Trump: 'I Want to Make the Country Great Again' http://t.co/YMP2DPOUAK #SmartNews\""},{"text":"\"@Pri. Had a dream that @realDonaldTrump was POTUS and @WarrenBuffett was VP. Our country was finally debt free. Too bad it was only a dream"},{"text":"\"@IslesFan83: @realDonaldTrump I hope you run. America needs it badly.\""},{"text":"I cannot believe how bad Jeb Bush looks with his insane answer on Iraq, and then his numerous corrections which made him look even worse."},{"text":"Amtrak crash near Philadelphia, train derails -many hurt, some badly. Our country has horrible infrastructure problems. Pols can't solve!"},{"text":"Glad the Trans-Pacific Partnership failed in the Senate. Bad deal for American worker &amp; economy! We need SMART TRADE! http://t.co/YPz4io6WJJ"},{"text":"What a STUPID deal for Verizon to buy AOL for $4.4 billion. AOL has been bad luck for everyone who touched it. Worth less than $1 billion!"},{"text":"Via @DailyCaller by @AlexPappas: “Donald Trump To Blast Obama Trade Pact In Radio Ads: ‘A Bad, Bad Deal’” http://t.co/K5dG5hCBuO."},{"text":"\"@meltsch: @realDonaldTrump @peenerad What a sad lineup the republicans have, most we never heard of . They have nothing to inspire us.\""},{"text":"Congress was elected last November to reign Obama in, not to give him ‘fast track’ authority for bad trade deals for the American worker!"},{"text":"\"@RULivingLife: I Agree.!! @realDonaldTrump Anyone who thinks my story is anywhere near over is sadly mistaken- Donald Trump #quote"},{"text":"I have been a guest on The View many times when it was  successful show. Now the show is dying for lack of ratings. Too bad!"},{"text":"Blatant and rampant property destruction in Baltimore as the police stand by and watch. Should be a lesson on how NOT to handle riots. SAD!"},{"text":"Wow, 15 policemen hurt in Baltimore, some badly! Where is the National Guard. Police must get tough, and fast! Thugs must be stopped."},{"text":"The Trans-Pacific Partnership is an attack on America's business. It does not  stop Japan's currency manipulation. This is a bad deal."},{"text":".@JonahNRO  You should be totally focused on trying to save the badly failing National Review instead of focusing on me. Work hard!  @NRO"},{"text":"National Review @NRO may  be going out of business because of the really pathetic job being done by @JonahNRO. No talent means death - sad!"},{"text":"\"@ccrealty2: Friendship can be really tested only in bad times ~ Donald Trump #quotes #realestate #homes #blog #buyingtips\""},{"text":"\"@AnjiRabadi: @TrumpChicago I'll be staying here next weekend! Can't wait! @realDonaldTrump @deejaynik @sophiegonerogue #trumplife #cantwait"},{"text":"How do third rate talents with no smarts like @ron_fournier get so much time on television news. Boring guy - really bad for ratings!"},{"text":"\"@Lex_Shep: @realDonaldTrump @TMobile @JohnLegere. Why are you even using T mobile? I don't use T-Mobile, bad service!"},{"text":"Oil is under $50/barrel. Now is the time to increase sanctions against Iran, not lift them. No deal is better than a bad deal. #ArtOfTheDeal"},{"text":"\"@MichelleM: Praying for only more success for DJT. An honorable man who knows The Art of The Deal &amp; who would not make a bad deal w/ #Iran\""},{"text":"Obama’s offer to Iran will not stop Iran’s breakout capability. It is a bad, desperate deal negotiated from weakness. Pass sanctions!"},{"text":"\"@RichRichie725: @realDonaldTrump You can't make a BAD Deal GOOD\""},{"text":"\"@KellyMorrisLtd  @AyrshireChamber Sad to be missing it. Huge buzz about the key note speaker this year!!! America's future president\""},{"text":"Just as I have been saying for MANY years, and while they phony negotiate with the U.S. over nuclear, Iran is taking over Iraq. Really sad!"},{"text":"\"@sandykjack: @realDonaldTrump -You are what America needs right now- We need a bad-ass President that we can trust and knows how to lead\""},{"text":"Via @WashTimes by @SethMcLaughlin1: “Donald Trump: I want to run for president ‘so badly’” http://t.co/JnGqrDNbSY"},{"text":"I told you the Oscars were terrible—bad look, bad talent—and among the lowest ratings in show’s history.  http://t.co/AOc5aQdVvk …"},{"text":"The Oscars are a sad joke, very much like our President. So many things are wrong!"},{"text":"What ever happened to the good old days of The Academy Awards. This show is an insult to the past, just plain bad!"},{"text":"President Obama and our negotiators are failed checker players playing against Grand Master Chess champions. Very sad to watch!"},{"text":"\"@PrabhuSadasivam: Inspiring! Determination &amp; perseverance will pay off @WorldNewsPress1 The Success of Donald Trump http://t.co/kvPnUKP7QZ\""},{"text":"Word is that Sleepy Eyes Chuck Todd, who has failed so badly with Meet the Press, will be taking over for now irrelevant Brian Williams!"},{"text":"Everyone is saying the bad news is that Donald Trump is going to take credit &amp; they are right—Mitt wouldn’t have won anyway."},{"text":".@oreillyfactor - bad and very deceptive journalism. Show must be heading in wrong direction, too bad!  @SarahPalinUSA"},{"text":"\"@Dadeque: @realDonaldTrump The grey sofa don't match, Sir... but It is just my taste.\" I agree, but @IvankaTrump likes it - too bad."},{"text":"Wow, I have always liked the @nypost but they have really lied when they covered me in Iowa. Packed house, standing O, best speech! Sad."},{"text":"As usual, the \"storm of the century\" was not nearly as bad as forecast. What a waste of time, energy and money!"},{"text":"With oil below $50, the blighted views by windfarms of historic @CulzeanCastle will be very sad. #SaveCulzean http://t.co/wQSIPBlv3o"},{"text":"\"@gcolangelo68: @realDonaldTrump its unbelievable lately poor Atlantic City\" True, very sad, but I left years ago."},{"text":"\"@mikeyjacques: @realDonaldTrump is a BAD A$$, I could only be so lucky to have an amazing mentor like that in my life.\""},{"text":"\"@saraaa_nicole95: @realDonaldTrump is so intimidating! I would never wanna be on his bad side!! He's still basically a king tho\""},{"text":"\"@ApprenticeNBC: \"Nobody wants to be the first one fired.\" Isn't that the truth, @realDonaldTrump. #CelebApprentice\" VERY SAD TO BE FIRST."},{"text":"\"@JillyBaDilly: @realDonaldTrump I've been waiting for this day for way too long! #CelebApprentice starts tonight! Can't wait! 🎉\" Enjoy!"},{"text":"Dummy Bill Maher did an advertisement for the failing New York Times where the picture of him is very sad-he looks pathetic, bloated &amp; gone!"},{"text":"\"@HarveyPelovsky: @realDonaldTrump. We need you badly to run for President. You are a Patriot and we desperately need one. Run!!!!!!!!!!\""},{"text":"#TrumpVlog #TheInterviewMovie A sad day for freedom of speech- http://t.co/eQDh4BkDHp"},{"text":"No wonder Sony is doing so badly. Really stupid leadership that wants Al Sharpton to help. Watch him turn the tables on chief Amy Pascal."},{"text":"\"@YoChambers: @realDonaldTrump @toptv005 @VikkiTB we've had 16 years of bad presidents..war terrorism, bad economy etc...\""},{"text":"Very sad &amp; dangerous that soon to be ex-Intelligence Chair Dianne Feinstein released the CIA report. Glad she is losing her Comm. Chair."},{"text":"\"@kyleraccio: @realDonaldTrump The View was terrible today. I feel sad for ABC!\"  Rosie killed what was once a very good show - no ratings!"},{"text":"\"@JoseThePaisa: @realDonaldTrump Mr. Trump do you know how sad it's to have a POTUS that ignored remembrance of Pearl Harbor?So un patriotic"},{"text":"\"@vidopisugam: RT @realDonaldTrump The weak jokers who so badly hurt great Penn State University should have fought the NCAA\""},{"text":"So sad that Burt Reynolds has lost all of his money. I wish he came to me for advice--he would be rich as hell!"},{"text":".@WhoopiGoldberg Don’t let @Rosie speak badly of you or try to bring you down. She is rude, crude &amp; not smart. She is not in your league."},{"text":"Bill Cosby is foolish, stupid, or getting bad advice in remaining silent if he is innocent. Probably guilty! Not a fan."},{"text":"\"@JoshHasADog: Me with Don and Sarah. We went out for pizza that night. Remember .@realDonaldTrump http://t.co/8wEZ1OSe16\""},{"text":"\"@JoshHasADog: @realDonaldTrump @ronmeier123 @JebBurtonRacing @jerrysan52 Donald \"Real Deal\" Trump. I've been calling him that for years!!!!"},{"text":"Sadly, because president Obama has done such a poor job as president, you won't see another black president for generations!"},{"text":"Iran and the United States just pushed deadline back SEVEN MONTHS on working out a nuclear deal. Iran is tapping along our bad negotiators!"},{"text":"I will be on @foxandfriends at 7:00 - there is much to talk about (sadly)!  Enjoy!"},{"text":"\"@TracyLynnClark1:  @YllSadiku Mister Trump please run for president this country needs you badly and I would vote for you in a heart beat.\""},{"text":"\"@YllSadiku: @realDonaldTrump Such a nice Guy. Such a perfect Leader . I want to see you in the White House !! Mr.Pesident D.Trump. Thanks"},{"text":"\"@russiannavyblog:  @dr_rita39 I follow Mr. Trump in a crusade to get him to restore Western Civilization with a Trump/Palin '16 ticket!\""},{"text":".@BlairKamin Sorry sucker, as usual you lose again. You couldn't work for me for 10 seconds. Bad critic-- great sign. http://t.co/3uSYL9qR3U"},{"text":"Obama’s China ‘climate’ deal binds America with language of ‘will’ curb emissions now while China only ‘intends’ to curb in 2030. Bad deal!"},{"text":"\"@frankboesch: Sad cause my wife &amp; I checked out of @TrumpDoral today after 4 amazing days. Happy cause we're planning our return visit!\""},{"text":"The ObamaCare website still is not complete. $5 billion and no progress. Scary and sad!"},{"text":"\"@danywasking: @realDonaldTrump your on fire this morning.. too bad your not the prez.. ;)\" I agree!"},{"text":"The weak jokers who so badly hurt great Penn State University should have fought the NCAA instead of making a deal- http://t.co/b9E5eC9pam"},{"text":"A really bad night for President Obama. Now the Republicans have to get together and get the job done!"},{"text":"The five prisoners our government so stupidly released for one pathetic traitor are now fighting and killing for ISIS-BAD DEAL! Courtmarshal"},{"text":"Crazy - Election officials saying that there is nothing stopping illegal immigrants from voting. This is very bad (unfair) for Republicans!"},{"text":"\"@JeffreyGuterman: Years ago T said if US removed Saddam Hussein from Iraq, somebody worse would replace him. He was right about that: #ISIS"},{"text":"“Trump on Obama: ‘I never thought it would be this bad’”\n  http://t.co/7LcuB3L7RA  via @breitbarttv"},{"text":"\"@TheRealPWeight: You did say that when we leave bad guys will take the oil in Iraq.. ISIS controls a lot of it today. Good foresight.\""},{"text":"\"@bahia6085: @realDonaldTrump Both Bush's were bad presidents. Why then---would Jeb Bush somehow be a great president?\" He wouldn't!"},{"text":"All the governors are already backing off of the Ebola quarantines. Bad decision that will lead to more mayhem."},{"text":"\"@moose_taz: @realDonaldTrump @foxandfriends Income down and cost of living up for legal citizens of America yep this is Obama America sad\""},{"text":"The U.S. accidentally air dropped a large shipment of military weapons and supplies right into the middle of ISIS as enemy laughs! Very sad!"},{"text":"\"@Amber_Sadler22: Donald Trump and Mitt Romney would be the most dynamic pres/vp combo in history\" No, bad chemistry - I like winning!"},{"text":"I was never a fan of Bush, in fact, he was so bad he gave us Obama! But Obama is truly a pathetic excuse of a president, can't get any worse"},{"text":"\"@EeekToys: @realDonaldTrump @katyperry   Donald is onto something here. Russ does look like a really bad lost dummy joke with a fried mind\""},{"text":"I love seeing that Graydon Carter and @VanityFair are failing so badly. He’s only focused on his bad food restaurants."},{"text":".@katyperry  I watched Russell Brand and I think his mind is fried - he looks really bad. Russell is a total joke, a dummy who is lost!"},{"text":"My @SteveDeaceShow interview discussing Ebola, Obama’s incompetence &amp; my trip to Iowa for  @SteveKingIA on Sat.  http://t.co/PWRusADvr3"},{"text":"The military generals are fuming at Obama. He has boxed them in against ISIS with a strategy that is destined to fail. Sad!"},{"text":"Remember when I said when Saddam Hussein fell - the new leader of Iraq will be meaner and tougher and hate the U.S. even more. Welcome ISIS!"},{"text":"\"@MichaelSad6: @tonymission @Saran_arsh @realDonaldTrump I think Trump vs Clinton would be huge\""},{"text":"\"@MichaelSad6: @realDonaldTrump its time to put a Wharton Grad in the White House! #Trump2016\" That is true!"},{"text":"#TrumpVlog Why are we the sad suckers? http://t.co/uNI7SQsQYR"},{"text":"China is ripping wealth out Africa and yet, as usual, refuses to put anything back to help with Ebola. \"Let the stupid Americans do it!\" SAD"},{"text":"\"@not_that_actor PREDICTION: Things will be so bad in post-Obama US that Trump will be swept into White House in '16 http://t.co/TdMlFuOFjI\""},{"text":"I thought I was being nice to somebody re their parents. I guess this teaches you not to be nice or trusting. Sad!"},{"text":"Can you believe we still have not gotten our Marine out of Mexico. He sits in prison while our PRESIDENT plays golf and makes bad decisions!"},{"text":"Zegarelli and Vescio:  Pine Road looks like hell. Must be re-paved now—very bad for town.  @BriarcliffManor"},{"text":"\"@breemomma33: @realDonaldTrump Always enjoy listening to you on @foxandfriends Too bad this Administration doesn't take your advice!\""},{"text":"\"@Valbano206: Loved listening to @realDonaldTrump this morning on @MikeAndMike fantastic and true view points on the sad state of the NFL\""},{"text":"\"@NewMexicoRoni @realDonaldTrump sadly, they of course will blame you for the failure. Idiots.\"  And I haven't been there in years."},{"text":"It is so sad to see what has happened to Atlantic City. So many bad decisions by the pols over the years - airport, convention center, etc."},{"text":"I left Atlantic City years ago, good timing. Now I may buy back in, at much lower price,  to save Plaza &amp; Taj. They were run badly by funds!"},{"text":"Why are we giving away our entire strategy and tactics we will deploy against ISIS? It puts our troops at a disadvantage."},{"text":"Remember, anything you read about Atlantic City has nothing to do with me. I sold years ago and left. Good timing but very sad!"},{"text":"\"@OnlineOnTheAir: My friend's son, immediate #autism after #vaccines 10 yrs ago. So sad. Keep up good work Nay-sayers will understand soon.\""},{"text":"\"@LindseyScheibe @realDonaldTrump Erik's story breaks my heart. Vaccines destroyed his family.  http://t.co/21yL30fDPk\" Very sad!"},{"text":"\"@Carmelcandi68: The ISIS thug who murdered Amer James Foley may hv been Gitmo detainee http://t.co/evsED2fAX5 yall want close gitmo so bad\""},{"text":"What is happening in Atlantic City, casino closures, is very sad - but does anybody give me credit for getting out before its demise? Timing"},{"text":"\"@josegonzalez_69: @realDonaldTrump Bush never should've sent our troops there to begin with!\"I have said that for many years, bad judgement"},{"text":"Iraq is more dangerous today than any time under Saddam. War was a mistake, as I said from the very beginning. Bush &amp; Obama should apologize"},{"text":"Briarcliff  Manor should get a better town manager. Philip Zegarelli has no clue—bad roads, a total puppet of the mayor?  @westchestergov"},{"text":"\"@AgentSanderson: @realDonaldTrump I hate myself for following you...\" But you just have no control over yourself, you need Trump so badly!"},{"text":"\"@KrisinAL: @realDonaldTrump @FrankLuntz Explain? He's a pollster?\"  Yes, but a really bad (and boring) one!"},{"text":"Obama spoke to the Mexican president last week &amp; did not mention UMC Sgt. Tahmooressi. Sad!"},{"text":"@LateNightSeth  I am not surprised that Seth is absolutely dying in the ratings! He is truly an awkward, mumbling jerk. Too bad!"},{"text":"Wow, Obama really put it to Israel by canceling flights there. This puts them at a tremendous disadvantage. Tourism and more will just stop."},{"text":".@jimmykimmel is terrific but for Obama to fly on Air Force One ($’s) to do the show in these bad times is ridiculous."},{"text":"I will be on Fox &amp; Friends at 7.00 (20 minutes). Plenty of terrible and tragic news to talk about! Too bad."},{"text":"\"@WorldReachTech: @realDonaldTrump @greta The saddest moment in American history was the fact Obama was elected POTUS on broken promises\""},{"text":"Can you imagine trading five really bad enemies of the U.S. for the freedom of traitor Bergdahl. Just another bad deal!"},{"text":"Do these very stupid politicians who got us involved in Iraq look bad, or what? Everybody wants their oil - only made possible by U.S.!"},{"text":"\"@THENobodySpcl: @realDonaldTrump but can you get him to stop sucking at his job?\"  That would be, sadly, impossible."},{"text":"Secy John Kerry has a tough job but he looks so totally lost negotiating w/ those characters who are cleaning his clock. Sad to watch..."},{"text":"Eli Wallach was a great actor and a great guy. My opinion-- his performance in The Good the Bad and the Ugly was his all time best!"},{"text":"\"@D The government spends millions to keep bad people to come in via air travel. Now they go through Mexico. Wish DonaldTrump was in charge\""},{"text":"\"@jperk1: @realDonaldTrump Goldberger was a loser\"  True, really bad taste - but he's gone now!"},{"text":"\"@_MHall:  Flew through LGA on Friday and got a good look at your amazing plane. To bad LGA is such a dump. Not a great welcome to NYC\""},{"text":"\"@AlexDub182821: @realDonaldTrump Couldn't agree more about Seth Meyers\" He wss not meant for television - very sad!"},{"text":"\"@BackOnTrackUSA:  Remember the terrorists that Obama has been arming in Syria against Assad. Well now they are marching on Bagdad.\""},{"text":"The only reason I am critical of the Pinehurst look is because I’m a lover of golf—and that look on TV hurts golf badly."},{"text":"\"@benSEXT0N: @Cfeetsrevenge @LukeDonald @realDonaldTrump course didn't look good in HD just saying\"  No, it looked terrible, bad for golf!"},{"text":"\"@CharlieMaikis: @realDonaldTrump I completely agree with DT here. Pinehurst looks bad. I wouldn't pay $400 to play if it looked like that.\""},{"text":"@MattGinellaGCSadly Matt, you don't understand golf (even though you think you do).I have numerous couses that are far superior to Pinehurst"},{"text":"@MattGinellaGC  My position on Pinehurst is correct - bad for the game, a dried out cow pasture. You have no clue but keep trying!"},{"text":"\"@foossh:@GolfDigestMag @realDonaldTrump he has a point, fairways should be green. Scruff can be as bad as you want. Wouldn't pay top dollar"},{"text":"\"@jshamie:  @GolfDigestMag couldn't agree more. The course is not punishing bad tee shots like a normal us open would. BORING FINISH!!!\""},{"text":"\"@jsimonwc: @MattGinellaGC @realDonaldTrump Built for golf. Not built for TV.\" That is true because it looks horrible on T.V.  SAD!"},{"text":"\"@Koonskin: .@realDonaldTrump would make an amazing president. Best ever! Sadly, I don't think he has the guts to run. A shame.\" We'll see!"},{"text":"Iraq is far worse and of more danger to the U.S. now than it ever was under Saddam Hussein - and this after $2 trillion and so many lives!"},{"text":"\"@david_j_roth: \"I was never one who looked at success as bad. For me, success was always good. I loved it, and still do.\"  Donald Trump"},{"text":"Obama is, without question, the WORST EVER president. I predict he will now do something really bad and totally stupid to show manhood!"},{"text":"Obama’s war on coal is killing American jobs, making us more energy dependent on our enemies &amp; creating a great business disadvantage."},{"text":"The U.S. cannot negotiate with terrorists. It is a sad and terrible situation for the family involved, but this can only lead to disaster."},{"text":"President Obama created a VERY BAD precedent by handing over five Taliban prisoners in exchange for Sgt. Bowe Bergdahl. Another U.S. loss!"},{"text":"\"@TTH7: Just talked to nice woman at jacknthebox- she's being cut to 30 hrs due to #Obamacare- been there 5 yrs-3 kids to feed\" Very sad!"},{"text":"Getting ready for the big news conference in Dubai. It should all be happening in the U.S., but it isn't - SAD!"},{"text":"Do your homework. Wasting other people’s time due to poor planning or thoughtlessness leaves a bad impression. – Think Like a Billionaire"},{"text":"Congrats to Barack Obama on April’s job report. Over 800,000 left the work force w/average hourly wages &amp; weekly hours staying flat. Bad!"},{"text":"Floyd Mayweather is being beaten up badly through 10 rounds by Marcos Maidana, but announcers say it is even. TWO ROUNDS LEFT."},{"text":"Seth Myers is so unnatural and uncomfortable doing his show that you have to feel sorry for him. Bad interviewer, marbles in his mouth!"},{"text":"With @VanityFair circulation and advertising revenue doing so badly, rumor has it that dopey Graydon Carter is going to resign? He should."},{"text":"Wow, Vanity Fair was totally shut out at the National Magazine Awards - it got NOTHING. Graydon Carter is a loser with bad food restaurants!"},{"text":"No surprise Assad is not destroying his chemical weapons. He never intended to in the first place."},{"text":"After thousands lost and spending two trillion dollars, Iraq (I told you so) is imploding. Really dumb pols put us and kept us there-so sad!"},{"text":"Look, Snowden is bad, done tremendous damage to our country and standing - but we have far worse in our government (guess who?)."},{"text":"\"@wadar1969: @realDonaldTrump Do u think our Government still has the gold they say they have in Colorado, Ft Knox etc. I doubt it, sadly!"},{"text":"America is at a great disadvantage. Putin is ex-KGB, Obama is a community organizer. Unfair."},{"text":"\"@MarkSciubbaDoe @realDonaldTrump PLEASE SAVE THE BILLS FROM @BonJovi AND CANADA #BillsMafia\"  I will try!"},{"text":"\"@Tingmanusa: \"@realDonaldTrump: \"@EldyCorrea: @realDonaldTrump Yes, go ahead and run for President. We need you so badly!\"\" Yes we do!"},{"text":"\"@EldyCorrea: @realDonaldTrump Yes, go ahead and run for President. We need you so badly!\""},{"text":"\"@lewisbetesh: @realDonaldTrump @CMHollon  Mr. Trump, look into buying the mets from the wilpons. They are failing nyc\" Very sad!"},{"text":"I hear the very ungrateful @ArsenioHall has a show that is absolutely dying in the ratings. Really too bad!"},{"text":".@ArsenioHall - How quickly people forget, but not me! You told me that without The Apprentice you could never have gotten your show - Sad!"},{"text":"Putin has become a big hero in Russia with an all time high popularity. Obama, on the other hand, has fallen to his lowest ever numbers. SAD"},{"text":"President Obama was able to fool the Americans by getting elected, but not able to fool Vladimir Putin. Too bad for us!"},{"text":"There are many editorial writers that are good, some great, &amp; some bad. But the least talented of all is frumpy Gail Collins of NYTimes."},{"text":"I have clearly stated that if the New York State Republican Party is able to unify, I would run for Governor and win. They can't unify -SAD!"},{"text":"\"@integgriti: @realDonaldTrump Mr.trump you said that you would run for president if nation got worse. It is real sad now...\""},{"text":"They should have allowed applause during the TRIBUTE to the departed - Really bad production. Bette Midler sucked! #Oscars"},{"text":"Little Andy Lassner, who lives his life through Ellen and has nothing else going for himself, is having a really bad night! #Oscars"},{"text":"Ellen is sadly having a hard time with her lines. #Oscars"},{"text":"Certain people are ruining their reputations tonight-really sad! #Oscars"},{"text":"Sissy Graydon Carter of failing Vanity Fair Magazine and owner of bad food restaurants has a problem-his V.F. Oscar party is no longer \"hot\""},{"text":"Obama just stated \"he didn't take school seriously, made bad choices and GOT HIGH\" - then how the hell did he get into Columbia &amp; Harvard?"},{"text":"Wow, NY Observer story about @AGSchneiderman really exposes him as a sleazebag &amp; crook. He’s bad for New York.  http://t.co/k61ryFURBH"},{"text":"\"@woodrowwinters                           \nyou have 3 very capable kids that can run the company for you This country needs you badly.\" Thx"},{"text":"\"@amarudacosta: Sadly @realDonaldTrump was correct about South Africa - the level of violence is irrepressible\""},{"text":"I wonder how much money dumb @BuzzFeed and even dumber Ben Smith loooose each year? They have zero credibility - totally irrelevant and sad!"},{"text":"I never equated wind farms to the Pan Am Lockerbie disaster - only stated that @AlexSalmond should never have released the terrorist - BAD!"},{"text":"Watch commodity prices soar because of the freezing cold. Will be bad for the economy. We could use some global warming."},{"text":"The @Broncos had a truly bad day--my advice is to go home, forget about it, and come back tough next year."},{"text":"\"@AceBuey: @realDonaldTrump sadly, HBO had no morals and gave that garbage another show @billmaher\"  BOYCOTT HBO!"},{"text":"\"@Badash78: @realDonaldTrump @ToddThomson12 @RSherman_25 Sherman has great respect for you Mr. Trump.\""},{"text":"@NewYorkGOP The Ed Cox letter to Republicans, which is being so badly ridiculed by the press, should never have been written. WEAKNESS-SAD!"},{"text":"\"@Discoboy7                \nSalmond is on a one man crusade to destroya Brilliant Union &amp; his u turn on your investment is a disgrace!\" Thx"},{"text":"\"Stay confident even when something bad happens. It is just a bump in the road. It will pass.\" - Think Big"},{"text":"Another one of my predictions just came true-- Iraq is a total disaster with government losing all control—so sad."},{"text":"\"Be on time. Wasting other people's time due to poor planning and thoughtlessness will only leave a bad impression.\" - Think Like a Champion"},{"text":"It is really too bad that the scientists studying GLOBAL WARMING in Antarctica got stuck on their icebreaker because of massive ice and cold"},{"text":"\"Do your homework. Wasting other people's time due to poor planning will only leave a bad impression.\"- Think Like a Billionaire"},{"text":"\"@manny_ottawa: @Alex_Norcia @realDonaldTrump seems like @AlexSalmond has a history of bad decision making. Maybe that's the point\" TURBINES"},{"text":"No cuts to welfare, no cuts to food stamps &amp; NOT A SINGLE CUT TO OBAMACARE, yet the new budget cuts military benefits. Sad!"},{"text":"I like Rob Astorino. He's a friend and really good guy. Sadly, he has ZERO chance of beating Cuomo and the 2 to 1 Dems for governor!"},{"text":"If Graydon Carter's very dumb bosses would fire him for his terrible circulation numbers at failing Vanity Fair-his bad food restaurants die"},{"text":"What a sad thing that the  memory of Nelson Mandela will be stained by the phoney sign language moron who is in every picture at funeral!"},{"text":"A $1.5B website that can only handle 50K users at a time is sad but no surprise!"},{"text":"Why does Conde Nast allow dopey Graydon Carter to run bad food restaurants while running failing @VanityFair magazine?"},{"text":"It's amazing how badly the Knicks and Nets are playing. Everybody predicted they would be top teams with all of the money spent. Too bad!"},{"text":"If Graydon Carter's very dumb bosses would fire him for his terrible circulation numbers at failing Vanity Fair-his bad food restaurants die"},{"text":"Graydon Carter, whose reign over failing @VanityFair has been a disaster, has acted in two movies--both bombed &amp; got bad reviews."},{"text":"@VanityFair   Wow, I just looked at the circulation numbers - Vanity Fair Magazine won't be around much longer, it's really in bad shape!"},{"text":"The now $1.2B ObamaCare website is as bad as ever-- insurers not getting the proper data. http://t.co/W1zv7STHBi"},{"text":".@VattenfallGroup wants out of their Aberdeen windfarm fiasco so badly but @AlexSalmond won’t let them—he’s (cont) http://t.co/3mMhWZjmGz"},{"text":"Congrats to @msnbc for firing Martin Bashir—don’t feel badly, he didn’t get ratings anyway. @SarahPalinUSA"},{"text":"Too bad about New York Magazine, but there's a much bigger one out there, currently doing a story on me to get even, that I'll soon discuss!"},{"text":"Here we go again via @timesunion.com http://t.co/8Tc9qBUgbZ ... another bad deal."},{"text":"Dying @GQMagazine just named me to a list. Too bad GQ is no longer relevant—won’t be around long!"},{"text":"\"@skew11: I hope and know @realDonaldTrump will win in court. Very bad what the AG did to him &amp; Trump University!\""},{"text":"Just got home, watching the news, and every story is bad about the U.S. Someday we will return to being great again, but we need leadership!"},{"text":"How much longer are we expected to put up with the world's most incompetent     leader - ObamaCare, Iran, Syria, bads deals. JUST NEVER ENDS"},{"text":"The scum that gets high on badly hurting old ladies and others through knockout assaults wouldn't feel that way with a gun at their head!"},{"text":"@morningmika   I'm watching Joe (who is 100% correct on Afghanistan) fondling the once great Time Magazine-so sad to see how skimpy it is!"},{"text":"@nolanitenyc Sad!"},{"text":"Jamie Dimon just gave away $13B to government in settlement. Terrible move &amp; bad precedent.  Could have done much better by fighting."},{"text":"I took some heat a long time ago when I said that George Zimmerman was a sicko and bad news. I know people and this guy is no good-trouble!"},{"text":"\"@OJOsborn: @realDonaldTrump I am one of them fools. The presidents heart in right place\"  WRONG, he knowingly lied - bad intentions!"},{"text":"ObamaCare is on LIFE SUPPORT - it will soon be DEAD ON ARRIVAL - A bad concept that was imcompetently administered!"},{"text":"Don't worry, when our country starts hurting bad enough from all of the mistakes that are being made, we will start doing the right things."},{"text":"She is so sad and pathetic that I almost feel sorry for Sec.Sebelius. She has done great harm to many people and must be fired. Incompetent!"},{"text":"\"@billmaher: With the cast from Friday's Real Time - and now I'm in Springfield, Mass for standup tonight-and Bill, you totally bombed-\"BAD\""},{"text":"Like your current health care plan? Too bad, you’re going to lose it under ObamaCare. Hope, Change &amp; a  300% Increase in Your Premium."},{"text":"@bradkovach Sadly true!"},{"text":"\"@KSV_3: I want @realDonaldTrump to tweet me so bad! Huge fan! #Trump2016\""},{"text":"At this point the legacy of the Obama Administration will be, sadly, that of THE GANG THAT COULDN'T SHOOT STRAIGHT - what a pathetic mess!"},{"text":"\"@sundayhorse: @realDonaldTrump @thegurleygirl Sad Donald trump isn't president we would not be in this mess!  So true."},{"text":"\"Courage is being scared to death... and saddling up anyway.\" - John Wayne"},{"text":"Why doesn't President Obama call upon the NSA to fix the badly broken website-then they could spy on all of the many cheaters &amp; arrest them!"},{"text":"Honestly, whether you're for or against ObamaCare, the 635 million dollar website fiasco is bad for the U.S. It makes us look totally inept!"},{"text":"@NYMag   Wow, numbers are really looking bad at  New York Magazine. While very boring, it is also very biased. Too bad, was once great!"},{"text":"\"@rockinthetote: @realDonaldTrump @DanAmira @NYMag what a horrible thing to say!\"  Not exactly an unbiased editor-very unprofessional &amp; sad!"},{"text":"\"@Josethegr8t: @realDonaldTrump @val_wonders @DanAmira @NYMag if it does go up for sale ill buy them out.\"  Don't do it-bad investment!"},{"text":"\"@MCdex207: See, @realDonaldTrump isn't as bad as people think. Great interview with @LateShow #goodguy\""},{"text":"It is outrageous and disgusting that families of U.S. MILITARY personnel killed in action will not be given money for burials. SAD!"},{"text":"\"@HoneyBadger210: @realDonaldTrump Remember when Obama said Bush raising the debt ceiling was \"unpatriotic?\" http://t.co/ooujPkXQgH RT!!!\""},{"text":"Can you imagine, with all of the talk about ObamaCare, technical breakdowns made it a disastrous day. Our government is badly broken!"},{"text":"Nice guy @pennjillette needs your help to make his bad guy movie Directors Cut--&gt; http://t.co/NZh2ycczGv @fundanything"},{"text":"The Republicans can absolutely win if they stick together-but they are NOT sticking together. Sen. McCain just said \"we can't win\".Very bad!"},{"text":"\"@2LukeVBeck2: @realDonaldTrump \"Americas Hope\"\" Our country needs hope - it is in really bad shape!"},{"text":"President Obama seems so fawning and desperate to make a deal with Iran that lots of bad results can occur. Be cool and be careful!"},{"text":"Bashar Assad is stronger today than he was before Obama threatened military action. Obama really bungled this."},{"text":"New York Fashion Week is really bad, and used to be so glamorous and exciting! No stars, no fun-just boring. They need serious help. #NYFW"},{"text":"Now Assad is demanding that Obama stop supporting the rebels before he turns over his chemical weapons. What a mess!"},{"text":"Assad hit the jackpot!"},{"text":"The only reason Obama gave a speech last night was because it was on the schedule-Putin is laughing and the reviews have been really bad!"},{"text":"\"@morningafterbil: @realDonaldTrump I can't imagine you being bad at anything. You are the real most interesting man in the world.\" Wow,nice"},{"text":"Doesn't want to remove Assad - worries what comes next."},{"text":"This new Russian strategy guarantees victory for the Syrian government-and makes Obama and U.S. look hopelessly bad. President in trouble!"},{"text":"@bahia6085                \n\"@realDonaldTrump Can you imagine Obama running his own business? How sad would that be?\" You never know!"},{"text":"Assad will never give up his chemical weapons. He has spent years and billions accumulating them. This is all a ruse."},{"text":"@Toure  Dumb as a rock Toure doesn't have a clue about money or anything else-merely a simpleton racist.Really bad ratings,really stupid guy"},{"text":"@Toure If you weren't such a dumb racist moron with bad ratings you would know I never filed for bankruptcy,now worth over $10 billion dummy"},{"text":"Now Obama has set red line 2 with demand that Assad hands over Syria’s chemical weapons or it will face an attack."},{"text":"The New York Giants are looking really bad so far tonight. Does not get much worse than this!"},{"text":"\"@anitaozz2: @Toure @realDonaldTrump Trump will do or say anything.\"  But Toure (why only one name?) is just a very dumb racist-bad ratings!"},{"text":"I'm a Republican but not a fan of the last George Bush-he also was a lousy President (Iraq etc.). In fact, he was so bad he gave us Obama!"},{"text":"\"@robyncook7: It's sad that @realDonaldTrump knows more about politics than our politicians\""},{"text":"Really bad news just announced concerning jobs. Far fewer jobs created in August than anticipated. Interest rates, therefore, to remain low."},{"text":"AGAIN, TO OUR VERY FOOLISH LEADER, DO NOT ATTACK SYRIA - IF YOU DO MANY VERY BAD THINGS WILL HAPPEN &amp; FROM THAT FIGHT THE U.S. GETS NOTHING!"},{"text":"President Obama put himself in a very bad position when he talked about Syria crossing the RED LINE. Amazingly, now he denies he said that!"},{"text":"\"@PDGreenwood: \"I wish I could go on Jay's show so badly!\" Real quote from @realDonaldTrump\" Real quote is \"I wish they would stop calling\""},{"text":"I hear this moron @billmaher said nasty things about me (hair etc—boring) on the terminated @jayleno show. Stupid guy/bad ratings!"},{"text":"China, OPEC and Russia laugh at us. But now thanks to Obama so does Syria. Very sad!"},{"text":"Our country is looking very bad right now!"},{"text":"\"@DanScavino: @realDonaldTrump - it's so bad there are actually maps of targets now in #Syria &amp; where USA ships would attack from."},{"text":"\"@Joe1sPro: @realDonaldTrump the president of Syria is killing people inhumanly\"  But the so called \"rebels\" may be just as bad (or worse)!"},{"text":"How bad has our \"leader\" made us look on Syria. Stay out of Syria, we don't have the leadership to win wars or even strategize."},{"text":"If Obama attacks Syria and innocent civilians are hurt and killed, he and the U.S. will look very bad!"},{"text":"The ratings of The Cycle on MSNBC, a sad and pathetic show, are way down. If they fired racist moron @Toure, a truly stupid guy, they live!"},{"text":"\"@Fartlesburg: @realDonaldTrump Do you ever get sad?\"  I don't have the time!"},{"text":"\"@Sonnyjr66: @realDonaldTrump I'm a prof salesman, but not motivated by money, but like to win. Is that a bad thing?\"  No, not at all!"},{"text":"I give the President's speech a 7 on the scale of 0 to 10! Not bad but room for improvement!"},{"text":"\"A general is just as good or just as bad as the troops under his command make him.” -   Gen. Douglas MacArthur"},{"text":"\"@not_that_actor: @realDonaldTrump Col Peters is right. When our adversaries r at war w each other, Assad regime+ Al Q, stay out of it!"},{"text":"\"@Chowes247: @realDonaldTrump Corzine is a evil schemer who stole 1.4 billion. Trump starts a University to help people get rich &amp; he's bad!"},{"text":"\"@abimlebt: Eric Schneiderman trying to get himself an image as a strong man is suing @realDonaldTrump. Bad choice, Trump will eat him alive"},{"text":".@stuartpstevens did a horrible job for Mitt—is a refund in order? Sadly, Stuart is a disaster!"},{"text":"\"@BenKilzer: But really tho if @realDonaldTrump was president omg I want that so bad\""},{"text":"\"@vin609: @realDonaldTrump Sad Day for Atlantic city was the day you packed it in. The town jumped when you were there. Major loss.\""},{"text":"Fact: without Texas and states reaping the fracking boom, Obama’s job record would go from bad to worse!"},{"text":"More on Benghazi cover up: “ATTORNEY FOR WHISTLEBLOWER: 400 U.S. MISSILES STOLEN IN BENGHAZI” http://t.co/Sb3cWw4dAU  Really bad."},{"text":"\"@39caroline: @realDonaldTrump @HuffingtonPost @ariannahuff all good cos I dont read huffington post. Its garbage\"   It is failing badly!"},{"text":"Isn't it sad the way Putin is toying with Obama regarding Snowden. We look weak and pathetic. Could not happen with.a strong leader!"},{"text":"\"@bobbassman: @realDonaldTrump @anthonyolgin like when Bush killed all those kids in Iraq when he invaded the wrong country?\" Really bad war"},{"text":"\"@anthonyolgin: .@realDonaldTrump do u ever get sad?\"  Yes, when I look at what's happening to our Country!."},{"text":"A sad day for America with Snowden being granted asylum in Russia.  Putin is laughing at Obama."},{"text":"When I jokingly said \"bring back Steve Jobs to run Apple\" because Apple has not been doing well, the haters &amp; losers had a field day!  Sad."},{"text":"\"@kathykphillips: @realDonaldTrump ...It's Sunday night and I'm missing Celebrity Apprentice in a bad way! We start shooting in the Spring!"},{"text":"\"@Gary_J_S: @realDonaldTrump Do you think the rest of the country will eventually look like Detroit?  With bad leadership it could happen!"},{"text":"\"@Luke_Enns: \"@realDonaldTrump: “Courage is being scared to death, but saddling up anyway.”- John Wayne\" Cant argue with the Duke.\""},{"text":"Isn’t it sad that Weiner’s first press conference with wife Huma was yesterday admitting to a sext he made post-resignation &amp; apology!"},{"text":"“Courage is being scared to death, but saddling up anyway.”- John Wayne"},{"text":"\"@missADelgado: \"He's a very sick puppy. He's got a perversion.\" - @realDonaldTrump pulling no punches re: Weiner (#GretaWire)\""},{"text":"As I told everyone once before, Wiener is a sick puppy who will never change-100% of perverts go back to their ways. Sadly, there is no cure"},{"text":"@sepamu @rainnwilson Citizen Kane, Gone with the Wind, The Good the Bad and the Ugly, etc."},{"text":"\"@poppjoe: @realDonaldTrump I've been to Shanghai airport and its amazing. We are 3rd world , no direction from our president. SAD\""},{"text":"China is building 50 brand new airports while our country continues to rott! Very sad."},{"text":"For the disciples of global warming, in 150 summers (years) there have been 20 heat waves as bad or worse than current-this has happened b4!"},{"text":"Sad thing is Rolling Stone was (is) a dead magazine with big downward circulation and now, for them at last, people are talking about it!"},{"text":"@JMonaski1 Sad!"},{"text":"Weiner and Spitzer are on top of the latest polls.  A sad day for the greatest city on earth! They will spend lots of time together."},{"text":"\"@Scribe53: @realDonaldTrump @MGIFINC Agree about Rosie. Sad because she is very talented.\"  Actually, she has got no talent at all-ZERO!"},{"text":"\"@MGIFINC: @realDonaldTrump --- Call Rosie O'Donnell to help you.\"She can't help herself - she's sad, angry and pathetic!"},{"text":"\"@tcasson21: @realDonaldTrump craig ferguson called you a bad person the other day? what is your opinion of him?\"  Who is Craig Ferguson?"},{"text":"Pakistani intelligence had full knowledge that Bin Laden was living in Abbottabad.  They were sheltering him."},{"text":"Too bad @morningmika did not allow her interview with @SpitzerForNYC  to go on another few minutes…would have been interesting…"},{"text":"\"@m_i_c_h_a_e_l_m: @realDonaldTrump you are a very handsome man\"   I know, but the haters and losers never give me credit for that! Too bad."},{"text":"\"@ZacharyZermay: @realDonaldTrump I just find it hilarious how you screwed Gaddafi.\"  Too bad our Country can't do the same!"},{"text":"The \"Arab Spring\" is not working out so well-nice name, bad results!"},{"text":"\"@mistressleesa: @realDonaldTrump @AsadTMoosvi And if you love what you do, it doesn't feel like work!\"  100% true-it's like a vacation!"},{"text":"\"@AsadTMoosvi: @realDonaldTrump What's one advice you'd give to an aspiring entrepreneur?\"  Work hard and love what you do-never give up!"},{"text":"\"@Mishaforever: @realDonaldTrump @MikeDGarrison Fuck yeah! She SHOULD have to pay!\"  She said some really bad and stupid things."},{"text":"He would be crazy to play in L.A. - really bad coach who can't adjust to his players!"},{"text":"Everytime someone tweets that I wear a wig realize to yourself that you are dealing with \"them\" - just another sad &amp; lonely hater and loser!"},{"text":"\"@newnonny: @BmoreBadBoy81 @realDonaldTrump don't hate him for being successful. Hate him for being an \"asshole\" Actually, I agree with that"},{"text":"\"@johnnyboob2: @realDonaldTrump haha you went bankrupt once? thats sad and embarassing\" I never went bankrupt moron-see Buffett,Kravis,Zell!"},{"text":"You mean the fact that my father left me some money (as a good father will) and I multiplied it many, many times to over $10 billion-is bad?"},{"text":"@inkinhole  Very sad, isn't it!"},{"text":"Who would really believe I would say such a thing about a guy I truly liked, James Gandolfini.  Sadly, very sick people use my name."},{"text":"\"@peaceloveandmeg: but when you're in a beauty contest ran by @realDonaldTrump , all the contestants are republican.\" Bad grammar (run)."},{"text":"We should stay the hell out of Syria, the \"rebels\" are just as bad as the current regime. WHAT WILL WE GET FOR OUR LIVES AND $ BILLIONS?ZERO"},{"text":"\"@Jdawgnuts: @realDonaldTrump if you really thought you could have won, you would have ran.\"  Very bad grammar (run)."},{"text":"Lightweight @DannyZuker is too stupid to see that China (and others) is destroying the U.S. economically and our leaders are helpless! SAD."},{"text":"\"@GSGOV: @Lord_Sugar sad it has come to this. Clown on TV and selling nail clippers online. Ask @realDonaldTrump for a job?\""},{"text":"Newsstand sales for @VanityFair, run by sleepy Graydon Carter, are down almost 20%. All he cares about are his bad food restaurants!"},{"text":"I feel bad for all @VanityFair employees. Every day at work, they see circulation going down as Graydon runs his bad food restaurants."},{"text":"Sadly, the overwhelming amount of violent crime in our major cities is committed by blacks and hispanics-a tough subject-must be discussed."},{"text":"\"The Chinese are the biggest beneficiary of this post-Saddam oil boom in Iraq\" http://t.co/9b4Fbu7GDy"},{"text":"\"@badgirlofrockxx: @realDonaldTrump Why arn't u in politics Donald..?\"  I am!"},{"text":"\"@_BOSS_TALK_: @realDonaldTrump http://t.co/D79nkpA1tK\"  Read this garbage by @vanityfair &amp; you'll see why sales WAY down-lost its way-sad!"},{"text":"Inflation is here.  Record beef prices are hitting consumers pockets http://t.co/NoJ0mgCS2L   Bad for family grills."},{"text":"\"@DannyZuker: OK gotta go. You're not \"going\" anywhere Danny, you're being beaten so badly that you can't take it anymore-enjoy your chair!"},{"text":"\"@MikeMcCabeSad: @realDonaldTrump @DannyZuker the fact that you keep tweeting at him is showing why you lost\"  True, Danny is a known loser!"},{"text":"@TheRealKurse Thank you, I was dealing with a very bad person!"},{"text":"@DannyZuker everyone is saying you are being beaten badly at this game but you can turn things around quickly if you will go for the deal."},{"text":"\"@A11_Seeing_Eye: @realDonaldTrump @DAM615 Does an IQ of 60 count as being smart?\" No, sadly you are very dumb-but probably born that way."},{"text":"Let's see whether or not Chuck Townsend @CondeNastCorp is smart enough to fire Graydon Carter, who only cares about his bad food restaurants"},{"text":"@Triggerracing  That sounds great--a bad woman."},{"text":"@jgy777ph Thanks Joannah, they are sad and lost people."},{"text":"\"@RandyRolph: @realDonaldTrump Shelly Kulwin says your a lyin' dog Mr. Trump.\" Shelly Kulwin is a really bad lawyer who lost big today(fool)"},{"text":".@VanityFair could come back if Graydon Carter paid as much attention as he does to his bad food restaurants. @CondeNastCorp"},{"text":"...... Circulation is way down and all he thinks about are his bad food restaurants. @CondeNastCorp"},{"text":"Very sad that Republican donors were targeted by Obama’s IRS."},{"text":"\"@Kingofgames3000: @realDonaldTrump the baddest boss on the planet taking no bs from anybody gotta hand it to you the real estate king\" Cute"},{"text":"How badly will the Country be hurt by the three scandals and the very poor implementation and cost of Obama Care?"},{"text":"I'm watching Knicks game-I'd bet all of those guys with the terrible tattoos wish they never got them-too bad, too late!"},{"text":"\"@ChrisLeahey1: @realDonaldTrump Do you see President Obama surviving these scandals ?\"  Sadly yes, but he will never be the same!"},{"text":"The \"lady\" in Chicago that I'm fighting owes me $500, 000 and is sophisticated  &amp; vicious. She made up a story &amp; plays the \"age card\" - bad!"},{"text":"@AndyBarovick   Really terrible and a sad day for our Country!"},{"text":"@GuerrillaTycoon  Not even close - he is just, as you know, a very bad copy (who I profit from)."},{"text":"Sadly, firing can be an essential and responsible business decision. It isn't pleasant, but lopping off a branch can save a tree."},{"text":". @chrislhayes replaced @edshow on @msnbc to increase ratings. It’s a shame Chris’ are even worse. Sad to see."},{"text":"Jodi Arias has stated that she follows me on twitter so I really hate to be saying that she is guilty but sadly, she is as guilty as it gets"},{"text":"Just took a look at Time Magazine-looks really flimsy like a free handout at a parking lot! The sad end is coming-just like Newsweek!"},{"text":"@realDonaldTrump   Windfarms destroy everything around them-very sad!"},{"text":"The Time Magazine list of the 100 Most Influential People is a joke and stunt of a magazine that will, like Newsweek,soon be dead. Bad list!"},{"text":"\"@sad__mom: @realDonaldTrump when i watch the clouds all i see is your face and think \"success\"\"Wow!"},{"text":"@loverofthecross I don't hate him but he made some really bad decisions."},{"text":"Do executives at @msnbc know that the business of TV centers on viewers &amp; ratings? @msnbc is #19 on cable http://t.co/lXPVsOpadu Sad."},{"text":"\"@Edincamera2: @AlphaTrebleSix @realdonaldtrump It's saddens me to know someone so moronic can become so rich.\"  Perhaps I'm really smart?"},{"text":"It’s very sad that the administration isn’t sending anyone to Margaret Thatcher’s funeral. She was a big U.S. supporter."},{"text":"I’ve known @hardball_chris for a long time &amp; sadly, he gets dumber each &amp; every year--&amp; started from a very low base."},{"text":"Bad break for @TigerWoods-hits a great shot which hits the pin and kicks into the water-gets a bogey on hole with another great shot-Champ!"},{"text":"What a shame that Kobe Bryant was so badly injured last night - a truly great champion who brought the Lakers back from oblivion this year!"},{"text":"The only American who has met with the North Korean man child is Dennis Rodman.  Isn’t that frightening and sad?"},{"text":"\"@salesdan48: @realDonaldTrump Mark Cuban is a sad, unhappy man. A facade, masquerading as a Trump wannabe.\" Very interesting!"},{"text":"I feel so badly for Mark Cuban-the Dallas Mavericks were just eliminated from the playoffs and his partners are pissed. Very sad!"},{"text":"\"@IronMan1021: I think after watching his roast I've realized that @realDonaldTrump is super fucking bad ass Props to you sir\" True - thanks"},{"text":"\"@HelpUServe: @realDonaldTrump donald we are always supporting other countries\"  often times because we're stupid - we make bad deals!"},{"text":"\"@ec364: @realDonaldTrump where's Sadam's billiions of $$ after Bush invested American taxpayer$. We were too stupid to take it-loser pols!"},{"text":"I am doing On the Record With Greta Van Susteren at 10 P.M. on Fox. We will be talking about the bad economy and other subjects of interest!"},{"text":"Jobs report is really bad - beyond the worst projections.A bad day on Wall Street!"},{"text":"The basketball coach at Rutgers looks bad but I had a coach who made him look like a baby - coaches can be tough!"},{"text":"Another freezing day in the Spring - what is going on with \"global warming\"?  Good move changing the name to \"climate change\" - sad!"},{"text":"No, I'm saying that the World is paying the price for China's pollution while they make a fortune with their dirty factories! Very sad."},{"text":"Current @NYMag really sad, not only boring but highly inaccurate. Use better paper product - looks like a death march (which it is!)."},{"text":"\"@JaySuch: Hey @realDonaldTrump. My 8 year old needs to do a book report on a bad person. We picked you.\"  A great subject, should get an A."},{"text":"\"@DMBGreySt: @realDonaldTrump @NYMag agreed. I won't be renewing. I got back issues that are paper weights.\" Bad people, false writing!"},{"text":"\"@kalevans: @realDonaldTrump Iowa is the second leading state in the nation when it comes to wind energy! Sad distinction, farm land lost!\""},{"text":"Obama has now become the weakest POTUS against China, yuan just hit record high against dollar http://t.co/sEbQQycPmf  Very sad!"},{"text":"\"@lfoshie: There are 2 people with whom you don't want to be on their bad side- God's... &amp; @realDonaldTrump's!\"  I want to be on God's side!"},{"text":"\"@Ashbash032: @Nautilus916 @realDonaldTrump lucky for me I don't live in America, I live in South Africa...\"  Bad news, we need you here!"},{"text":"\"@realbryanbirse: @realDonaldTrump was ur first tee shot at trump links a snap hook?\"  Sadly, yes!"},{"text":"\"@dubenezic: @realDonaldTrump Great speech. All true. Some of it sadly. #CPAC\"Thanks Bob!"},{"text":"Do your homework. Wasting other people’s time due to poor planning and thoughtlessness will only leave a bad impression."},{"text":"It’s sad that the WH is punishing children from across the country by closing all tours. Doesn’t have to be.  WH should take my offer."},{"text":"@sadatDM. Thanks."},{"text":"John Heilemann, the lightweight reporter begging to be on@morning joe, looks like a timebomb waiting to explode-he's a nervous and sad mess!"},{"text":"Really bad article about me in the dying (or dead) Esquire Magazine. Totally false - lots of hatred. When will this boring magazine close?"},{"text":"“Stay confident even when something bad happens. It is just a bump in the road. It will pass.” – Think Big"},{"text":".@tedcruz must be doing something right if @cher, sadly rated “the 4th ugliest celebrity” according to @listverse, is attacking him."},{"text":"You have to feel bad for the Democrat Senators.  They don’t want Hagel either.  Just following Obama’s orders."},{"text":"Our leaders are terrible. The government spends over $50B a day.  It can’t find cuts for less than 2 days of spending?! Sad!"},{"text":"@Barbaric_Yawwp.  Sadly, it's worthless!"},{"text":"The Oscar Pistorius disaster is a really interesting story to me—a very sad situation for everyone!"},{"text":"I’m really saddened to see that @Cher was voted “the 4th ugliest celebrity” according to @listverse...."},{"text":"\"I love the Lakers and when you love the Lakers, you want them to win so badly that you will work tirelessly.\" - Dr. Jerry Buss"},{"text":"Looks like @bwilliams is having some problems with his Rock Center with Brian Williams show--I hate to see such bad ratings for @NBC."},{"text":"@rubletz True--isn't it sad!"},{"text":"@JUrciuoli19 Not a bad idea--thanks!"},{"text":"Sad. Our food stamp rolls now surpass the entire population of Spain http://t.co/pFQ5cnmz We must do better or we will be Greece."},{"text":"@GradyMc Sadly, that's right."},{"text":"Bad. @gallupnews survey shows 30% of businesses not hiring-- they are worried they won’t be around in a year. http://t.co/apft7tpP"},{"text":"@cynthiawebster He had very bad advice."},{"text":"@nicolenulton  Thanks--Romney sadly did not resonate!"},{"text":"@hellcat1963  Sadly true--but it can change."},{"text":"Almost every television network wants me badly—but I stay loyal to @NBC."},{"text":"@lynn5101953 Sadly, true!"},{"text":"@ThePhilliesGirl @CrossingBroad @Deadspin  Sad losers!"},{"text":".@Deadspin’s disgusting response will teach me &amp; others not to be nice anymore—a sad lesson."},{"text":".@Deadspin guys are total losers—they had their story stolen right from under their bad complexions—other media capitalized!"},{"text":"Lance Armstrong was given very,very bad advice!"},{"text":"Sadly, I’m probably helping @billmaher’s lowly rated show—but charity will benefit by $5 million so it’s worth it."},{"text":"I am a handwriting analyst. Jack Lew’s handwriting shows, while strange, that he is very secretive—not necessarily a bad thing."},{"text":"It’s amazing that people can say such bad things about me but if I say bad things about them, it becomes a national incident."},{"text":"@sldewey  But a bad one!"},{"text":"Medicare payments have become so unpredictable that record amount of doctors are now leaving http://t.co/jKhiHnOT Bad for long term."},{"text":"How is @VanityFair editor Graydon Carter allowed to run bad food restaurant Beatrice Inn? Fire Graydon!"},{"text":"China is robbing us blind in trade deficits and stealing our jobs, yet our leaders are claiming 'progress' http://t.co/2r9DHxHo SAD!"},{"text":"Worst ever issue of @VanityFair magazine—bad food Graydon Carter should be fired!"},{"text":"We can’t even stop the Norks from blasting a missile.  China is laughing at us.  It is really sad."},{"text":"No money wasted like bad ads—the Republicans spent more &amp; got nothing for it."},{"text":"\"Donald Trump: Anna Wintour Ambassadorship Would Be ‘A Favor To The Country’\" http://t.co/mfnOWTaL via @mediaite"},{"text":"China is buying so many of our companies-- it’s really getting bad."},{"text":"Dopey Sugar—@Lord_Sugar  Isn’t it sad that my golf course in Scotland just got “best new course in the world”—it’s worth more than you are!"},{"text":"Dopey Sugar @Lord_Sugar  Bad ratings--come on, keep making me money--remember, I own your show."},{"text":"Dopey @Lord_Sugar  People are calling in saying you are being beaten badly w/ the tweets..."},{"text":"\"A general is just as good or just as bad as the troops under his command make him.\" --Douglas MacArthur"},{"text":"Alex Rodriguez has played under 140 games in each of the last five seasons. He will miss half of next season.  Really bad deal for @yankees."},{"text":"@johnboehner 25 days to go until fiscal cliff (bad name)—it is only a fiscal curb! Debt ceiling is real fiscal cliff.. will be interesting!"},{"text":"My support of Anna Wintour for Ambassador got a lot of coverage.  She is smart and will be a strong advocate for the US."},{"text":"Via @USATODAY: “Trump endorses Wintour for ambassadorship” http://t.co/u9Ek2xu0"},{"text":"25 days to go until fiscal cliff (bad name)—it is only a fiscal curb! Debt ceiling is real fiscal cliff...and that will be interesting!"},{"text":"I am happy to hear that Pres.Obama is considering giving Anna Wintour @voguemagazine an ambassadorship.  She is a winner &amp; really smart!"},{"text":"A-Rod @Yankees had hip surgery &amp; will be out 6 months. Do you notice all the “druggies” have bad hips."},{"text":"How could Michael Forbes get Scot of the Year when he lost—badly—to me &amp; Andy Murray, a true Scot, who won the U.S. Open &amp; Olympic gold?"},{"text":"Michael Forbes lives in a pigsty and bad liquor company Glenfiddich gave him Scot of the Year award..."},{"text":"The Muslim Brotherhood dictator in Egypt is bad news.  He will never be our true ally!"},{"text":"Wind turbines are totally destroying the areas in which they are located—all for unreliable, bad &amp; expensive energy!"},{"text":".@LaurenScruggs, who was badly injured by an airplane, was great on The Today Show!"},{"text":"@LaurenScruggs, who was badly injured by an airplane, was great on The Today Show!"},{"text":".@maddow  Standing in front of wind turbines is sad. Rachel, windmills are terrible for the environment—"},{"text":"Wow,  I never saw the Petraeus thing coming. A straight laced guy! Very sad for him and his family."},{"text":"I started to get very worried about Mitt's chances when I heard that A-Rod donated to his campaign. Everything A-Rod touches turns bad."},{"text":"A test: tweet me the reason @billmaher was fired from @ABC (other than his bad ratings)."},{"text":"Despite the upcoming election, the cover of paper-thin Time Magazine looks like an ad for the movie Lincoln--sad!"},{"text":"@TrickettTweeter  No, his facts are very bad for him."},{"text":"Reality TV’s #1 Bad Girl @OMAROSA is back on the upcoming 13th season of All Star @CelebApprentice.   She is great as always."},{"text":"Unemployment is now 7.9%.  Four years and $6.5T later, that is really bad!"},{"text":".@BarbaraJWalters called my office to ask me to do election night coverage with her--sadly, I won't be able to do it."},{"text":"The water damage to NYC is amazing. The winds were bad but the water was worse."},{"text":"So far the hurricane is being handled very well in NY, not nearly as bad as stated on news. Let's see what happens later."},{"text":"Alert...The president knew that the ambassador was being attacked  in Benghazi. He did nothing...he is no leader."},{"text":"Lance Armstrong fought for 7 years &amp; then just ran out of energy. Very sad story--although they caught him red handed.He definitely cheated!"},{"text":".@Toure, when you are fired from MSNBC for your bad ratings and racist coverage, stop by and say hello."},{"text":"The biggest problem with A-Rod is he is bad for the chemistry of the Yankees--- he must go."},{"text":"Where were all the @VanityFair exposes on \"When Rev. Wright disciples go to Washington?\"  Sad!"},{"text":"@stu120 No, sadly, not even close!"},{"text":".@lancearmstrong really blew it--went down in flames--too bad!"},{"text":"Obama said \"not optimal\" to Ambassador &amp; embassy killings--bad word usage for a Harvard graduate."},{"text":"Something really bad happened to the @Yankees psyche--much like our President!"},{"text":"Bad sign for Obama's campaign now publicly admitting they are focused on 4 states. Their internals must be horrendous."},{"text":"Newsweek ending print edition--sad. Now my Newsweek covers mean nothing--they lost all credibility. TIME to follow?"},{"text":"Alert--US jobless claims up 46,000 to 388,000. Really bad news. 7.8% is now a fraud--not possible!"},{"text":"Just read about my friend @HulkHogan--he was set up--too bad he has to use the court system instead of his muscles."},{"text":"...Bad decisions can be devastating."},{"text":"Polls are starting to look really bad for Obama. Looks like he'll have to start a war or major conflict to win. Don't put it past him!"},{"text":".@History's wonderful \"The Men Who Built America\" with me on tonight at 9 -- bad timing, I'll be live tweeting the debate"},{"text":"A bad thing finally happened to Derek Jeter--- he is a great champion."},{"text":"When will the unemployment numbers be corrected? Sadly, after the election!"},{"text":".@IsraeliPM @netanyahu delivered an excellent speech yesterday at the UN. Too bad @AmbassadorRice wasn't there."},{"text":"How long will it take for chants-- \"bring back the replacement refs\" -- when a bad call is made?"},{"text":"Pres. O -- a \"bump in the road\" in reference to our Ambassador's (and others) killing in Libya"},{"text":"The replacement refs are getting blamed for everything. I've seen many bad sports calls over the years."},{"text":"@designergirla Not a bad idea!"},{"text":"With all of the bad economic numbers and horrendous foreign policy, Obama should be down by 12 points--and he's not."},{"text":"@Ileschinder @willsommer Not a bad idea.( I'm in a magnanimous mood.)"},{"text":"What did we get for fighting in Libya besides a dead Ambassador. Demand their oil."},{"text":"As bad as they were, I don't remember our embassies being attacked when Mubarak and Gaddafi were in power."},{"text":"Libya is selling its oil to China--I notice the Chinese Ambassador is very safe."},{"text":"I always said the people we fought for in Libya were bad news. Once again, I was right."},{"text":"We fight to free Libya and they kill our Ambassador and other Americans. Obama's foreign policy is a joke."},{"text":"July U.S. construction had biggest drop in 12months. Bad indicator on economic numbers for rest of the year."},{"text":"I win awards for speaking-but the enemies either won't comment or will say only bad...leave Clint alone!"},{"text":"It is very sad to see what @BarackObama has done with NASA. He has gutted the program and made us dependent on the Russians."},{"text":"It's sad to see once decent newspapers like @USAToday failing so badly. I just don't know if they can be saved."},{"text":"...@BarackObama is hiding plenty of bad things."},{"text":"Palm Springs, CA has been destroyed--absolutely destroyed--by the world's ugliest wind farm at the Gateway on Interstate 10. Very very sad!"},{"text":"Certain Internet sites are like a bad epidemic that won't go away---others are terrific"},{"text":"Sad--only 36% think America's best days are ahead while 49% believe they are in the past http://t.co/xdombsP3  We can &amp; must do better."},{"text":"The NYPost reports \"@VanityFair Magazine dropped 18% to only 283,938 newsstand copies sold.\" Very sad &amp; their bloggers are doing even worse!"},{"text":".@HuffingtonPost is doing very badly. Also, very inaccurate stories. Like AOL, when will they fail?"},{"text":"Weekly jobless claims are now at an astronomical 365,000. Manufacturing sector is suffering badly. We must do better.  http://t.co/OG4StXtX"},{"text":"\"A general is just as good or just as bad as the troops under his command make him.\" --General Douglas MacArthur"},{"text":"Sad--just 16% of American parents think their children will be better off than them http://t.co/N6svVkUK   We can do much better!"},{"text":"Putin has no respect for our President --- really bad body language."},{"text":"Watch this video to see how bad wind turbines are for the environment-  http://t.co/fxavxE8Y"},{"text":"Sad.@BarackObama has already exempted major oil importers on Iranian sanctions and is negotiating a waiver with China.http://nyti.ms/KAOnVq"},{"text":"Sadly, it took a hit &amp; run auto accident to make us aware of who our Secretary of Commerce is--and such an important position!"},{"text":"Too bad I'll Have Another out of Belmont Stakes- interest now way down."},{"text":"\"A market is never saturated with a good product, but it is very quickly saturated with a bad one.\" -- Henry Ford"},{"text":"In some ways it is sad. We all wanted @BarackObama to succeed. It's not worked out that way."},{"text":"The stock market is having a horrendous day- bad employment numbers."},{"text":"Almost all reporters falsely report that I had a \"bad time\" at last year's White House Correspondents' Dinner. (cont) http://t.co/ITd5hSBd"},{"text":"Unemployment has risen today and some other very bad news has just been reported- the stock market is way down."},{"text":"Mitt Romney matches sitting President in fundraising for April--not an easy thing to do. Bad news for (cont) http://t.co/iVtmq6xX"},{"text":"More than $500 million designated for Iraqi Army disappeared. Where is it? Our sad sad country--what have we come to?"},{"text":"Very resource rich Canada, our neighbor, is looking to China for its growth. Just another sad commentary on the U.S. http://t.co/8DUw3buf"},{"text":"The TIME Magazine cover showing late age breast feeding is disgusting--sad what TIME did to get noticed. @TIME"},{"text":"@Cher should stop with the bad plastic surgery and nasty statements about good people running for office. I (cont) http://t.co/2CP8oCFD"},{"text":"Selective memory - @BarackObama says that he \"forgets\" the recession http://t.co/6Zbad1Vr Maybe that's why he is forgetting to create jobs."},{"text":"Now @BarackObama is praising China's \"cooperation\" in negotiations over Chen Guangcheng http://t.co/1BZtYueX This is a sad episode for us."},{"text":"Bad move-@BarackObama released $147M in aid to the Palestinians http://t.co/ZGf87eCQ That money is going to Hamas."},{"text":"He @johnedwards is bad, but @andrewyoung is worse--not only is he a \"rat\" but it turns out he stole much of the money for himself."},{"text":"Not only are wind farms disgusting looking, but even worse they are bad for people's health http://t.co/2G8YrOUZ (cont) http://t.co/NujHgnXU"},{"text":"A bad manager such as @BarackObama will continually be plagued by scandals.  http://t.co/MPXceBLa  Leadership starts at the top."},{"text":"Vanity Fair Magazine, which used to be one of my favorites, is failing badly. Newsstand sales are plummeting--- (cont) http://t.co/fM1wKW1r"},{"text":"My twitter account is now reaching more people than the New York Times--not bad. And we're only going to get better!"},{"text":"\"When people treat me badly or unfairly or try to take advantage of me, my general attitude, all my life, has (cont) http://t.co/RMI02tjB"},{"text":"Bad news for @BarackObama. @gallupnews reports that the economy (71%) and gas prices (65%) are Americans' top (cont) http://t.co/1B04r3YR"},{"text":"\"Sadly, when it comes to using the energy industry to create American jobs, Obama has been a total disaster. And (cont) http://t.co/jKObsFMp"},{"text":"\"Yes, the BP oil spill was bad, but it was no reason to put tighter clamps on domestic drilling. That showed no (cont) http://t.co/pLipL6ya"},{"text":"When the economy is bad, @BarackObama wants to raise taxes. When the economy is good, @BarackObama wants to raise taxes. Notice a trend?"},{"text":"\"So, I speak badly of China, but I speak the truth and what do the consumers in China want? They want Trump.\" (cont) http://t.co/sOna1B4I"},{"text":"He's saddled our children with more debt than we accumulated in 225 years in America. @BarackObama has done an (cont) http://t.co/HHsTz9FZ"},{"text":"\"So, I speak badly of China, but I speak the truth and what do the consumers in China want? They want Trump.\" (cont) http://t.co/AyZ18mvL"},{"text":"Formerly of the New York Times, @frankrichny was a poor theatre critic who was forced out. Sadly, he is an even (cont) http://t.co/n9hCp1Q3"},{"text":"\"Sadly, when it comes to using the energy industry to create American jobs, @BarackObama has been a total (cont) http://t.co/HD827UEk"},{"text":"“It’s sad—truly sad and disgraceful—the way Obama has allowed America to be abused and kicked around (cont) http://t.co/tHXcRowx"},{"text":"@BarackObama’s Russian Ambassador stated that he supports ‘universal values’ not ‘American values’ (cont) http://t.co/RCymV2v1"},{"text":"Tom Brokaw keeps calling Mitt Romney \"George\" (Mitt's father). Sadly, time is up for Tom."},{"text":"All I heard in the SOTU was proposals for more govt, more spending and more bureaucrats. Very bad!"},{"text":"\"Sadly, when it comes to using the energy industry to create American jobs, Obama has been a total disaster.\"  #TimeToGetTough"},{"text":"AMAZING - @BarackObama has actually found a government program he can cut in half - the Defense Department...bad (cont) http://t.co/0t0T3Wa0"},{"text":"Michele Bachmann got less than 1,200 more votes in the Caucus than she did in the Ames Straw Poll. Very sad for her--a nice woman!"},{"text":"Michele Bachmann will finish dead last tonight in Iowa because she is disloyal and a terrible boss. Sadly, it is over for Michele."},{"text":"America wasted billions and precious lives in Iraq and Iran will soon take control--very very sad."},{"text":"Govt. collapsing in Iraq only 2 weeks after withdrawal of our troops. Sadly, I called this one and please remember, I alone called it."},{"text":"\"The sad truth is some Republicans in Congress are clueless when it comes to negotiation.\"  #TimeToGetTough"},{"text":"The lightweight, @JonHuntsman, used my name in a debate for gravitas--it didn't work. Sad!"},{"text":"Please send a psychiatrist to help @Rosie, she’s in a bad state. To @Rosie’s girlfriend’s parents--- get (cont) http://t.co/1c9yApM4"},{"text":"With the number of tweets sad sack @Rosie has done, she has totally lost control of herself-- hopefully not a breakdown."},{"text":"#noratings @Lawrence will soon be off tv- bad ratings- he has a face made for radio."},{"text":"#badratings @Rosie you will never make it. You are not funny or talented."},{"text":"#badratings @Lawrence's show failed at 8pm and is failing(even worse) at 10pm- not long for tv....."},{"text":"#trumpvlog Same last name, same bad ratings- @lawrence and @rosie..... http://t.co/KCVRNBJa"},{"text":"Why was the Hanukah celebration held in the White House two weeks early? @BarackObama wants to vacation in Hawaii in late December. Sad."},{"text":"He ruins the brand: @Robertgbeckel doesn't belong on @FoxNews . As CM for Mondale in '84, you lost 49 states. Sad!"},{"text":"He ruins the brand: @bobbeckel doesn't belong on @FoxNews. As CM for Mondale in '84, you  lost 49 states. Sad!"},{"text":"Bob Beckel, a commentator for FOX is bad for the @FoxNews brand:  @BobBeckel is close to incompetent."},{"text":"Sadly, Vanity Fair is a rapidly dying magazine. Needs new blood--and fast! Going the way of SPY Magazine."},{"text":"Really bad ratings  for Lawrence O'Donnell on MSNBC---O'Reilly is killing him!"},{"text":"@BarackObama is so inept that I think he simply  made a mistake in originally scheduling the Joint Session on September 7th. Just sad."},{"text":"As bad as Qaddafi was---what comes next in Libya will be worse---just watch."},{"text":"Blue Ribbon Commission to find and agree to future spending cuts? Bad idea."},{"text":"Obama, sadly, has no business or private sector background---and it shows."},{"text":"Unfortunately@BarackObama's continued attack on the US $ will lead to ever rising gas prices at the pump and lots of other really bad things"},{"text":"@johnboehner Debt Ceiling- \"Sometimes no deal is better than a bad deal.\""}]
