[{"text":"The migrant ‘caravan’ that is openly defying our border shows how weak &amp; ineffective U.S. immigration laws are. Yet Democrats like Jon Tester continue to support the open borders agenda – Tester even voted to protect Sanctuary Cities. We need lawmakers who will put America First."},{"text":".@JimRenacci has worked so hard on Tax Reductions, Illegal Immigration, the Border and Crime. I need Jim very badly to help our agenda and to keep MAKING AMERICA GREAT AGAIN! He will be a fantastic Senator for the Great State of Ohio, and has my full endorsement!"},{"text":".@JimRenacci has worked so hard on Tax Reductions, Illegal Immigration, the Border and Crime. I need Jim very badly to help our agenda and to keep MAKING AMERICA GREAT AGAIN! He will be a fantastic  Senator for the Great State of Ohio, and has my full endorsement!"},{"text":"Arizona, please get out today and vote @DebbieLesko for Congress in #AZ08. Strong on Border, Immigration and Crime. Great on the Military. Time is ticking down - get out and VOTE today. We need Debbie in Congress!"},{"text":"Mexico, whose laws on immigration are very tough, must stop people from going through Mexico and into the U.S. We may make this a condition of the new NAFTA Agreement. Our Country cannot accept what is happening! Also, we must get Wall funding fast."},{"text":"The Caravan is largely broken up thanks to the strong immigration laws of Mexico and their willingness to use them so as not to cause a giant scene at our Border. Because of the Trump Administrations actions, Border crossings are at a still UNACCEPTABLE 46 year low. Stop drugs!"},{"text":"Honduras, Mexico and many other countries that the U.S. is very generous to, sends many of their people to our country through our WEAK IMMIGRATION POLICIES. Caravans are heading here. Must pass tough laws and build the WALL. Democrats allow open borders, drugs and crime!"},{"text":"As ridiculous as it sounds, the laws of our country do not easily allow us to send those crossing our Southern Border back where they came from. A whole big wasted procedure must take place. Mexico &amp; Canada have tough immigration laws, whereas ours are an Obama joke. ACT CONGRESS"},{"text":"Mexico is making a fortune on NAFTA...They have very strong border laws - ours are pathetic. With all of the money they make from the U.S., hopefully they will stop people from coming through their country and into ours, at least until Congress changes our immigration laws!"},{"text":"Mexico is doing very little, if not NOTHING, at stopping people from flowing into Mexico through their Southern Border, and then into the U.S. They laugh at our dumb immigration laws. They must stop the big drug and people flows, or I will stop their cash cow, NAFTA. NEED WALL!"},{"text":"Department of Justice should have urged the Supreme Court to at least hear the Drivers License case on illegal immigrants in Arizona. I agree with @LouDobbs. Should have sought review."},{"text":"“According to the Center for Immigration Studies, the $18 billion wall will pay for itself by curbing the importation of crime, drugs and illegal immigrants who tend to go on the federal dole...” https://t.co/NdLC6jZwWE"},{"text":"RT @WhiteHouse: Merit-based immigration reform will benefit American workers and relieve the strain imposed by our current system on Federa…"},{"text":"...lottery, continues deadly catch-and-release, and bars enforcement even for FUTURE illegal immigrants. Voting for this amendment would be a vote AGAINST law enforcement, and a vote FOR open borders. If Dems are actually serious about DACA, they should support the Grassley bill!"},{"text":"The Schumer-Rounds-Collins immigration bill would be a total catastrophe. @DHSgov says it would be “the end of immigration enforcement in America.” It creates a giant amnesty (including for dangerous criminals), doesn’t build the wall, expands chain migration, keeps the visa..."},{"text":"RT @SpoxDHS: Schumer-Rounds-Collins destroys the ability of @DHSgov to enforce immigration laws, creating a mass amnesty for over 10 millio…"},{"text":"While the Republicans and Democrats in Congress are working hard to come up with a solution to DACA, they should be strongly considering a system of Merit Based Immigration so that we will have the people ready, willing and able to help all of those companies moving into the USA!"},{"text":"My Administration has identified three major priorities for creating a safe, modern and lawful immigration system: fully securing the border, ending chain migration, and canceling the visa lottery. Congress must secure the immigration system and protect Americans. https://t.co/xV1lgfhjBU"},{"text":"Time to end the visa lottery. Congress must secure the immigration system and protect Americans. https://t.co/yukxm48x9X"},{"text":"We need a 21st century MERIT-BASED immigration system.  Chain migration and the visa lottery are outdated programs that hurt our economic and national security. https://t.co/rP9Gtr2E5N"},{"text":"Polling shows nearly 7 in 10 Americans support an immigration reform package that includes DACA, fully secures the border, ends chain migration &amp; cancels the visa lottery. If D’s oppose this deal, they aren’t serious about DACA-they just want open borders. https://t.co/XDMcDOr9vM"},{"text":"So disgraceful that a person illegally in our country killed @Colts linebacker Edwin Jackson. This is just one of many such preventable tragedies. We must get the Dems to get tough on the Border, and with illegal immigration, FAST!"},{"text":"Heading to beautiful West Virginia to be with great members of the Republican Party. Will be planning Infrastructure and discussing Immigration and DACA, not easy when we have no support from the Democrats. NOT ONE DEM VOTED FOR OUR TAX CUT BILL! Need more Republicans in ‘18."},{"text":"DACA has been made increasingly difficult by the fact that Cryin’ Chuck Schumer took such a beating over the shutdown that he is unable to act on immigration!"},{"text":"Great to see how hard Republicans are fighting for our Military and Safety at the Border. The Dems just want illegal immigrants to pour into our nation unchecked. If stalemate continues, Republicans should go to 51% (Nuclear Option) and vote on real, long term budget, no C.R.’s!"},{"text":"RT @realDonaldTrump: Democrats are holding our Military hostage over their desire to have unchecked illegal immigration. Can’t let that hap…"},{"text":"RT @realDonaldTrump: Democrats are far more concerned with Illegal Immigrants than they are with our great Military or Safety at our danger…"},{"text":"Democrats are holding our Military hostage over their desire to have unchecked illegal immigration. Can’t let that happen!"},{"text":"Democrats are far more concerned with Illegal Immigrants than they are with our great Military or Safety at our dangerous Southern Border. They could have easily made a deal but decided to play Shutdown politics instead. #WeNeedMoreRepublicansIn18 in order to power through mess!"},{"text":"Government Funding Bill past last night in the House of Representatives. Now Democrats are needed if it is to pass in the Senate - but they want illegal immigration and weak borders. Shutdown coming? We need more Republican victories in 2018!"},{"text":"The Democrats want to shut down the Government over Amnesty for all and Border Security. The biggest loser will be our rapidly rebuilding Military, at a time we need it more than ever. We need a merit based system of immigration, and we need it now! No more dangerous Lottery."},{"text":"....countries which are doing badly. I want a merit based system of immigration and people who will help take our country to the next level. I want safety and security for our people. I want to stop the massive inflow of drugs. I want to fund our military, not do a Dem defund...."},{"text":"“45 year low in illegal immigration this year.” @foxandfriends"},{"text":"The Democrats have been told, and fully understand, that there can be no DACA without the desperately needed WALL at the Southern Border and an END to the horrible Chain Migration &amp; ridiculous Lottery System of Immigration etc. We must protect our Country at all cost!"},{"text":"The people of Alabama will do the right thing. Doug Jones is Pro-Abortion, weak on Crime, Military and Illegal Immigration, Bad for Gun Owners and Veterans and against the WALL. Jones is a Pelosi/Schumer Puppet. Roy Moore will always vote with us. VOTE ROY MOORE!"},{"text":"Democrats refusal to give even one vote for massive Tax Cuts is why we need Republican Roy Moore to win in Alabama. We need his vote on stopping crime, illegal immigration, Border Wall, Military, Pro Life, V.A., Judges 2nd Amendment and more. No to Jones, a Pelosi/Schumer Puppet!"},{"text":"A disgraceful verdict in the Kate Steinle case! No wonder the people of our Country are so angry with Illegal Immigration."},{"text":"After North Korea missile launch, it's more important than ever to fund our gov't &amp; military! Dems shouldn't hold troop funding hostage for amnesty &amp; illegal immigration. I ran on stopping illegal immigration and won big. They can't now threaten a shutdown to get their demands."},{"text":"Meeting with “Chuck and Nancy” today about keeping government open and working. Problem is they want illegal immigrants flooding into our Country unchecked, are weak on Crime and want to substantially RAISE Taxes. I don’t see a deal!"},{"text":"We are fighting hard for Merit Based immigration, no more Democrat Lottery Systems. We must get MUCH tougher (and smarter).  @foxandfriends"},{"text":"The problem with agreeing to a policy on immigration is that the Democrats don't want secure borders,they don't care about safety for U.S.A."},{"text":"CHAIN MIGRATION cannot be allowed to be part of any legislation on Immigration!"},{"text":"I look forward to working w/ D's + R's in Congress to address immigration reform in a way that puts hardworking citizens of our country 1st."},{"text":"I campaigned on creating a merit-based immigration system that protects U.S. workers &amp; taxpayers. Watch: https://t.co/lv3ScSKnF6 #RAISEAct https://t.co/zCFK5OfYnB"},{"text":"Today, I hosted an immigration roundtable ahead of two votes taking place in Congress tomorrow. Watch and read more… https://t.co/5k8WzW1t68"},{"text":"RT @foxandfriends: HAPPENING TODAY: House to vote on immigration bills including 'Kate’s Law' and 'No Sanctuary for Criminals Act' https://…"},{"text":"RT @foxandfriends: Chicago approves new plan to hide illegal immigrants from the feds, plus give them access to city services https://t.co/…"},{"text":"Democrat Jon Ossoff would be a disaster in Congress. VERY weak on crime and illegal immigration, bad for jobs and wants higher taxes. Say NO"},{"text":"The weak illegal immigration policies of the Obama Admin. allowed bad MS 13 gangs to form in cities across U.S. We are removing them fast!"},{"text":"The super Liberal Democrat in the Georgia Congressioal race tomorrow wants to protect criminals, allow illegal immigration and raise taxes!"},{"text":"Jobs are returning, illegal immigration is plummeting, law, order and justice are being restored. We are truly making America great again!"},{"text":"Give the public a break - The FAKE NEWS media is trying to say that large scale immigration in Sweden is working out just beautifully. NOT!"},{"text":"My statement as to what's happening in Sweden was in reference to a story that was broadcast on @FoxNews concerning immigrants &amp; Sweden."},{"text":"'Immigration Ban Is One Of Trump's Most Popular Orders So Far' https://t.co/wAelwuQ4BE"},{"text":"Do you believe it? The Obama Administration agreed to take thousands of illegal immigrants from Australia. Why? I will study this dumb deal!"},{"text":"...Senators should focus their energies on ISIS, illegal immigration and border security instead of always looking to start World War III."},{"text":"The joint statement of former presidential candidates John McCain &amp; Lindsey Graham is wrong - they are sadly weak on immigration. The two..."},{"text":"'ICE OFFICERS WARN HILLARY IMMIGRATION PLAN WILL UNLEASH GANGS, CARTELS &amp; DRUG VIOLENCE NATIONWIDE'… https://t.co/09aSrBwQrv"},{"text":"Thank you NH! We will end illegal immigration, stop the drugs, deport all criminal aliens&amp;save American lives! Watc… https://t.co/uxcazVkb32"},{"text":"\"@AZTRUMPTRAIN: I #Voted for DonaldTrump! #Arizona ☉ #Economy #Immigration #Jobs #Veterans #BorderControl #Trade… https://t.co/0BJk9BwkfW\""},{"text":"Hillary has called for 550% more Syrian immigrants, but won’t even mention “radical Islamic terrorists.” #Debate… https://t.co/Rf48XkZWbu"},{"text":"TRUMP &amp; CLINTON ON IMMIGRATION\n#Debate #BigLeagueTruth https://t.co/OP4c7Jc8Ad"},{"text":"Paul Ryan should spend more time on balancing the budget, jobs and illegal immigration and not waste his time on fighting Republican nominee"},{"text":"Nation's Immigration And Customs Enforcement Officers (ICE) Make First-Ever Presidential Endorsement:\nhttps://t.co/eO1UY5N9J1"},{"text":"Five people killed in Washington State by a Middle Eastern immigrant. Many people died this weekend in Ohio from drug overdoses. N.C. riots!"},{"text":"The Republican Party needs strong and committed leaders, not weak people such as @JeffFlake, if it is going to stop illegal immigration."},{"text":"Thank you to @foxandfriends for the great review of the speech on immigration last night. Thank you also to the great people of Arizona!"},{"text":"RT @AnnCoulter: I hear Churchill had a nice turn of phrase, but Trump's immigration speech is the most magnificent speech ever given."},{"text":"From day one I said that I was going to build a great wall on the SOUTHERN BORDER, and much more. Stop illegal immigration. Watch Wednesday!"},{"text":"I will be making a major speech on ILLEGAL IMMIGRATION on Wednesday in the GREAT State of Arizona. Big crowds, looking for a larger venue."},{"text":"I am very proud to have brought the subject of illegal immigration back into the discussion. Such a big problem for our country-I will solve"},{"text":"Will be on #Hannity @ 10pE @FoxNews- discussing various subjects including immigration-if elected, we will #BuildTheWall &amp; enforce our laws!"},{"text":"During the GOP convention, CNN cut away from the victims of illegal immigrant violence. They don’t want them heard. https://t.co/EHRiLkQDWD"},{"text":"Crooked Hillary Clinton wants to flood our country with Syrian immigrants that we know little or nothing about. The danger is massive. NO!"},{"text":"We must suspend immigration from regions linked with terrorism until a proven vetting method is in place."},{"text":"New Government data by the Center for Immigration Studies shows more than 3M new legal &amp; illegal immigrants settled..https://t.co/hMFyZc1kAM"},{"text":"On immigration, I’m consulting with our immigration officers\n&amp; our wage-earners. Hillary Clinton is consulting with Wall Street."},{"text":"Obama &amp; Clinton should stop meeting with special interests, &amp; start meeting with the victims of illegal immigration."},{"text":"Hillary Clinton's open borders immigration policies will drive down wages for all Americans - and make everyone less safe."},{"text":"In my speech on protecting America I spoke about a temporary ban, which includes suspending immigration from nations tied to Islamic terror."},{"text":"TERRORISM, IMMIGRATION, AND NATIONAL SECURITY SPEECH- TRANSCRIPT: https://t.co/WD1LGFKx3M https://t.co/T7yHSdCeU8"},{"text":"Just met with courageous family of Sarah Root in Nebraska. Sarah was horribly killed by illegal immigrant, but leaves behind amazing legacy."},{"text":"\"@DiCristo13: @realDonaldTrump let's have the policy speeches on immigration, economy,  foreign policy, and NATO! https://t.co/Uuit2hWmhW\""},{"text":"I will be in Wisconsin until the election. Jobs, trade and immigration will be big factors. I will bring jobs back home - make great deals!"},{"text":"It is amazing how often I am right, only to be criticized by the media. Illegal immigration, take the oil, build the wall, Muslims, NATO!"},{"text":"Do you believe that Hillary Clinton now wants Obamacare for illegal immigrants? She should spend more time taking care of our great Vets!"},{"text":"Ohio is losing jobs to Mexico, now losing Ford (and many others). Kasich is weak on illegal immigration. We need strong borders now!"},{"text":"Rubio is weak on illegal immigration, with the worst voting record in the U.S. Senate in many years. He will never MAKE AMERICA GREAT AGAIN!"},{"text":"\"@WaltSeher: @realDonaldTrump @morg25016893 @eventbrite yup 200 Polish immigrants were hired by his contractor not Trump\""},{"text":"Ted Cruz only talks tough on immigration now because he did so badly in S.C. He is in favor of amnesty and weak on illegal immigration."},{"text":"Remember that Marco Rubio is very weak on illegal immigration. South Carolina needs strength as illegals and Syrians pour in. Don't allow it"},{"text":"\"@FamilyRedsFans: @FoxNews is really starting to campaign hard for marcorubio. #fairandbalancedmyass\"  He is weak on illegal immigration!"},{"text":"I will end illegal immigration and protect our borders! We need to MAKE AMERICA SAFE &amp; GREAT AGAIN! #Trump2016\nhttps://t.co/wd3LlMz01I"},{"text":"Remember @JebBush wants COMMON CORE (education from D.C.) and is very weak on ILLEGAL IMMIGRATION (\"come as act of love\"). Not a leader!"},{"text":"Jeb Bush is desperate - strongly in favor of #CommonCore and very weak on illegal immigration."},{"text":"Border agent: \"We might as well abolish our immigration laws altogether\"\nhttps://t.co/LsrIXzCyJr"},{"text":"I told you so. Our country totally lost control of illegal immigration, even with criminals. \nhttps://t.co/IZgZqr6BgB"},{"text":"RT @seanhannity: Watch: Donald Trump OWNS A Heckler Who Said Illegal Immigrants Are The Backbone Of America https://t.co/cRAOzIP0pH"},{"text":"\"Why Franklin Graham says Donald Trump is right about stopping Muslim immigration\"  https://t.co/iVPJcDQLeO"},{"text":"\"@ray_aub:  @nytimes @CNN People forget the policies of leaders like @JebBush allowed 9/11 killers to immigrate, drive, &amp; pilot planes\""},{"text":"Statement on Preventing Muslim Immigration: https://t.co/HCWU16z6SR https://t.co/d1dhaIs0S7"},{"text":"\"@Blacks4Trump16: Legal &amp; illegal immigration drive down American wages. Only DonaldTrump can fix this. @AnnCoulter #Trump2016 #TeamTrump\""},{"text":"Illegal immigrant children, non-Mexicans surge across border at record rate https://t.co/V6TP55dRAC"},{"text":"Jamiel Shaw was incredible on @foxandfriends this morning. His son, who was viciously killed by an illegal immigrant, is so proud of pop!"},{"text":"When you do your Christmas shopping remember how disloyal @Macys was to the subject of illegal immigration. #BoycottMacys #DumpMacys"},{"text":"Hillary Clinton is weak on illegal immigration, among many other things. She is strong on corruption - corruption is what she's best at!"},{"text":".@HillaryClinton is weak on illegal immigration &amp; totally incompetent as a manager and leader - no strength or stamina to be #POTUS!"},{"text":"Everyone is now saying how right I was with illegal immigration &amp; the wall. After Paris, they’re all on the bandwagon."},{"text":"\"@peg4cats: @TerryLambert201 @realDonaldTrump you are so right. I only trust Trump to be tough on immigration\""},{"text":"Macy’s was very disloyal to me bc of my strong stance on illegal immigration. Their stock has crashed! #BoycottMacys https://t.co/WsvZtwZbBf"},{"text":"Wow, pres. candidate Ben Carson, who is very weak on illegal Immigration, just said  he likes amnesty and a pathway to citizenship."},{"text":"\"@Christianlord12:  RUBIO sat back during debate on Immigration hoping no 1 would ask him about Gang of 8. https://t.co/sevUe7bikR\""},{"text":"Marco Rubio is totally weak on illegal immigration &amp; in favor of easy amnesty. A lightweight choker - bad for #USA!"},{"text":"\"@Watchman4the1: Chuck Schumer: Sen Marco Rubio Is “Totally Committed To Obama’s Immigration Agenda” https://t.co/yieqFMRxwH DonaldTrump"},{"text":"\"@wakeupfla: Please stand up for American Hispanic families and fight illegal immigration it is destroying USA! https://t.co/AKZO4lTnLj\""},{"text":"\"@Mr_Holtzworth: @realDonaldTrump Sarah Palin Defends Donald Trump's Immigration Plan On Fox News https://t.co/IhaCiY07US via @YouTube\""},{"text":"Marco Rubio will not win. Weak on illegal immigration, strong on amnesty and has the appearance to killers of the world as a \"lightweight\"."},{"text":"Anybody that believes in strong borders and stopping illegal immigration cannot vote for Marco Rubio  READ THIS: https://t.co/Tj85IsBPG8\""},{"text":"Further proof that Gang of Eight member Marco Rubio is weak on illegal immigration is Paul Singer's, Mr. Amnesty, endorsement.Rubs can't win"},{"text":"\"@Biracial_Chick: Trump Rights Ship on Immigration: Demands Disney Rehire Workers Replaced by Cheap Foreign Labor. https://t.co/P69gvPCaR1\""},{"text":"\"@SteveBashino:  Trump good for legal immigration, economy, defense, taxes, Social Security, Medicare, 2nd Amendment, and ALL Americans.\""},{"text":"Remember that Carson, Bush and Rubio are VERY weak on illegal immigration. They will do NOTHING to stop it. Our country will be overrun!"},{"text":"I spell out some of the differences between Ben Carson and myself at 9:00 A.M. on @CNN @jaketapper. Ben is very weak on illegal immigration."},{"text":"\"@LandmanMarius: @realDonaldTrump AUSTRALIA SUPPORTS DONALD TRUMP. Please immigrate to Australia and make Aussie great as well.\" Cute!"},{"text":"\"@SweetFreedom29: Hey @realDonaldTrump --&gt; FLASHBACK: Jeb Bush Admitted ‘Leaky’ Immigration Led to 9/11 http://t.co/Jmm7wd32UD #tcot\"  WOW!"},{"text":"\"@AnnCoulter:He's right. Trump on 9/11 happening on Bush's watch: With my immigration policy, I doubt those ppl wld have been in the country"},{"text":"Notice that illegal immigrants will be given ObamaCare and free college tuition but nothing has been mentioned about our VETERANS #DemDebate"},{"text":"I watched lightweight Senator  Marco Rubio, who is all talk and no action, defend his WEAK position on illegal immigration. Pathetic!"},{"text":"Marco Rubio is a member of the Gang Of Eight or, very weak on stopping illegal immigration. Only changed when poll numbers crashed."},{"text":"Lightweight Senator Marco Rubio is VERY weak on immigration, knows nothing about finance and would be incapable of making great trade deals!"},{"text":".@MarcoRubio is weak on illegal immigration and will allow anyone into the country....."},{"text":"\"@john_dipaolo: @realDonaldTrump will get out disaffected Repub base voters as well as Democrats looking for a real choice on immigration."},{"text":"\"@97Musick: @AC360 @CNN The \"sold to lobbyists\" candidates are wasting their money. ON the BORDER and IMMIGRATION, Trump WILL win.\""},{"text":".@megynkelly must have had a terrible vacation, she is really off her game. Was afraid to confront Dr. Cornel West. No clue on immigration!"},{"text":"Jeb Bush is weak on illegal immigration, in favor of common core, bad on women's health issues and thinks the Iraq war was a good thing."},{"text":"Now that I started my war on illegal immigration and securing the border, most other candidates are finally  speaking up. Just politicians!"},{"text":"How crazy - 7.5% of all births in U.S. are to illegal immigrants, over 300,000 babies per year. This must stop. Unaffordable and not right!"},{"text":"\"@PrimMrs: @Rockprincess818 The best Immigration Policy yet! Time for @realDonaldTrump to #MakeAmericaGreatAgain\""},{"text":"\"@KNDetweiler: @hrkbenowen @thetimes @realDonaldTrump just released immigration plan is superior to everyone else's. Including Cruz."},{"text":"We must stop the crime and killing machine that is illegal immigration. Rampant problems will only get worse. Take back our country!"},{"text":"Again, illegal immigrant is charged with the fatal  bludgeoning of a wonderful and loved 64 year old woman. Get them out and build a WALL!"},{"text":"Isn’t it amazing that @Macys paid a massive fine for profiling African Americans--&amp; then criticized me for discussing illegal immigration!"},{"text":"\"@gpavlik7  1/2 of new California driver’s licenses go to undocumented immigrants. Read the Sac' Bee, July 17th. Go get'em, Trump!\""},{"text":"Good luck to my new friends on your testimony in DC. You are amazing people doing something so important--- stopping illegal immigration!"},{"text":"I will be interviewed on @oreillyfactor tonight at 8:00. Will be talking about the poor treatment of our veterans, illegal immigration, etc."},{"text":"\"@amit_ @realdonaldtrump I agree 100%. McCain is fighting for illegal immigrant but never did anything for our Vets.\""},{"text":"\"@RTMatador Trump says things that no one else would even consider saying, I agree with him on the immigration situation, i love honesty\""},{"text":"We will soon be at a point with our incompetent politicians where we will be treating illegal immigrants better than our veterans."},{"text":"John McCain called thousands of people \"crazies\" when they came to seek help on illegal immigration last week in Phoenix. He owes apology!"},{"text":"It's a national embarrassment that an illegal immigrant can walk across the border and receive free health care and one of our Veterans....."},{"text":"Via @AP March,2013: Jeb said “he was open to…pathway for citizenship for illegal immigrants” http://t.co/zeEKCFXroE Lying on campaign trail!"},{"text":"\"@danforc  as a legal immigrant I'm so glad someone standing up for us, the millions who do things by the book to earn our place here\" Thx"},{"text":"\"@LeeEllmauerJr: LEGAL Latino Immigrants talk to me in factories &amp; warehouses. Want to know why OBAMA to give AMNESTY? They did it RIGHT!\""},{"text":"I absolutely support Kate’s Law—in honor of the beautiful Kate Steinle who was gunned down in SF by an illegal immigrant."},{"text":"Rush Limbaugh: \"Trump Has Changed the Entire Debate on Immigration\" http://t.co/894aXjRXDn"},{"text":"Legal immigrants want border security. It is common sense. We must build a wall! Let's Make America Great Again! http://t.co/I5CybmR0MF"},{"text":"\"@WayneDupreeShow: Aren't U angry how the media has turned DonaldTrump SLAM against \"illegal immigration\" into him hating \"all immigrants"},{"text":"I'm on @CNN's @AC360 tonight @8pm &amp; @FoxNews' @seanhannity @ 10PM discussing immigration and lots of other things.#LetsMakeAmericaGreatAgain"},{"text":"“@limbaugh: 'Trump Has Changed the Entire Debate on Immigration'”\n  http://t.co/894aXjRXDn via @Newsmax_Media by Jason Devaney"},{"text":"\"@bdevil89: @krauthammer &amp; rest of pundits r scared of truth teller like @realDonaldTrump - #immigration affects everything in society."},{"text":"Via @DailyCaller by @samsondunn: “Pastor To Hispanic Congregation Speaks Out On Trump Immigrant Crime Statement” http://t.co/rfWcQ7wcjf"},{"text":"\"@greta just read @realDonaldTrump going to Phoenix to give speech on illegal immigration on Saturday\" That is correct. I look forward to it"},{"text":"\"@DanScavino Illegal Immigrant Deported 6 Times Charged in Felony Hit &amp; Run of Family. @realDonaldTrump is not wrong. #Trump2016\""},{"text":"Thx to all the people who called to say they are cutting their @Macys credit card as a protest against illegal immigrants pouring into US"},{"text":"Flashback – Jeb Bush says  illegal immigrants breaking our laws is an “act of love” http://t.co/p8yFzVuw8w He will never secure the border."},{"text":"Rick Perry failed at the border. Now he is critical of me. He needs a new pair of glasses to see the crimes committed by illegal immigrants."},{"text":"Miss Universe, Paulina Vega, criticized me for telling the truth about illegal immigration, but then said she would keep the crown-Hypocrite"},{"text":"\"@VeneziaMatthew: Trump is the only real candidate. He is only saying what we all know. Much crime comes from illegal immigrants. Fact!\""},{"text":"\"@nanaelaine7: I can't wait for your inauguration!! The beginning of the end to these criminal immigrants. MAKE AMERICA GREAT AGAIN\" Thanks."},{"text":"What about the undocumented immigrant with a record who killed the beautiful young women (in front of her father) in San Fran. Get smart!"},{"text":"\"@myGianLuca:  @CNNPolitics @teddyschleifer Say it LOUD &amp; PROUD @realDonaldTrump! *** ILLEGAL IMMIGRATION *** Is an Attack on Our Country!\""},{"text":"\"@CNNPolitics: Trump: San Francisco killing shows perils of illegal immigration http://t.co/aiBnAOhYup (via @TeddySchleifer)\""},{"text":"Via @CNNPolitics by @teddyschleifer: \"Trump: San Francisco killing shows perils of illegal immigration\" http://t.co/WJ872PRCO5"},{"text":"\"@babyylissa: Obama calls immigrants gang bangers&amp;criminals but Trump gets attacked for calling SOME illegals from SOME countries bad people"},{"text":"\"@Highlander6700: @realDonaldTrump @Macys: Seems 1 or 2 lines of Mr. Trump's comments about immigrants are continuously taken out of context"},{"text":"“TRUMP DECLARES VICTORY ON IMMIGRATION AS OBAMA ADMITS SOME ILLEGALS ARE ‘GANG BANGERS’” http://t.co/e0HLxf1dS2 via @BreitbartNews @ASwoyer"},{"text":"Make our borders strong and stop illegal immigration. Even President Obama agrees- https://t.co/OcKfUFgSPU"},{"text":"For all of those who want to #MakeAmericaGreatAgain, boycott @Macys. They are weak on border security &amp; stopping illegal immigration."},{"text":"Those who believe in tight border security, stopping illegal immigration &amp;  SMART trade deals w/other countries should boycott @Macys."},{"text":"My recent statement re: @macys -- We must have strong borders &amp; stop illegal immigration now!… https://t.co/HLCboRmTbl"},{"text":"We MUST have strong borders and stop illegal immigration. Without that we do not have a country. Also, Mexico is killing U.S. on trade. WIN!"},{"text":"\"@TheHolyBreadcat: @realDonaldTrump Vote for Trump, he's making America to where we won't worry about illegal immigrant problems.\""},{"text":"\"@imprimis310: @NBC is the bigot. @realDonaldTrump and @SenTedCruz only speaking the truth about ILLEGAL immigrants\""},{"text":"\"@Robby_Moreira: @realDonaldTrump If you became President we would immigrate to the United States of America. For sure!\" Nice."},{"text":"Via @BreitbartNews: \"DONALD TRUMP: EXEC AMNESTY WILL MAKE ILLEGAL IMMIGRATION ‘WORSE THAN IT’S EVER BEEN\" http://t.co/3AwAAXAEIs"},{"text":"\"@seankesser: @realDonaldTrump People with bachelor's degrees can't find jobs in #US. And Obama wants to bring in more immigrants.\""},{"text":"Fact – Amnesty lowers wages and invites more lawlessness. Obama has unilaterally cancelled any chance of immigration reform."},{"text":"\"@Mitchwa: @realDonaldTrump What a great night for the good guys. I'm worried about Obama using executive power to pass immigration law\""},{"text":"Crazy - Election officials saying that there is nothing stopping illegal immigrants from voting. This is very bad (unfair) for Republicans!"},{"text":"Via @BreitbartNews by @j_strong: “Obama Administration Quietly Prepares ‘Surge of Millions’ of New Immigrant Ids” http://t.co/SIOY6r3REc"},{"text":"Our government now imports illegal immigrants and deadly diseases. Our leaders are inept."},{"text":"Watch – Obama will not fix the illegal immigrant loophole. Instead he will sign another executive action giving more amnesty."},{"text":"Central American presidents are blaming us for the influx of illegal immigration http://t.co/JCUSwrR8k6  Obama will soon apologize."},{"text":"Less than 1% of Obama’s $4B immigration request will go towards immediate border security. A real scam. Enforce our laws now!"},{"text":"“Trump: Illegal Immigrants Are Getting Treated Better than Vets” http://t.co/rYy1nnSRDp \n  via @nro by @AndrewE_Johnson"},{"text":"Our gov’t should immediately stop sending $’s to Mexico, no friend, until they release Marine &amp; stop allowing immigrant inflow into U.S."},{"text":"The immigration crisis is a horrible mess made worse by an incompetent president who doesn't have a clue. We need new leadership FAST!"},{"text":"\"@chargermike41:  @BackOnTrackUSA wtf. Free to the immigrants? But the rest of us that have to bust out asses just to get by have to pay?\""},{"text":"Your tax dollars well spent. Over 1.295M ObamaCare enrollees will also be illegal immigrants http://t.co/VE85kBl3VT  Are you surprised?"},{"text":"Another cover-up. Obama won’t disclose how many illegal immigrants he has released into our country http://t.co/h8WhM3htvF No surprise."},{"text":"It would be nice if our commander-in-chief was as concerned for our Veterans health as he is for illegal immigrants becoming citizens."},{"text":"30,000 illegal immigrants with CRIMINAL RECORDS were released last year by our wonderful, though highly incompetent, government. So stupid!"},{"text":"My @NewsRadio967 interview re Jeb Bush's absurd immigration comment &amp; @Citizens_United @AFPhq Freedom Summit.   http://t.co/fBvmHgAviU"},{"text":"Congress must protect our borders first. Amnesty should be done only if the border is secure and illegal immigration has stopped."},{"text":"According to @pewresearch, illegal immigrants favor Dems 8:1 http://t.co/ZN4rOIFVzA @GOP pushing amnesty. Do they have death wish"},{"text":"Great read by @VDHanson: “Mexico's Hypocrisy Is Evident In Its Own Strict Policy Toward Immigrants” http://t.co/OfmzjKk6x7"},{"text":"“TRUMP: IMMIGRATION BILL A REPUBLICAN 'DEATH WISH'” http://t.co/BuAooKSHjl via @BreitbartNews by @mboyle1"},{"text":"MUST READ ARTICLE: “Immigration reform could be bonanza for Democrats” http://t.co/M5yCKpoMB2 Are the @RNC &amp; @GOP suicidal?"},{"text":"In light of Boston, immigration legislation will be much harder to get."},{"text":"Now AP is banning the term \"illegal immigrants\" What should we call them? 'Americans'?! This country's political press is amazing!"},{"text":"Immigration reform is all risk for the @GOP. Their base doesn’t want it and the 12M illegals will all vote Democrat."},{"text":"Via @thehill: \"Trump warns GOP moving too fast on immigration reform\" http://t.co/BW5LGUglDc  by @JonEasley"},{"text":"\"‘Better Be Careful’:Donald Trump Warns GOP On Immigration, Creating ’12 Million’ New Dem Voters\" http://t.co/omz1wUYtCX via @Mediaite"},{"text":"My @foxandfriends interview on risk  for @GOP on immigration, wasting money in Middle East &amp; firing @OMAROSA  http://t.co/Cp5lkJpz2A"},{"text":"According to @pewresearch, 2/3 of Mexican LEGAL immigrants do not pursue citizenship because of ‘no interest’ http://t.co/Vfias8bxlo"},{"text":"Be weak on immigration and ensure Democratic victory."},{"text":"New @RNC report calls for embracing “comprehensive immigration reform.” http://t.co/0kOuA0ttCJ Does the @RNC have a death wish?"},{"text":"\"CPAC 2013: Donald Trump: Immigration reform is a ‘suicide mission’ for GOP\" http://t.co/WdMLJcXZLL by @SethMcLaughlin1"},{"text":"Republicans must be careful with immigration—don’t give our country away."},{"text":"John McCain had a really hard time with his town hall meeting on immigration. They really went after him!"},{"text":"No surprise, with the talk of amnesty in DC, illegal immigration is picking up in Arizona http://t.co/eYAeRve4"},{"text":".@GOP need to face reality – not one of the illegal immigrants granted amnesty will vote Republican."},{"text":"Just as I predicted, immigration reform will increase the cost of ObamaCare over $300B http://t.co/CmDQ20a2 More money borrowed from China."},{"text":"Immigration reform really changes the voting scales for the Republicans—for the worse!"},{"text":"Re: immigration. Do the Republicans not realize that Dems will get 100% of 11 million votes no matter what they do?"},{"text":"Again, immigration reform is fine—but don’t rush to give away our country. That’s what’s happening!"},{"text":"Immigration reform is fine—but don’t rush to give away our country! Sounds like that’s what’s happening."},{"text":"The Republicans will get zero credit for passing immigration reform—and I said zero!"},{"text":"The Republicans must face reality &amp; create a strong &amp; positive immigration policy--if not they will continue to lose elections."},{"text":"Obama weak on immigration. All words, no action. He's been Prez 4 years."},{"text":"Today's announcement by @BarackObama on immigration was done for reelection. He is using the office of the presidency as a campaign tool."},{"text":"Don't be fooled. In 2008 @BarackObama promised immigration reform in his 1st yr of his 1st term. Now promising (cont) http://t.co/uQKNoHhv"},{"text":"\"The illegal immigrant crime problem is far more serious and threatening than most people understand. Along our (cont) http://t.co/UAAIAKdS"},{"text":"ObamaCare gives free insurance to illegal immigrants. Yet @BarackObama is cutting our troops healthcare.  (cont) http://t.co/SHQuYovw"},{"text":"Canada's legal immigration plan starts with a simple and smart question: How will any immigrant applying fo… (cont) http://t.co/aHYaJt5b"},{"text":"Illegal immigration is a wrecking ball aimed at US taxpayers. Washington needs to get tough and fight for \"W… (cont) http://t.co/tblJ9PWm"}]