[{"text":"Just had a long and very good talk with President Moon of South Korea. Things are going very well, time and location of meeting with North Korea is being set. Also spoke to Prime Minister Abe of Japan to inform him of the ongoing negotiations."},{"text":"Look forward to meeting with Chancellor Angela Merkel of Germany today. So much to discuss, so little time! It will be good for both of our great countries!"},{"text":"Please do not forget the great help that my good friend, President Xi of China, has given to the United States, particularly at the Border of North Korea. Without him it would have been a much longer, tougher, process!"},{"text":"After a furious year of missile launches and Nuclear testing, a historic meeting between North and South Korea is now taking place. Good things are happening, but only time will tell!"},{"text":"RT @realDonaldTrump: Democrats are obstructing good (hopefully great) people wanting to give up a big portion of their life to work for our…"},{"text":"Hard to believe Obstructionists May vote against Mike Pompeo for Secretary of State. The Dems will not approve hundreds of good people, including the Ambassador to Germany. They are maxing out the time on approval process for all, never happened before. Need more Republicans!"},{"text":"“I can die happy now with Trump Job performance,” stated Mary Matalin. “A great overall President, stunning!” Thank you Mary."},{"text":"“GOP Lawmakers asking Sessions to Investigate Comey and Hillary Clinton.” @FoxNews   Good luck with that request!"},{"text":"Just heard the Campaign was sued by the Obstructionist Democrats. This can be good news in that we will now counter for the DNC Server that they refused to give to the FBI, the Debbie Wasserman Schultz Servers and Documents held by the Pakistani mystery man and Clinton Emails."},{"text":"North Korea has agreed to suspend all Nuclear Tests and close up a major test site. This is very good news for North Korea and the World - big progress! Look forward to our Summit."},{"text":"Just heard the Campaign was sued by the Obstructionist Democrats. This can be good news in that we will now counter for the DNC Server that they refused to give to the FBI, the Wendy Wasserman Schultz Servers and Documents held by the Pakistani mystery man and Clinton Emails."},{"text":"Can you believe that despite 93% bad stories from the Fake News Media (should be getting good stories), today we had just about our highest Poll Numbers, including those on Election Day? The American public is wise to the phony an dishonest press. Make America Great Again!"},{"text":"Looks like OPEC is at it again. With record amounts of Oil all over the place, including the fully loaded ships at sea, Oil prices are artificially Very High! No good and will not be accepted!"},{"text":"...Hopefully the Senate will not leave Washington until our Ambassadors, Judges and the people who make Washington work are approved. The Democrats are Obstructing the process and we need these people approved for the good of our Country!"},{"text":"Democrats are obstructing good (hopefully great) people wanting to give up a big portion of their life to work for our Government, hence, the American People. They are “slow walking” all of my nominations - hundreds of people. At this rate it would take 9 years for all approvals!"},{"text":"Great meeting with Prime Minister Abe of Japan, who has just left Florida. Talked in depth about North Korea, Military and Trade. Good things will happen!"},{"text":"Mike Pompeo met with Kim Jong Un in North Korea last week. Meeting went very smoothly and a good relationship was formed. Details of Summit are being worked out now. Denuclearization will be a great thing for World, but also for North Korea!"},{"text":"There is a Revolution going on in California. Soooo many Sanctuary areas want OUT of this ridiculous, crime infested &amp; breeding concept. Jerry Brown is trying to back out of the National Guard at the Border, but the people of the State are not happy. Want Security &amp; Safety NOW!"},{"text":"RT @WaysandMeansGOP: Tomorrow is #TaxDay and the good news is this is the last year you will have to file using the old, broken code. Check…"},{"text":"Good luck to Mike Pompeo during his Confirmation Hearing today. He will be a great Secretary of State!"},{"text":"California Governor Jerry Brown is doing the right thing and sending the National Guard to the Border. Thank you Jerry, good move for the safety of our Country!"},{"text":"Speaker Paul Ryan is a truly good man, and while he will not be seeking re-election, he will leave a legacy of achievement that nobody can question. We are with you Paul!"},{"text":"The Washington Post is far more fiction than fact. Story after story is made up garbage - more like a poorly written novel than good reporting. Always quoting sources (not names), many of which don’t exist. Story on John Kelly isn’t true, just another hit job!"},{"text":"The Washington Post is far more fiction than fact. Story after story is made up made garbage - more like a poorly written novel than good reporting. Always quoting sources (not names), many of which don’t exist. Story on John Kelly isn’t true...just another hit job!"},{"text":"What does the Department of Justice and FBI have to hide? Why aren’t they giving the strongly requested documents (unredacted) to the HOUSE JUDICIARY COMMITTEE? Stalling, but for what reason? Not looking good!"},{"text":"Congratulations to @bernieandsid on their new @77wabcradio morning radio show in New York City. It was an honor to join you two – good luck! https://t.co/sulTcRp3IC"},{"text":"HAPPY EASTER!"},{"text":"For years and through many administrations, everyone said that peace and the denuclearization of the Korean Peninsula was not even a small possibility. Now there is a good chance that Kim Jong Un will do what is right for his people and for humanity. Look forward to our meeting!"},{"text":"Trade talks going on with numerous countries that, for many years, have not treated the United States fairly. In the end, all will be happy!"},{"text":"The economy is looking really good. It has been many years that we have seen these kind of numbers. The underlying strength of companies has perhaps never been better."},{"text":"Happy National #MedalOfHonorDay to our HEROES. We love you! https://t.co/6euI31R4Gz"},{"text":"....lawyer or law firm will take months to get up to speed (if for no other reason than they can bill more), which is unfair to our great country - and I am very happy with my existing team. Besides, there was NO COLLUSION with Russia, except by Crooked Hillary and the Dems!"},{"text":"I called President Putin of Russia to congratulate him on his election victory (in past, Obama called him also). The Fake News Media is crazed because they wanted me to excoriate him. They are wrong! Getting along with Russia (and others) is a good thing, not a bad thing......."},{"text":"Happy #StPatricksDay https://t.co/4vVsW2smhB"},{"text":"It would be great for the Republican Party of Nevada, and it’s unity if good guy Danny Tarkanian would run for Congress and Dean Heller, who is doing a really good job, could run for Senate unopposed!"},{"text":"We do have a Trade Deficit with Canada, as we do with almost all countries (some of them massive). P.M. Justin Trudeau of Canada, a very good guy, doesn’t like saying that Canada has a Surplus vs. the U.S.(negotiating), but they do...they almost all do...and that’s how I know!"},{"text":"Hundreds of good people, including very important Ambassadors and Judges, are being blocked and/or slow walked by the Democrats in the Senate. Many important positions in Government are unfilled because of this obstruction. Worst in U.S. history!"},{"text":"The Democrats continue to Obstruct the confirmation of hundreds of good and talented people who are needed to run our government...A record in U.S. history. State Department, Ambassadors and many others are being slow walked. Senate must approve NOW!"},{"text":"The Failing New York Times purposely wrote a false story stating that I am unhappy with my legal team on the Russia case and am going to add another lawyer to help out. Wrong. I am VERY happy with my lawyers, John Dowd, Ty Cobb and Jay Sekulow. They are doing a great job and....."},{"text":"Heading to Moon Township, Pennsylvania, to be with a really good person, State Representative Rick Saccone, who is running for Congress. Big &amp; happy crowd (why not, some of the best economic numbers ever). Rick will help me a lot. Also, tough on crime &amp; border. Loves 2nd A &amp; VETS"},{"text":"The deal with North Korea is very much in the making and will be, if completed, a very good one for the World. Time and place to be determined."},{"text":"Happy #InternationalWomensDay\n\n“First Lady Melania Trump to Present the 2018 International Women of Courage Award” https://t.co/EwYtFXGvn2"},{"text":"China has been asked to develop a plan for the year of a One Billion Dollar reduction in their massive Trade Deficit with the United States. Our relationship with China has been a very good one, and we look forward to seeing what ideas they come back with. We must act soon!"},{"text":"Happy National Anthem Day! https://t.co/cf1eugMbKU"},{"text":"When a country (USA) is losing many billions of dollars on trade with virtually every country it does business with, trade wars are good, and easy to win. Example, when we are down $100 billion with a certain country and they get cute, don’t trade anymore-we win big. It’s easy!"},{"text":"Good (Great) meeting in the Oval Office tonight with the NRA!"},{"text":"Many ideas, some good &amp; some not so good, emerged from our bipartisan meeting on school safety yesterday at the White House. Background Checks a big part of conversation. Gun free zones are proven targets of killers. After many years, a Bill should emerge. Respect 2nd Amendment!"},{"text":"“He’s got a very good point. Somebody in the Justice Department has a treasure trove of evidence of Mrs. Clinton’s criminality at her own hands, or through others, that ought to be investigated. I fully agree with the President on that.” @judgenapolitano on @marthamaccallum Show"},{"text":"Dems are no longer talking DACA! “Out of sight, out of mind,” they say. DACA beneficiaries should not be happy. Nancy Pelosi truly doesn’t care about them. Republicans stand ready to make a deal!"},{"text":"The U.S. economy is looking very good, in my opinion, even better than anticipated. Companies are pouring back into our country, reversing the long term trend of leaving. The unemployment numbers are looking great, and Regulations &amp; Taxes have been massively Cut! JOBS, JOBS, JOBS"},{"text":"“Charges Deal Don A Big Win,” written by Michael Goodwin of the @nypost, succinctly states that “the Russians had no impact on the election results.” There was no Collusion with the Trump Campaign. “She lost the old-fashioned way, by being a terrible candidate. Case closed.”"},{"text":"In the “old days,” when good news was reported, the Stock Market would go up. Today, when good news is reported, the Stock Market goes down. Big mistake, and we have so much good (great) news about the economy!"},{"text":"HAPPY BIRTHDAY to our 40th President of the United States of America, Ronald Reagan! https://t.co/JtEglBhm4c"},{"text":"The Democrats are turning down services and security for citizens in favor of services and security for non-citizens. Not good!"},{"text":"Thank you to Brad Blakeman on @FoxNews for grading year one of my presidency with an “A”-and likewise to Doug Schoen for the very good grade and statements. Working hard!"},{"text":"The Trump Administration has terminated more UNNECESSARY Regulation, in just twelve months, than any other Administration has terminated during their full term in office, no matter what the length. The good news is, THERE IS MUCH MORE TO COME!"},{"text":"Not looking good for our great Military or Safety &amp; Security on the very dangerous Southern Border. Dems want a Shutdown in order to help diminish the great success of the Tax Cuts, and what they are doing for our booming economy."},{"text":"Despite some very corrupt and dishonest media coverage, there are many great reporters I respect and lots of GOOD NEWS for the American people to be proud of!"},{"text":"The Wall Street Journal stated falsely that I said to them “I have a good relationship with Kim Jong Un” (of N. Korea). Obviously I didn’t say that. I said “I’d have a good relationship with Kim Jong Un,” a big difference. Fortunately we now record conversations with reporters..."},{"text":"Chrysler is moving a massive plant from Mexico to Michigan, reversing a years long opposite trend. Thank you Chrysler, a very wise decision. The voters in Michigan are very happy they voted for Trump/Pence. Plenty of more to follow!"},{"text":"In new Quinnipiac Poll, 66% of people feel the economy is “Excellent or Good.” That is the highest number ever recorded by this poll."},{"text":"Good news: Toyota and Mazda announce giant new Huntsville, Alabama, plant which will produce over 300,000 cars and SUV’s a year and employ 4000 people. Companies are coming back to the U.S. in a very big way. Congratulations Alabama!"},{"text":"HAPPY NEW YEAR! We are MAKING AMERICA GREAT AGAIN, and much faster than anyone thought possible!"},{"text":"As our Country rapidly grows stronger and smarter, I want to wish all of my friends, supporters, enemies, haters, and even the very dishonest Fake News Media, a Happy and Healthy New Year. 2018 will be a great year for America!"},{"text":"Iran, the Number One State of Sponsored Terror with numerous violations of Human Rights occurring on an hourly basis, has now closed down the Internet so that peaceful demonstrators cannot communicate. Not good!"},{"text":"What a year it’s been, and we're just getting started. Together, we are MAKING AMERICA GREAT AGAIN! Happy New Year!! https://t.co/qsMNyN1UJG"},{"text":"The entire world understands that the good people of Iran want change, and, other than the vast military power of the United States, that Iran’s people are what their leaders fear the most.... https://t.co/W8rKN9B6RT"},{"text":"In the East, it could be the COLDEST New Year’s Eve on record. Perhaps we could use a little bit of that good old Global Warming that our Country, but not other countries, was going to pay TRILLIONS OF DOLLARS to protect against. Bundle up!"},{"text":"All signs are that business is looking really good for next year, only to be helped further by our Tax Cut Bill. Will be a great year for Companies and JOBS! Stock Market is poised for another year of SUCCESS!"},{"text":"Remember, the Republicans are 5-0 in Congressional races this year. In Senate, I said Roy M would lose in Alabama and supported Big Luther Strange - and Roy lost. Virginia candidate was not a “Trumper,” and he lost.  Good Republican candidates will win BIG!"},{"text":"At some point, and for the good of the country, I predict we will start working with the Democrats in a Bipartisan fashion. Infrastructure would be a perfect place to start. After having foolishly spent $7 trillion in the Middle East, it is time to start rebuilding our country!"},{"text":"Republican Tax Cuts are looking very good. All are working hard. In the meantime, the Stock Market hit another record high!"},{"text":"Wishing all of those celebrating #Hanukkah around the world a happy and healthy eight nights in the company of those they love. https://t.co/A5W0PDWBxp https://t.co/D9MVVPq39x"},{"text":"Consumer Confidence is at an All-Time High, along with a Record High Stock Market. Unemployment is at a 17 year low. MAKE AMERICA GREAT AGAIN! Working to pass MASSIVE TAX CUTS (looking good)."},{"text":"Things are going really well for our economy, a subject the Fake News spends as little time as possible discussing! Stock Market hit another RECORD HIGH, unemployment is now at a 17 year low and companies are coming back into the USA. Really good news, and much more to come!"},{"text":"Tonight, @FLOTUS Melania and I were thrilled to welcome so many wonderful friends to the @WhiteHouse – and wish them all a very #HappyHanukkah\nhttps://t.co/wyPkpTsP1i https://t.co/XhNXZSBEC8"},{"text":"Go get the new book on Andrew Jackson by Brian Kilmeade...Really good. @foxandfriends"},{"text":"Republicans Senators are working hard to pass the biggest Tax Cuts in the history of our Country. The Bill is getting better and better. This is a once in a generation chance. Obstructionist Dems trying to block because they think it is too good and will not be given the credit!"},{"text":"The only people who don’t like the Tax Cut Bill are the people that don’t understand it or the Obstructionist Democrats that know how really good it is and do not want the credit and success to go to the Republicans!"},{"text":"The good news is that their ratings are terrible, nobody cares! https://t.co/I7h4Ryin3h"},{"text":"Happy #SmallBusinessSaturday!\n\nA great day to support your community and America’s JOB creators by shopping locally at a #SmallBiz. #ShopSmall https://t.co/pBQaBHvl7k"},{"text":"Time Magazine called to say that I was PROBABLY going to be named “Man (Person) of the Year,” like last year, but I would have to agree to an interview and a major photo shoot. I said probably is no good and took a pass. Thanks anyway!"},{"text":"RT @DeptofDefense: #HappyThanksgiving from @USArmy and @USNationalGuard #soldiers serving with Task Force Marauder in #Afghanistan. 🦃 https…"},{"text":"My great honor to join our incredible men and women of the @USCG, at the Lake Worth Inlet Station, in Riviera Beach, Florida today!\n#HappyThanksgiving https://t.co/C35HR9opbP"},{"text":"HAPPY THANKSGIVING! https://t.co/nQhi7XopMW"},{"text":"HAPPY THANKSGIVING, your Country is starting to do really well. Jobs coming back, highest Stock Market EVER, Military getting really strong, we will build the WALL, V.A. taking care of our Vets, great Supreme Court Justice, RECORD CUT IN REGS, lowest unemployment in 17 years....!"},{"text":"Crooked Hillary Clinton is the worst (and biggest) loser of all time. She just can’t stop, which is so good for the Republican Party. Hillary, get on with your life and give it another try in three years!"},{"text":"...They should realize that these relationships are a good thing, not a bad thing. The U.S. is being respected again. Watch Trade!"},{"text":"Just arrived at #ASEAN50 in the Philippines for my final stop with World Leaders. Will lead to FAIR TRADE DEALS, unlike the horror shows from past Administrations. Will then be leaving for D.C. Made many good friends!"},{"text":"Happy to announce, I am nominating Alex Azar to be the next HHS Secretary. He will be a star for better healthcare and lower drug prices!"},{"text":"When will all the haters and fools out there realize that having a good relationship with Russia is a good thing, not a bad thing. There always playing politics - bad for our country. I want to solve North Korea, Syria, Ukraine, terrorism, and Russia can greatly help!"},{"text":"Met with President Putin of Russia who was at #APEC meetings. Good discussions on Syria. Hope for his help to solve, along with China the dangerous North Korea crisis. Progress being made."},{"text":"On behalf of an entire nation, Happy 242nd Birthday to the men and women of the United States Marines!\n#USMC242 #SemperFi https://t.co/ecgoSJP5Uc"},{"text":"Throughout my travels, I've had the pleasure of sharing the good news from America. I've had the honor of sharing our vision for a free &amp; open Indo-Pacific -- a place where sovereign &amp; independent nations, w/diverse cultures &amp; many different dreams, can all prosper side-by-side. https://t.co/qBOCY3u7YV"},{"text":"Franklin, such a great photo. \n\nHAPPY 99th BIRTHDAY to your father, @BillyGraham! https://t.co/l0c7RvvOa1"},{"text":"NYC terrorist was happy as he asked to hang ISIS flag in his hospital room. He killed 8 people, badly injured 12. SHOULD GET DEATH PENALTY!"},{"text":"Happy birthday to @garyplayer, a truly great Champion and Person!"},{"text":"Wishing everyone a safe and Happy Halloween!\n#Halloween2017 https://t.co/BRpgXVRI8Y"},{"text":"Happy #FirstRespondersDay to all of our HEROES out there. We are forever grateful to you for your service, sacrifice and courage 24/7/365! https://t.co/vOcTlyOeyw"},{"text":"Happy Birthday @TheLeeGreenwood!\n#FlashbackFriday https://t.co/MCrMK6Eurm"},{"text":"Happy birthday to the great @TheLeeGreenwood. You and your beautiful song have made such a difference. MAKE AMERICA GREAT AGAIN!"},{"text":"Happy birthday to the great @leegreenwood83. You and your beautiful song have made such a difference. MAKE AMERICA GREAT AGAIN!"},{"text":"Good luck to @Joy_Villa on her decision to enter the wonderful world of politics. She has many fans!"},{"text":"Congrats to @Reince Priebus, a really good and talented man. We’re proud of you Reince! https://t.co/7AsjAMrSnV"},{"text":"Stock Market just hit another record high! Jobs looking very good."},{"text":"Just out report: \"United Kingdom crime rises 13% annually amid spread of Radical Islamic terror.\" Not good, we must keep America safe!"},{"text":"The Democrats only want to increase taxes and obstruct. That's all they are good at!"},{"text":"I have no greater privilege than to serve as your Commander-in-Chief. HAPPY BIRTHDAY to the incredible men and women @USNavy!\n#242NavyBday https://t.co/qcdB4U8CqA"},{"text":"Happy #NationalFarmersDay!\n📸https://t.co/dN39R1IMlA https://t.co/QbUG1pztaI"},{"text":"In even the darkest moments, the light of our people has shown through their goodness, their courage and their love. #USA🇺🇸 https://t.co/8JK8aM2a1L"},{"text":"RT @realDonaldTrump: Happy to announce we are awarding $1M to Las Vegas - in order to help local law enforcement working OT to respond to l…"},{"text":"Happy to announce we are awarding $1M to Las Vegas - in order to help local law enforcement working OT to respond to last Sunday’s tragedy."},{"text":"It is about time that Roger Goodell of the NFL is finally demanding that all players STAND for our great National Anthem-RESPECT OUR COUNTRY"},{"text":"Highly respected author, Christopher Bedford, just came out with book, \"The Art of the Donald, Lessons from America's....\" Really good book!"},{"text":".@NBCNews is so knowingly inaccurate with their reporting. The good news is that the PEOPLE get it, which is really all that matters! Not #1"},{"text":"Can't believe I finally got a good story in the @washingtonpost. It discusses the enthusiasm of \"Trump\" voters through campaign...."},{"text":"NBC news is #FakeNews and more dishonest than even CNN. They are a disgrace to good reporting. No wonder their news ratings are way down!"},{"text":"RT @Jenniffer2012: Thank you @realDonaldTrump for all the help you are providing for Puerto Rico. We’re are grateful and happy to welcome y…"},{"text":"RT @billoreilly: Hannity crushing MSNBC at 9. Good for him! Check the No Spin News on https://t.co/rryWmyXe7C. Killing England a huge bests…"},{"text":"Congratulations to Roy Moore on his Republican Primary win in Alabama. Luther Strange started way back &amp; ran a good race. Roy, WIN in Dec!"},{"text":"Congratulations to Roy Moore on his Republican Primary win in Alabama. Luther Strange started way back &amp; ran a good race. Roy, WIN in Nov!"},{"text":"Great solidarity for our National Anthem and for our Country. Standing with locked arms is good, kneeling is not acceptable. Bad ratings!"},{"text":"Roger Goodell of NFL just put out a statement trying to justify the total disrespect certain players show to our country.Tell them to stand!"},{"text":"I know Rand Paul and I think he may find a way to get there for the good of the Party!"},{"text":"Large Block Grants to States is a good thing to do. Better control &amp;  management. Great for Arizona. McCain let his best friend L.G. down!"},{"text":"Arizona had a 116% increase in ObamaCare premiums last year, with deductibles very high. Chuck Schumer sold John McCain a bill of goods. Sad"},{"text":"Big day at the United Nations - many good things, and some tricky ones, happening. We have a great team. Big speech at 10:00 A.M."},{"text":"Such an honor to have my good friend, Israel PM @Netanyahu, join us w/ his delegation in NYC this afternoon. #UNGA https://t.co/YEHWjdtQx8 https://t.co/jwU4e8Yk8A"},{"text":"Happy 70th Birthday @CIA! https://t.co/CU3gOZMf7J"},{"text":"Happy 70th Birthday @USAirForce! https://t.co/snkXO40vXM"},{"text":"A great deal of good things happening for our country. Jobs and Stock Market at all time highs, and I believe will be getting even better!"},{"text":"HAPPY 70th BIRTHDAY to the @USAirForce! The American people are eternally grateful. Thank you for keeping America PROUD, STRONG and FREE! https://t.co/DYxkh3gj0R"},{"text":"Does anybody really want to throw out good, educated and accomplished young people who have jobs, some serving in the military? Really!....."},{"text":"Watching Hurricane closely. My team, which has done, and is doing, such a good job in Texas, is already in Florida. No rest for the weary!"},{"text":"We are building our future with American hands, American labor, American iron, aluminum and steel. Happy #LaborDay! https://t.co/lyvtNfQ5IO"},{"text":"RT @TheFive: \"Trump just won on law &amp; order and now he's delivering the goods.\" -@jessebwatters #thefive"},{"text":"Many people are now saying that this is the worst storm/hurricane they have ever seen. Good news is that we have great talent on the ground."},{"text":".@ChuckGrassley - got your message loud and clear. We have fantastic people on the ground, got there long before #Harvey. So far, so good!"},{"text":"Strange statement by Bob Corker considering that he is constantly asking me whether or not he should run again in '18. Tennessee not happy!"},{"text":"RT @marcorubio: Good #AfghanStrategy &amp; excellent speech by @POTUS laying it out to the nation."},{"text":"Feels good to be home after seven months, but the White House is very special, there is no place like it... and the U.S. is really my home!"},{"text":"Just completed call with President Moon of South Korea. Very happy and impressed with 15-0 United Nations vote on North Korea sanctions."},{"text":"No matter the mission, the brave men &amp; women of our @USCG proudly answer the call to serve 24/7/365. THANK YOU and HAPPY BIRTHDAY! #CG227🇺🇸 https://t.co/GY555t0vzN"},{"text":"Consumer confidence is at a 16 year high....and for good reason. Much more regulation \"busting\" to come. Working hard on tax cuts &amp; reform!"},{"text":"...Even though parts of healthcare could pass at 51, some really good things need 60. So many great future bills &amp; budgets need 60 votes...."},{"text":"To every PATRIOT who will serve on the #USSGeraldRFord:\n☑️Keep the watch🇺🇸\n☑️Protect her🇺🇸\n☑️Defend her🇺🇸\n☑️LOVE HER🇺🇸\nGood Luck &amp; Godspeed! https://t.co/shcz5GQkCh"},{"text":"A ship is only as good as the people who serve on it — and the AMERICAN SAILOR is the BEST in the world. @USNavy #USSGeraldRFord https://t.co/YmiTLXcCEh"},{"text":"The Republicans never discuss how good their healthcare bill is, &amp; it will get even better at lunchtime.The Dems scream death as OCare dies!"},{"text":"Just got to the #USWomensOpen in Bedminster, New Jersey. People are really happy with record high stock market - up over 17% since election!"},{"text":"Stock Market hit another all-time high yesterday - despite the Russian hoax story! Also, jobs numbers are starting to look very good!"},{"text":"Stock market hits another high with spirit and enthusiasm so positive. Jobs outlook looking very good! #MAGA🇺🇸 https://t.co/Vwxsb2vWGe"},{"text":"My son Donald did a good job last night. He was open, transparent and innocent. This is the greatest Witch Hunt in political history. Sad!"},{"text":"Syrian ceasefire seems to be holding. Many lives can be saved. Came out of meeting. Good!"},{"text":"#HappyIndependenceDay #USA🇺🇸 https://t.co/9pfqnRsh1Z"},{"text":"Getting ready to celebrate the 4th of July with a big crowd at the White House. Happy 4th to everyone. Our country will grow and prosper!"},{"text":"#HappyIndependenceDay \n#July4 #USA🇺🇸 https://t.co/NsFslPEFrp"},{"text":"Happy Canada Day to all of the great people of Canada and to your Prime Minister and my new found friend @JustinTrudeau. #Canada150"},{"text":"Just finished a very good meeting with the President of South Korea. Many subjects discussed including North Korea and new trade deal!"},{"text":"Good news out of the House with the passing of 'No Sanctuary for Criminals Act.' Hopefully Senate will follow."},{"text":"Good news, House just passed #KatesLaw. Hopefully Senate will follow."},{"text":"New Sugar deal negotiated with Mexico is a very good one for both Mexico and the U.S. Had no deal for many years which hurt U.S. badly."},{"text":"RT @ericbolling: Good morning friends!  \"The Swamp\" out today.  President Trump has a copy... get yours here https://t.co/TntLPNCCjR. #maga…"},{"text":"...and did not want to \"rock the boat.\" He didn't \"choke,\" he colluded or obstructed, and it did the Dems and Crooked Hillary no good."},{"text":"RT @SheriffClarke: Happy Father's Day to all dads. My dad. Like father, like son, @realDonaldTrump supporters to the end. He an Airborne Ra…"},{"text":"RT @joegooding: What's happening in our country isn't just an assault on our @POTUS @realDonaldTrump it's an assault on the American people…"},{"text":"The Dems want to stop tax cuts, good healthcare and Border Security.Their ObamaCare is dead with 100% increases in P's. Vote now for Karen H"},{"text":"RT @WhiteHouse: Happy Father's Day! https://t.co/32tFoVa4Ov"},{"text":"Back from Miami where my Cuban/American friends are very happy with what I signed today. Another campaign promise that I did not forget!"},{"text":"Happy birthday to U.S. ARMY and our soldiers. Thank you for your bravery, sacrifices, &amp; dedication. Proud to be your Commander-in-Chief!"},{"text":"RT @Corrynmb: @realDonaldTrump Liberals have an agenda and it's not in America's best interest. Keep fighting the good fight! We stand with…"},{"text":"So good to see the Saudi Arabia visit with the King and 50 countries already paying off. They said they would take a hard line on funding..."},{"text":"Hopefully Republican Senators, good people all, can quickly get together and pass a new (repeal &amp; replace) HEALTHCARE bill. Add saved $'s."},{"text":"Wishing @FLOTUS Melania and all of the great mothers out there a wonderful day ahead with family and friends! \n\nHappy #MothersDay"},{"text":"Today, I welcomed the Victory Christian Center School. Good luck @ the Team America Rocketry Challenge! #TARC Watch… https://t.co/wFrRsK2wuo"},{"text":"Sally Yates made the fake media extremely unhappy today --- she said nothing but old news!"},{"text":"...allegations of unmasking Trump transition officials. Not good!"},{"text":"either elect more Republican Senators in 2018 or change the rules now to 51%. Our country needs a good \"shutdown\" in September to fix mess!"},{"text":"...subject to the fact that if we do not reach a fair deal for all, we will then terminate NAFTA. Relationships are good-deal very possible!"},{"text":"HAPPY BIRTHDAY to our @FLOTUS, Melania! \nhttps://t.co/rYYp51mxDQ https://t.co/np7KYHglSv"},{"text":"New polls out today are very good considering that much of the media is FAKE and almost always negative. Would still beat Hillary in ....."},{"text":"Happy Easter to everyone!"},{"text":"Had a very good call last night with the President of China concerning the menace of North Korea."},{"text":"Happy Passover to everyone celebrating in the United States of America, Israel, and around the world. #ChagSameach"},{"text":"...goodwill and friendship was formed, but only time will tell on trade."},{"text":"...use subsidies to buy health plans.\" In other words, Ocare is dead. Good things will happen, however, either with Republicans or Dems."},{"text":"The Democrats will make a deal with me on healthcare as soon as ObamaCare folds - not long. Do not worry, we are in very  good shape!"},{"text":"Happy #MedalOfHonorDay to our heroes! ➡️https://t.co/juAB1RmMh0 https://t.co/Sw5ea1OwUf"},{"text":"Congratulations Eric &amp; Lara. Very proud and happy for the two of you! https://t.co/s0T3cTQc40"},{"text":"Happy Lá Fheile Phadraig to all of my great Irish friends!"},{"text":"I'd bet a good lawyer could make a great case out of the fact that President Obama was tapping my phones in October, just prior to Election!"},{"text":"HAPPY PRESIDENTS DAY - MAKE AMERICA GREAT AGAIN!"},{"text":"Thank you for all of the nice statements on the Press Conference yesterday. Rush Limbaugh said one of greatest ever. Fake media not happy!"},{"text":"A working dinner tonight with Prime Minister Abe of Japan, and his representatives, at the Winter White House (Mar-a-Lago). Very good talks!"},{"text":"The judge opens up our country to potential terrorists and others that do not have our best interests at heart. Bad people are very happy!"},{"text":"Meeting with biggest business leaders this morning. Good jobs are coming back to U.S., health care and tax bills are being crafted NOW!"},{"text":"Hope you like my nomination of Judge Neil Gorsuch for the United States Supreme Court. He is a good and brilliant man, respected by all."},{"text":"Wow, television ratings just out: 31 million people watched the Inauguration, 11 million more than the very good ratings from 4 years ago!"},{"text":"\"@drgoodspine: @realDonaldTrump @Ivanka Trump is great, a woman with real character and class.\""},{"text":"much worse - just look at Syria (red line), Crimea, Ukraine and the build-up of Russian nukes. Not good! Was this the leaker of Fake News?"},{"text":"All of my Cabinet nominee are looking good and doing a great job. I want them to be themselves and express their own thoughts, not mine!"},{"text":"Having a good relationship with Russia is a good thing, not a bad thing. Only \"stupid\" people, or fools, would think that it is bad! We....."},{"text":"Happy Birthday @EricTrump!\nhttps://t.co/bJaEY7qFSn"},{"text":"RT @IvankaTrump: 2016 has been one of the most eventful and exciting years of my life. I wish you peace, joy, love and laughter. Happy New…"},{"text":"RT @DonaldJTrumpJr: Happy new year everyone. #newyear #family #vacation #familytime https://t.co/u9fJIKNoZq"},{"text":"RT @Reince: Happy New Year + God's blessings to you all.  Looking forward to incredible things in 2017!  @realDonaldTrump will Make America…"},{"text":"RT @DanScavino: On behalf of our next #POTUS &amp; @TeamTrump-\n\n#HappyNewYear AMERICA🇺🇸\n\nhttps://t.co/Y6XDdijXea\nhttps://t.co/D8plL7xHql\nhttps:…"},{"text":"TO ALL AMERICANS-\n#HappyNewYear &amp; many blessings to you all! Looking forward to a wonderful &amp; prosperous 2017 as we… https://t.co/1asdMAL4iy"},{"text":"RT @realDonaldTrump: Happy Birthday @DonaldJTrumpJr!\nhttps://t.co/uRxyCD3hBz"},{"text":"Happy Birthday @DonaldJTrumpJr!\nhttps://t.co/uRxyCD3hBz"},{"text":"Happy New Year to all, including to my many enemies and those who have fought me and lost so badly they just don't know what to do. Love!"},{"text":"The United Nations has such great potential but right now it is just a club for people to get together, talk and have a good time. So sad!"},{"text":"Merry Christmas and a very, very, very , very Happy New Year to everyone!"},{"text":"Happy #Hanukkah https://t.co/UvZwtykV1E"},{"text":"If United Steelworkers 1999 was any good, they would have kept those jobs in Indiana. Spend more time working-less time talking. Reduce dues"},{"text":"Happy Thanksgiving to everyone. We will, together, MAKE AMERICA GREAT AGAIN!"},{"text":"Let us give thanks for all that we have, and let us boldly face the exciting new frontiers that lie ahead. Happy Th… https://t.co/RY9mGGjrXm"},{"text":"I have always had a good relationship with Chuck Schumer. He is far smarter than Harry R and has the ability to get things done. Good news!"},{"text":"The Theater must always be a safe and special place.The cast of Hamilton was very rude last night to a very good man, Mike Pence. Apologize!"},{"text":"A fantastic day in D.C. Met with President Obama for first time. Really good meeting, great chemistry. Melania liked Mrs. O a lot!"},{"text":"Happy 241st birthday to the U.S. Marine Corps! Thank you for your service!! https://t.co/Lz2dhrXzo4"},{"text":".@DarrellIssa is a very good man. Help him win his congressional seat in California."},{"text":"A lot of call-ins about vote flipping at the voting booths in Texas. People are not happy. BIG lines. What is going on?"},{"text":"New polls are good because the media has deceived the public by putting women front and center with made-up stories and lies, and got caught"},{"text":"RT @TeamTrump: “Police officers are the BEST of us. Law enforcement in this country is a force for GOOD.\" - @mike_pence #VPDebate #BigLeagu…"},{"text":"\"@aldonturnaolco1: @FrankLuntz @marthamaccallum @realDonaldTrump good!!\""},{"text":"Both are looking good! Now we begin!"},{"text":"Wow, did you just hear Bill Clinton's statement on how bad ObamaCare is. Hillary not happy. As I have been saying, REPEAL AND REPLACE!"},{"text":"HAPPY BIRTHDAY - to the United States Air Force!! https://t.co/5Gwi1M5R2t"},{"text":"Heading to Colorado for a big rally. Massive crowd, great people! Will be there soon - the polls are looking good."},{"text":"Poll numbers are starting to look very good. Leading in Florida @CNN Arizona and big jump in Utah. All numbers rising, national way up. Wow!"},{"text":"\"@Brainykid2010: @shl @realDonaldTrump The ad was actually very good!\""},{"text":"\"@EyeCandyTMGayle: @realDonaldTrump please oh please take the CHARLOTTE NC speech ACROSS the swing states .... sooo powerful\"  Good!"},{"text":"Good luck #TeamUSA\n#OpeningCeremony #Rio2016 https://t.co/mS8qsQpJPh"},{"text":"Happy 226th Birthday to the United States Coast Guard. Thank you @USCG! #CoastGuardDay https://t.co/hr4O8Xgq2R"},{"text":"RT @mike_pence: Good morning! Join me in Lima, Ohio - tomorrow evening at 7pm. #MAGA\nTickets: https://t.co/sNfhyGeaAH"},{"text":"You have no idea what my strategy on ISIS is, and neither does ISIS (a good thing). Please get your facts straight - thanks. @megynkelly"},{"text":"Funny, if you listen to @FoxNews, the Democrats did not have a good day. If you listen to the other two, they are fawning. What a difference"},{"text":"Wow, the Republican Convention went so smoothly compared to the Dems total mess. But fear not, the dishonest media will find a good spinnnn!"},{"text":"The ratings for the Republican National Convention were very good, but for the final night, my speech, great. Thank you!"},{"text":"Good news is Melania's speech got more publicity than any in the history of politics especially if you believe that all press is good press!"},{"text":"Our country is totally divided and our enemies are watching. We are not looking good, we are not looking smart, we are not looking tough!"},{"text":"I am somewhat surprised that Bernie Sanders was not true to himself and his supporters. They are not happy that he is selling out!"},{"text":"Crime is out of control, and rapidly getting worse. Look what is going on in Chicago and our inner cities. Not good!"},{"text":"Happy 4th of July! #Trump2016 #AmericaFirst https://t.co/Ndb3AQrLtY https://t.co/YhHyQjwJW6"},{"text":"On Saturday a great man, Elie Wiesel, passed away.The world is a better place because of him and his belief that good can triumph over evil!"},{"text":"Just watched @meetthepress and how totally biased against me Chuck Todd, and the entire show, is against me.The good news-the people get it!"},{"text":".@TraceAdkins great job on FOX this morning. Keep up the good work!"},{"text":"Iron Mike Tyson was not asked to speak at the Convention though I'm sure he would do a good job if he was. The media makes everything up!"},{"text":"\"@vegas_sports: Good for @realDonaldTrump he's smart on business. Maybe If corporations weren't overtaxed they would stay. Voting for #Trump"},{"text":"The \"dirty\" poll done by @ABC @washingtonpost is a disgrace. Even they admit that many more Democrats were polled. Other polls were good."},{"text":"The @ABC poll sample is heavy on Democrats.  Very dishonest - why would they do that? Other polls good!"},{"text":"The opening of Trump Turnberry in Scotland was a big success. Good timing, I was here for BREXIT. Very exciting news conference today!"},{"text":"People very unhappy with Crooked Hillary and Obama on JOBS and SAFETY! Biggest trade deficit in many years! More attacks will follow Orlando"},{"text":"\"@VoteTrumpMAGA: The media attack on @realDonaldTrump is relentless. They are desperate. But, they keep #Trump in the news - a good thing."},{"text":"RT @realDonaldTrump: HAPPY 241st BIRTHDAY to the @USArmy! THANK YOU! https://t.co/mXsxkfcstC"},{"text":"HAPPY 241st BIRTHDAY to the @USArmy! THANK YOU! https://t.co/mXsxkfcstC"},{"text":"I am getting bad marks from certain pundits because I have a small campaign staff. But small is good, flexible, save money and number one!"},{"text":"\"@Crz4basball: @JudgeJeanine  @realDonaldTrump Looks like several legal Hispanics supporting Trump! They know he will be good for them too.\""},{"text":"\"@SCPioneer: @stockdaleism @JamesRosenFNC @FoxNews @realDonaldTrump Not for slackers! Happy w/courses I took.\" Thanks."},{"text":"So many veterans groups are beyond happy with all of the money I raised/gave! It was my great honor - they do an amazing job."},{"text":"So many great things happening - new poll numbers looking good! News conference at 11:00 A.M. today, Trump Tower!"},{"text":"If dummy Bill Kristol actually does get a spoiler to run as an Independent, say good bye to the Supreme Court!"},{"text":"Good news is that my campaign has perhaps more cash than any campaign in the history of politics- b/c I stand 100% behind everything we do."},{"text":"Bill O'Reilly doing a major special on @OreillyFactor tonight- @FoxNews at 8pmE. Watch it, should be good! #Trump2016"},{"text":"Crooked Hillary Clinton just can't close the deal with Bernie. I had to knock out 16 very good and smart candidates. Hillary doesn't have it"},{"text":"\"@PiperSul: Great speech tonight Mr.Trump! Good Luck in California! Thank you."},{"text":"Failing @NYTimes will always take a good story about me and make it bad. Every article is unfair and biased. Very sad!"},{"text":"\"@mai_Ttag:  Great interview! Happy you had a chance to show the other side of you. Never change, never forget you are our messenger!\""},{"text":"\"@gerriweth: @megynkelly @realDonaldTrump Made me feel good to hear you both so gracious. Great job\""},{"text":"\"@RichBooth6: @realDonaldTrump @CNN good interview Mr. Trump. You set the facts straight.\" Thank you."},{"text":".@drmoore  Russell Moore is truly a terrible representative of Evangelicals and all of the good they stand for. A nasty guy with no heart!"},{"text":"#HappyMothersDay! \nhttps://t.co/T35f2y5YxR https://t.co/BVSHiG2iPA"},{"text":"Happy #CincoDeMayo! The best taco bowls are made in Trump Tower Grill. I love Hispanics! https://t.co/ufoTeQd8yA https://t.co/k01Mc6CuDI"},{"text":"I will be interviewed on @TODAYshow and Good Morning America at 7:00 A.M."},{"text":".@KarlRove is a failed Jeb Bushy. Never says anything good &amp; never will, even after I beat Hillary. Shouldn't be on the air!"},{"text":"\"@AnnetteJeanne: I cried when they said you made a clean sweep of all 5 states. I was SO HAPPY! I really adore you Mr. Trump, so much.\""},{"text":"Lyin' Ted and Kasich are mathematically dead and totally desperate. Their donors &amp; special interest groups are not happy with them. Sad!"},{"text":"I am happy to hear how badly the @nytimes is doing. It is a seriously failing paper with readership which is way down. Becoming irrelevant!"},{"text":"I will be in Maryland this afternoon for a major rally. Things are looking good for Tuesday!"},{"text":"A very interesting piece, by a very good writer, @KirstenPowers of @USATODAY and @FoxNews. https://t.co/gLuMitRitg"},{"text":"I win a state in votes and then get non-representative delegates because they are offered all sorts of goodies by Cruz campaign. Bad system!"},{"text":"Wow, @Politico is in total disarray \nwith almost everybody quitting. Good\nnews -- bad, dishonest journalists! https://t.co/xTvGLDXY5O"},{"text":"Good morning Wisconsin! The polls are now open! #VoteTrump today &amp; we will MakeAmericaGreatAgain! https://t.co/cXvX5SCF3c"},{"text":"I will be interviewed on @foxandfriends at 7:30. Things are looking good, had a great Easter-look forward to spending the week in Wisconsin!"},{"text":"Happy Easter to all, have a great day!"},{"text":"Crazy @megynkelly says I don't (won't) go on her show and she still gets good ratings. But almost all of her shows are negative hits on me!"},{"text":"Failed presidential candidate Mitt Romney, the man who \"choked\" and let us all down, is now endorsing Lyin' Ted Cruz. This is good for me!"},{"text":"Looking like my 5 victories on Tuesday will be just as good as if I won Ohio. Two more days and Ohio was mine!"},{"text":".@WSJ is bad at math. The good news is, nobody cares what they say in their editorials anymore, especially me!"},{"text":"RT @JohnStossel: I can skate here ONLY b/c @realdonaldtrump fixed this rink after NYC gov’t spent $13M, but FAILED! Good for Trump! https:/…"},{"text":"Watching other networks and local news. Really good night! Crazy @megynkelly is unwatchable."},{"text":"In presidential voting so far, John Kasich is ZERO for 22. So why would he be a good candidate? Hillary would beat him, I will beat Hillary!"},{"text":"Good morning Ohio! Some additional information from my daughter, @IvankaTrump! #VoteTrump #SuperTuesday https://t.co/H7sBEnSpYq"},{"text":"Absentee Governor Kasich voted for NAFTA and NAFTA devastated Ohio - a disaster from which it never recovered. Kasich is good for Mexico!"},{"text":"\"@ChadRowland3:  @jdickerson @FaceTheNation A solid interview and a fair one. Great job Mr. Trump. Keep up the good work. #TrumpTrain\""},{"text":"\"@blt21muttrades: People are just mad that you're doing so good so they are gonna do they're best to stop you. Not gonna happen #MAGA\""},{"text":"Looks like two-time failed candidate Mitt Romney is going to be telling Republicans how to get elected. Not a good messenger!"},{"text":"Have a good chance to win Texas on Tuesday. Cruz is a nasty guy, not one Senate endorsement and, despite talk, gets nothing done. Loser!"},{"text":"All the online polls have me winning the debate. I really enjoyed the evening. Not easy, but good. https://t.co/sLTmwVVM5I"},{"text":"People (pundits) gave me no chance in South Carolina. Now it looks like a possible win. I would be happy with a one vote victory! (HOPE)"},{"text":"\"@Good2bqueen67:  @brithume @megynkelly They're too lame to get it, Sir. When you win the election they'll get it.\""},{"text":"\"@by @tedcruz good I want to see the court decide what I was always told \"natural born\" means - born on American soil\""},{"text":"No-one has done more for people with disabilities than me. I have spent many millions of dollars to help out-and am happy to have done so!"},{"text":"\"@JoeNBC: Trump just talked on MSNBC like a man who knows he had a very good night.\""},{"text":"\"@JoeNBC: Trump, Kasich, Jeb and Christie all had good nights.\""},{"text":"\"@JoeNBC: Cokie Roberts says Donald Trump had a really good night.\""},{"text":"Iowa was amazing last night. The event could not have worked out better. We raised $6,000,000 for our great vets. They were so happy &amp; proud"},{"text":"Good morning America! Thank you for all of your support in the latest Drudge poll! https://t.co/XDnixWnqwb https://t.co/yUTtLnALxy"},{"text":"I hear that @SenTedCruz’s $$ man, Robert Mercer, a good man, is very angry because Cruz lied to him about liquidating his (Ted’s) holdings.?"},{"text":"The statement put out yesterday by @FoxNews was a disgrace to good broadcasting and journalism. Who would ever say something so nasty &amp; dumb"},{"text":"I am in Iowa. Will be making two speeches today. Good luck to all of the great folks on the East coast. Enjoy the beauty of the storm!"},{"text":"Leaving Nevada now for Iowa. Things are looking good - great new polls!"},{"text":"Happy birthday to my friend, the great @jacknicklaus - a totally special guy!"},{"text":"Why does @ThisWeekABC w/ @GStephanopoulos allow a hater &amp; racist like @tavissmiley to waste good airtime? @ABC can do much better than him!"},{"text":"Heading now for Reno, Nevada, for a big rally. Good poll numberd all over!"},{"text":"Not good news for Jeb Bush  https://t.co/5CrP5zdXsz"},{"text":"Hank Greenberg, formerly of AIG, gave $10 million to the @JebBush campaign 3 months ago. He is not happy, a total waste of money!"},{"text":"\"@pink_sprnva: @pastormike7 @thehill I agree with you on this. @realDonaldTrump won't be good. He will be great!\""},{"text":"HAPPY BIRTHDAY to my son, @EricTrump! Very proud of you!\nhttps://t.co/ZHMKIqnUwL https://t.co/IJzW2NDJyA"},{"text":"\"@iLoveiDevices: @EdwinRo47796972 @happyjack225 @FoxNews @krauthammer  Minimizing dependency on China is crucial.Only Trump talks about that"},{"text":"\"@CASuperrunner: @georgehenryw Huckabee is a good man...but he needs to get behind @realDonaldTrump\"  I agree!"},{"text":"Happy New Year from #MarALago! Thank you to my great family for all of their support. https://t.co/6UsqSiaaj7"},{"text":"#HappyNewYearAmerica! https://t.co/EeQb8PDrUe"},{"text":"HAPPY NEW YEAR &amp; THANK YOU! https://t.co/YO1Yi8QbZy https://t.co/uxUXWJ1Rbv"},{"text":"I would like to wish everyone A HAPPY AND HEALTHY NEW YEAR. WE MUST ALL WORK TOGETHER TO, FINALLY, MAKE AMERICA SAFE AGAIN AND GREAT AGAIN!"},{"text":"HAPPY BIRTHDAY to my son, @DonaldJTrumpJr! Very proud of you! #TBT https://t.co/ULerCEOCGX https://t.co/nbxPVdarJM"},{"text":"\"@TruthisAll1: @realDonaldTrump @CharlesHurt @seanhannity Good morning, Mr. Trump. You're so AWESOME. #Trump2016 https://t.co/LljQbi4fdP\""},{"text":"Wages in are country are too low, good jobs are too few,  and people have lost faith in our leaders.We need smart and strong leadership now!"},{"text":"\"@ihatematt: @realDonaldTrump why is Hillary even allowed to run... She's a criminal.\"  Good question!"},{"text":"Merry Christmas &amp; Happy Holidays!\n#MakeAmericaGreatAgain #Trump2016\nhttps://t.co/XIVw5LdTqv https://t.co/Sqim2YyoCH"},{"text":"Thank you @davidaxelrod for your nice words this morning on @CNN. It was a good night!"},{"text":"\"@ConradMBlack: Many thanks Donald, and all good wishes in helping to clean up the American government. Honored to be your friend. C.\""},{"text":"\"@MrDeuce25: @CNN @LindseyGrahamSC DonaldTrump Good were glad he doesn't represent what you stand for Lindsey. You are weak and have no clue"},{"text":"Wow, I just had two very good Iowa polls and a phenomenal just out National Poll from @ABC @washingtonpost - 38%.  MAKE AMERICA GREAT AGAIN!"},{"text":"A very good NBC/Wall Street Journal Poll was just released wherein I went up from last month and am in the lead. Nice!"},{"text":"\"@Keeblerqueen: @realDonaldTrump Good Lord ... Donald.. Your following went up so much lately ... Crazy love for you and what you stand for!"},{"text":"Never get good #'s from failing Des Moines Register/Bloomberg. I think something's going on w/them. Up 13 in IA according to respected CNN."},{"text":".@BernardGoldberg was not good tonight on @oreillyfactor. He just doesn't know about winning! But he is a nice guy."},{"text":"\"@ShellyPayne4328: @WayneRoot @realDonaldTrump Amen! Looking forward to a happy new year. It's been too long! #voteTrump2016\""},{"text":".@washingtonpost is going out of its way to tell failing candidates how to beat Donald Trump.The Post doesn’t get that I’m good at winning!"},{"text":"The podium in the Oval Office looks odd! Not good, but the words will be the key."},{"text":"I will be re-tweeting some of your better, most imaginative and hopefully insightful tweets. Make them good (great)! Important stuff."},{"text":"May the Festival of Lights bring our Jewish friends from around the world, health &amp; happiness! Happy Hanukkah! https://t.co/03UZBGCswB"},{"text":"\"@curtiscraven76: @CNN @realDonaldTrump keep up your good work Mr trump cause u have my vote\""},{"text":"Good news, disloyal @Macys stock is in a total free fall. Don't shop there for Christmas! https://t.co/wpDDCWcLFD https://t.co/vT3uGjiZ9B"},{"text":"\"@PatrickAnna: @realDonaldTrump You can definitely thank God for you health, stamina, strength, and all the good things in your life!\" True!"},{"text":"California shooting looks very bad. Good luck to law enforcement and God bless. This is when our police are so appreciated!"},{"text":"Curtis Sliwa - doing tv commentary on 9/13/2001. Good job Curtis. Please send your apologies to @realDonaldTrump. https://t.co/g07VZmNmAW"},{"text":"How is Chris Christie running the state of NJ, which is deeply troubled, when he is spending all of his time in NH? New Jerseyans not happy!"},{"text":"Happy Thanksgiving to all. Have a great day and look forward to the future. We will MAKE AMERICA GREAT AGAIN!"},{"text":"The failing @nytimes should be focused on good reporting and the papers financial survival and not with constant hits on Donald Trump!"},{"text":"\"@Keeping__Real: So good to see the @realDonaldTrump family out with him on the campaign trail! It really shows the family man that he is!\""},{"text":"\"@idawhannadoyou: @realDonaldTrump @OANN Love it. Wish I could get @OANN I hear good things about them such as objective unbiased reporting."},{"text":"\"@Maryland4T: @SmallBiz4Trump Keep up the good work! Americans of ALL kinds are rallying behind jlDonaldTrump to help #MakeAmericaGreatAgain"},{"text":"\"@Good2bqueen67: .@realDonaldTrump @Sandikay60 I enjoyed the speech so much tonight, you were on point 👆 Sir!\"  Thanks."},{"text":"\"@drewtheg:  Trump is the epitome of integrity, good spirit, forthright honesty... you pull no punches and call a spade a spade. diggin it!\""},{"text":"\"@hotroddergirl: @realDonaldTrump trump 20/20 shows just what hard work and good family can do. Blue collar with you.\""},{"text":".@washingtonpost  @BretBaier  Please thank Charles Lane for his new found confidence. He has made a very good bet!"},{"text":".@JohnLegere  @TMobile  John, focus on running your company, I think the service is terrible! Try hiring some good managers."},{"text":"Happy Friday the 13th https://t.co/Br6AUzgGoi"},{"text":"Happy Veterans Day. To those who have served, thank you for your special work."},{"text":"\"@Rmac747:  Keep up the good work, Donald! Hello from Vancouver where the new &amp; amazing Trump Tower and Hotel almost complete!"},{"text":"\"@JezzaK: If the Trump Hotel Honolulu is any reflection how you would be as President then I think the U.S will be in good hands\" Thank you!"},{"text":"\"@EmitteLucemTuam: @realDonaldTrump @EricShawnonFox Great job Donald! Good luck from Canada!\""},{"text":"They are saying that tickets to tonight's Saturday Night Live are the hardest to get in the history of this great show! Off to a good start!"},{"text":"Would be nice if @jmartNYT learned how to read the polls before writing his next story. Probably done on purpose, but not good reporting!"},{"text":"\"@FBeadon: @realDonaldTrump don't let the Keystone Pipeline die. The US needs to be good neighbors with Canada, and energy independent.\""},{"text":"So sad that Obama rejected Keystone Pipeline. Thousands of jobs, good for the environment, no downside!"},{"text":"Happy Birthday to the great @BillyGraham. He's done so many wonderful things, not the least of which is his fantastic family. I love Billy!"},{"text":"\"@Robostop10: @realDonaldTrump This is not good. https://t.co/lvv0MRfgtH\"  WOW, one of many lies by Ben Carson! Big story."},{"text":"I think it would be a good idea—and fair—to include @GovChristie &amp; @MikeHuckabeeGOP in the debate. Both solid &amp; good guys. @FoxBusiness"},{"text":".@Morning_Joe: Marco only won the debate in the minds of desperate people. I won every on-line poll, even crazy @CNBC. Marco good looking?"},{"text":"\"@Truth_or_Rumor: @realDonaldTrump It's not so much that Iran made a good deal, it's that Kerry and Obama gave away the store.\"  O.K.!"},{"text":"Jeb's new slogan - \"Jeb can fix it\". I never thought of Jeb as a crook! Stupid message, the word \"fix\" is not a good one to use in politics!"},{"text":"Just left Virginia where I unveiled my healthcare and other plans for our great Veterans! They will be very happy! https://t.co/rhdiCocPyv"},{"text":"Happy Birthday to my friend @garyplayer...https://t.co/WuN4AV9IMT"},{"text":"Happy Birthday to my wonderful daughter, @IvankaTrump."},{"text":"\"@xXFlameriumXx:  @MikeandDawnNY Good job Mr. Trump. The way you respond shows that you truly are ready to be the next US president! #Trump\""},{"text":".@SpeakerRyan Congratulations and good luck - you will do a GREAT job for our wonderful U.S.A.!"},{"text":"\"@T_Johnson_TJ: @realDonaldTrump you have my vote in my first election great debate last night keep up the good work! #Trump2016\" Thanks."},{"text":"\"@SteveBashino:  Trump good for legal immigration, economy, defense, taxes, Social Security, Medicare, 2nd Amendment, and ALL Americans.\""},{"text":"\"@truthinvest: @ChrisChristie @HillaryClinton good job for Christie last night.Maybe he will face her 8 yrs from now after @realDonaldTrump\""},{"text":"\"@Sisters4everT: Good Night all supporters. Great night Mr @realDonaldTrump, You ROCKED the Rocky Mountains &amp; the Nation tonight!!!\""},{"text":".@TheEconomist Poll, one of the most highly respected, was just released. Wow, wait until the media digests these numbers - won't be happy!"},{"text":"\"@JayknightJay: @RealBenCarson good morning. Easy on each other &amp; finish off the establishment guys. They hope you 2 will fight it out.\"True"},{"text":"\"@hoosierclinger: Good job @realDonaldTrump for badgering Ford. Why didnt POTUS or Hillary care about those UAW jobs in Ohio?\""},{"text":"Watch my interview on @CBSNews Face The Nation now and, also, the new CBS POLLS which, if good for me, the media won't report!"},{"text":"Will be doing a sit down interview with  @JakeTapper @CNN on Sunday morning at 9:00. Tough questions and hopefully very good answers!"},{"text":"Saying goodbye to some of my great workers at @TrumpDoral in Miami. https://t.co/C8AG3eGSus"},{"text":"\"@carrillo_pete: @realDonaldTrump people are for you #Trump2016 keep up the good work and we will win this and #MakeAmericaGreatAgain\""},{"text":"I will be interviewed on @GMA Good Morning America at 7:00 A.M. @ABC will be announcing new poll numbers. MAKE AMERICA GREAT AGAIN!"},{"text":"\"@AliceCarozza: @realDonaldTrump You were so much better than Jeb on Hannity. So Great and presidential. I'm happy this was discussed.\""},{"text":"I will be interviewed on @GMA Good Morning America tomorrow at 7:00 A.M. Big new ABC poll coming out - I hope I do well!"},{"text":"\"@ChefMama32: @realDonaldTrump Good interview with Chris! Chris even gave you a thumbs up for POTUS\""},{"text":"\"@Pappenjazz: An Incredibly Strong Interview Of @realDonaldTrump @FoxNewsSunday, Good Response  IC Those @FoxNews NaySayers dissapating!\""},{"text":"On at 9:00A.M. or 10:00 A.M. (depending on your location)  on Fox is a tough but really good interview with Chris Wallace. Enjoy!"},{"text":"\"@vlynpowell: @realDonaldTrump At happy hour tonight in Charleston, SC, everyone at the bar said they were supporting Donald Trump. Thanks!"},{"text":"Good news for those that want to Make America Great Again - I am winning every poll in every STATE and NATIONAL - and by big numbers! Thanks"},{"text":"I will be interviewed on Fox News Sunday With Chris Wallace at 9:00 A.M. or 10:00 A.M. (depending on location). Will be tough but good!"},{"text":"Steven Tyler got more publicity on his song request than he’s gotten in ten years. Good for him!"},{"text":"\"@PauperInAPinch: @realDonaldTrump Thank goodness #DemDebate is over. Not impressed... TRUMP2016!!! #MakeAmericaGreatAgain\""},{"text":"Good move by Bernie S."},{"text":"\"@0Nonsense: @realDonaldTrump Good luck commenting on this snooze fest, I'm out.\""},{"text":"We will all have fun and hopefully learn something tonight. I will shoot straight and call it as I see it, both the good and the bad. Enjoy!"},{"text":"\"@deqwik2: @SaraMurray @realDonaldTrump Sorry link above not working. Here's good link http://t.co/0DoJeMrzC9\"  @CNN and Jeb - apologize!"},{"text":"\"@GregWescott: @realDonaldTrump @seanhannity @FoxNews Another great interview. You were point on .... As good as it gets!\"  Thanks!"},{"text":"\"@CNNPolitics: .@clayaiken praises \"good guy\" Trump and his \"upstanding\" and \"grounded\" kids http://t.co/sewrn2VkJ8 http://t.co/oRIPL1xDBG"},{"text":"\"@Clint_Goodrich: They used to call Barry Diller the father of \"e-commerce\"-what a joke that was - and that he is. 100%clueless on Internet\""},{"text":"Good luck to the US Men’s National Team in tomorrow’s CONCACAF Cup vs. Mexico!  It should be a great game!  https://t.co/nH31afzjNz"},{"text":"Good luck! Enjoy. https://t.co/ddfPtVYpXv"},{"text":"I was so happy when I heard that @Politico, one of the most dishonest political outlets, is losing a fortune. Pure scum!"},{"text":".@EWErickson ran @RedState into the ground. A change was necessary. Congratulations to @RedState and good luck in the future!"},{"text":"\"@NeilForell: Watched the roast of @realDonaldTrump You took those jokes like a champ, what a good sport! Im voting for you now\"  Great."},{"text":"I was so looking forward to being in Virginia Beach, Virginia, today. The demand for tickets was amazing. Good luck with storm, back soon!"},{"text":"\"@kissmeandrocco: @realDonaldTrump who ever thinks Donald trump is a bad person u just don't want a good country\" Thank you."},{"text":".@TheHill- Trump on Boehner resignation: 'It's a good thing' http://t.co/flB93n4FoK"},{"text":"So happy about my daughter @IvankaTrump’s announcement that she will be having a baby this spring. Congratulations!"},{"text":".@oreillyfactor was very negative to me in refusing to to post the great polls that came out today including NBC. @FoxNews not good for me!"},{"text":".@Modern_Do_Good #asktrump http://t.co/I7AaH7AVRw"},{"text":"The polls are really looking good—#1 everywhere despite all lobbyist &amp; special interest $ being spent against me. I’m turning down millions."},{"text":"\"@iamapatsfan: What are your thoughts on your good friend Tom Brady's performance yesterday?  He was fantastic, a total winner!"},{"text":"Very good news—the new Quinnipiac poll just came out—I am #1 in Iowa."},{"text":"\"@sunnykcollins: Jeb Bush, Family Ties and a Museum That Never Materialized http://t.co/RTANPzuwU2\" Not good!"},{"text":"\"@soz58: @realDonaldTrump @BOB_EWASHINGTON @club4growth it's good to show the public such things,a lot of nerve to ask for a million dollars"},{"text":"\"@jasonusmc2017: @blayne_troy @realDonaldTrump: He was right when he called Obama the 5 for 1 president. 5 terrorist for one no good traitor"},{"text":"Another good poll result in the great state of SC. Trump at 30%. Carson at 15% and Bush at 9%.  http://t.co/FjQfdCrfdT"},{"text":"\"@swamp_bug: @seanhannity  Cruz is my second/third choice. Carson is also a good man. I look at it as war, so my choice is TRUMP.\""},{"text":"Jeb Bush is weak on illegal immigration, in favor of common core, bad on women's health issues and thinks the Iraq war was a good thing."},{"text":"\"@2ndVoter: @SteveHuang68 agree. One of the things that is good abt @realDonaldTrump is he's forcing others out of status quo politicking.\""},{"text":"\"@WendyJFluga28: DonaldTrump is an emblem of HOPE that the best is yet to come for America! The good Trump name will be proudly displayed"},{"text":".@NicolleDWallace  Your father is a brilliant man with wonderful sense -- therefore, you must be good!"},{"text":"\"@WriteReadRock: @thehill DonaldTrump is EVERYWHERE! At this moment he is the most famous person on Earth. And for a GOOD reason! #TRUMP2016"},{"text":"LIVE on #Periscope: Good morning Iowa! Let's #MakeAmericaGreatAgain #Trump2016  https://t.co/zSLKMCk0tW"},{"text":".@SenTedCruz had a very good debate, far better than Rand Paul."},{"text":"Roger Ailes just called. He is a great guy &amp; assures me that “Trump” will be treated fairly on @FoxNews. His word is always good!"},{"text":"I really enjoyed the debate tonight even though the @FoxNews trio, especially @megynkelly, was not very good or professional!"},{"text":"Diligence is the mother of good luck. -- Benjamin Franklin"},{"text":"Despite the false @nytimes story about Jeb Bush being happy with the Trump surge, he fell more than anybody &amp; is miserable."},{"text":"Wow, did the @nytimes fall into the Bush trap where his people convinced them how happy he was that I was hurting other candidates &amp; not him"},{"text":"I wish good luck to all of the Republican candidates that traveled to California to beg for money etc. from the Koch Brothers. Puppets?"},{"text":"Lawyer Elizabeth Beck was easy for me to beat. Ask her clients if they are happy with her results against me. Got total win and legal fees."},{"text":"\"@DavidKyleOnline: @realDonaldTrump attack Walker on Common Core. State grassroots not happy with him on CC inaction.\""},{"text":"\"@3rdedit: Media attacking you early this morning. A GOOD SIGN!America is proud of you for ignoring the MEDIA &amp; telling it like it is!\""},{"text":"\"@BB1959_:  @FrankLuntz I am not impressed with Luntz. Never have been. What makes him an expert - he has a good racket going.\""},{"text":"Good luck to my new friends on your testimony in DC. You are amazing people doing something so important--- stopping illegal immigration!"},{"text":"\"@pg_rant: They can't handle you Donald so want you out the race, well good luck,because we know you won't walk away! Give it to them\""},{"text":"\"@HoustonWelder: Donald Trump is one of the sexiest men on this planet. Every woman dreams of a good man who tells it like it is.\" So true!"},{"text":"I am so happy that people are boycotting Macy's http://t.co/qtmaEbeVy8"},{"text":"The joke around town is that I freed El Chapo from the Mexican prison because the timing was so good w/ my statements on border security."},{"text":"\"@gump6363: I always said I will not vote until I truly believe in a good leader, you sir will get my vote! #MakeAmericaGreatAgain\""},{"text":"\"@KBrocking: @realDonaldTrump @krauthammer The Donald is the only good Republican candidate, in my opinion. Rubio, Perry, etc??? Um, no.\""},{"text":"\"@williamonlyrent: @realDonaldTrump @krauthammer Only good candidate in this GOP field is you sir! Go Trump. #Trump2016\" Thank you."},{"text":"\"@bdean1: If I had a dollar for every time a politician lied, i'd be as rich as @realDonaldTrump I'm happy as hell he's running! #Trump2016\""},{"text":"\"@thedemonking18: Late night confessions: I think Donald Trump would be a good president\""},{"text":"\"@jackie4545890: @realDonaldTrump good for you Mr. Trump for speaking up for America you're the only one that's real\""},{"text":"HAPPY 4TH OF JULY TO EVERYONE!  MAKE AMERICA GREAT AGAIN!"},{"text":"New jobs report: 432,000 left workforce, manufacturing &amp; durable goods go - http://t.co/RD1blUZyRn We need leaders who understand business."},{"text":"\"@David_A_Hurd: @realDonaldTrump Fight the good fight Mr. PRESIDENT TRUMP! You are the only one fighting for America! #Trump2016\""},{"text":"\"@jjhrkel: @realDonaldTrump don't ever back down from these clowns! fight the good fight!!\" I promise!"},{"text":"\"@KEEMSTARx: Mexican criminals coming into USA? YES Did Trump say we need to stop them? YES Did he say Mexicans are good? YES Racism? NO\""},{"text":"\"@RSan: Donald Trump's Polling Looks too Good to Be True."},{"text":"Only very stupid people think that the United States is making good trade deals with Mexico.Mexico is killing us at the border and at trade!"},{"text":"Anyone who wants strong borders and good trade deals for the US should boycott @Univision."},{"text":"I love Mexico but not the unfair trade deals that the US so stupidly makes with them. Really bad for US jobs, only good for Mexico."},{"text":"\"@CWilliams_Rltr @realDonaldTrump.  I am so happy you are running for President. You have my vote.\""},{"text":"Entrepreneurs: Be tough, be smart, be personable, but don't take things personally. That's good business."},{"text":"\"@JPJAC: @realDonaldTrump @FoxNews Why is it that FOX loved you until you declared as a candidate???\"  Good question!"},{"text":"Happy Father's Day to all! I had a wonderful and loving father. https://t.co/SdrRctSxhu"},{"text":"\"@SMW5683: @realDonaldTrump Donald trump will do this country  good! He is a businessman &amp; will know how to grow our economy\""},{"text":"\"@DavidSBaldwin: @realDonaldTrump today's the day #Trump2016! Good luck!\""},{"text":"\"@isabelsimon80: @realDonaldTrump @brentcfritz Donald has as good of a chance as anyone else.. 👍People like him...NO MORE POLITICIAN'S...\""},{"text":"\"@MikeLongoNYC: @realDonaldTrump Happy Birthday! Can't wait for the announcement on Tuesday, I'll be there!\""},{"text":"I am really happy that Hillary made her speech right under Trump World Tower!"},{"text":"\"@DillonConrad0: If @realDonaldTrump ran for president in 2016, I'd be one happy camper\""},{"text":"\"@hugshenderson  @GolfMonthly @realDonaldTrump he's a legend. Does so much good for Scottish golf\" Thanks."},{"text":"\"@RaeRae_luv I'm on the fence but if @realDonaldTrump runs then I'm all good\""},{"text":"Entrepreneurs: Vision remains vision until you focus, do the work, and bring it down to earth where it will do some good."},{"text":"\"@dxkelley: @BOBonTCN does Mister Runyan think that Donald Trump would make a good president, or a great president?\" Great."},{"text":"\"@JollyGoodman181: Vote Trump for President 2016 Americans last hope Donald Trump... Let's take OUR country back. Vote for the \"Don\" 2016\""},{"text":"\"@davidkaifaith: golf at donald trump's place is always a good idea http://t.co/hj7bujG3TG\""},{"text":"\"@JollyGoodman181: @realDonaldTrump Trump for President\""},{"text":"\"@amazechristianl: @realDonaldTrump Are you happy with current polls? Congrats on the success so far.\""},{"text":"\"@JollyGoodman181: @realDonaldTrump Trump for President!!!\""},{"text":"\"@JollyGoodman181: @realDonaldTrump The \"Don\" is our guy... the man who will set things straight. Donald Trump for President.\""},{"text":"\"@alphainparis: @seanhannity DonaldTrump is the 21st century Ronald Reagan. Intelligent. Bold. Surrounded by good people. Gets the job done."},{"text":"\"@MMValetServicez: \"I wasn't satisfied just to earn a good living. I was looking to make a statement.” – Donald Trump"},{"text":"Good advice from my mother: \n\"Trust in God and be true to yourself.\" -- Mary Trump"},{"text":"Good advice from my father: \"Know everything you can about what you're doing.\" --  Fred C. Trump"},{"text":".@AnnCoulter's new book-- \"Adios, America! The Left's Plan to Turn Our Country into a Third World Hellhole\"-- is a great read. Good job!"},{"text":"\"@_Aleshaxo: Good morning @realDonaldTrump I'm still hoping to hear #Trump2016 🙏 You've my vote.\"  Stay tuned!"},{"text":"\"@GirlCant_helpit: DonaldTrump  Everyone wants you to run. Why don't you? You would be perfect. President Donald Trump has a good ring to it"},{"text":"\"@Vinnie_109: @WalkerLaflin @katie_0303 we need @realDonaldTrump to run and we would be good\""},{"text":"I would like to wish everyone, including all haters and losers (of which, sadly, there are many) a truly happy and enjoyable Memorial Day!"},{"text":"\"@HoboWill: @realDonaldTrump you are convincing me more and more..\"  That's good news!"},{"text":"\"@BHLiberty @realDonaldTrump I will look forward to your debate performance! I believe this country could use a leader like you! Good luck!\""},{"text":"Audience chanting \"RUN TRUMP RUN!\" during my my @SRQRepublicans speech! They are going to be very happy..."},{"text":"\"I make good deals. That's what I do. I would make great deals for our country.\" - my @SRQRepublicans speech"},{"text":"\"@GappistanRadio: All it will take for evil to prevail is for good people to do nothing. @realDonaldTrump you have to run! #Trump2016\""},{"text":"Entrepreneurs:  Be tough, be smart, be personable --  but don't take things personally. That's good business."},{"text":"I will be on @foxandfriends at 7:00 A.M. So much to talk about but not much good news for the U.S.A. MAKE AMERICA GREAT AGAIN!"},{"text":"\"@mark_esque: @bobby2700 @realDonaldTrump Good point. We just really need your help Donald!\""},{"text":"\"@JoeTorre: #HappyBirthdayYogiBerra! http://t.co/MjqKRRUxPo\""},{"text":"A great job by @RickieFowlerPGA in winning The Players yesterday. Finally, your jealous critics can go to hell! Good luck at The U.S. Open."},{"text":"Happy #MothersDay to all the great mothers out there! https://t.co/WvH2GwxG99"},{"text":".@tuckercarlson is doing a really good job on Fox, especially when talking politics. He has come a long way fast!"},{"text":"“Keep a good attitude and do the right thing even when it's hard. When you do that you are passing the test.” - @JoelOsteen"},{"text":"\"@NatashaOwnfan:  @RockinJoe1 For me, you are the only one that can do the job right, move the country forward &amp; bring about goodness\"  True"},{"text":".@FloydMayweather  Good luck tonight Floyd."},{"text":"\"@Packerlegends: @realDonaldTrump Trump would make a good president because he knows how to make money, not waste it.\" True."},{"text":"\"@jorgey1_1985: @realDonaldTrump if you don't run then HilaryClinton Will WIN and become president, no good candidates on republicans side\""},{"text":".@CGasparino  Good seeing you. Keep up the great work, never stop!"},{"text":"\"@spirtualhappy: First thing I see when I log unto twitter is @realDonaldTrump #goodmorning trumpy\" Great."},{"text":"\"@njoh1234: @realDonaldTrump @foxandfriends listening...good interview!"},{"text":"\"@ravgames: .@realDonaldTrump Serious question, Mr. Trump: Why don't you like @JonahNRO?\" Because he is not good at what he does-@NRO dying"},{"text":"\"@WeWantMitt2016: The last person a foreign leader would want to sit across the negotiating table from. Good for us. #MakeAmericaGreatAgain\""},{"text":"\"@AndrePretorius: @realDonaldTrump I am #SouthAfrican and I can say, you are 100% correct. Lately we are starting to live in fear. #notgood\""},{"text":"\"@TheAlexanderW_:I think your sign would look just as good on the White House as it does on Trump Chicago. #Trump2016 http://t.co/aYxvbTTUKr"},{"text":"@apageor2  Very good, must be tough!"},{"text":"\"@AndrewWilkie85: @realDonaldTrump @smxtty_ I think that you would be as good as Reagan. Please run!!!\""},{"text":"\"@JohnMarkowitz: @realDonaldTrump you are damn good\""},{"text":"\"@scapesrus: @realDonaldTrump @smxtty_ U would make a damn good one\""},{"text":".@DanaPerino wrote a wonderful book, “And the Good News is..\"  Dana has a fabulous perspective on life &amp; politics—go get it!"},{"text":"\"@HarperArchitect: @realDonaldTrump good talk watched on c-span, intelligence.  Thanks."},{"text":"\"@meltsch: @realDonaldTrump Good make a decision, are you running or not , we want you , but only you know if you want us .\" Watch."},{"text":"\"@RM_MMBtuGirl: @realDonaldTrump isn't it refreshing?! There's hope. Keep up the good work.\""},{"text":".@BretBaier   Why do you have George Will on your show - he's exhausted, boring and not even a little relevant! Waste of good air-time!"},{"text":"\"@idiotninja24: @TrumpVancouver @realDonaldTrump I see you.... Looking good! #Vancouver http://t.co/KRgz3MUseb\""},{"text":"\"@JosephSchleider: @realDonaldTrump good interview on Fox News Radio. You are my preferred candidate for the USA presidency @AlanColmes"},{"text":"\"@pare900: @HAJMAJA @realDonaldTrump Trump wants low taxes, strong defense and jobs . Trump is good at creating jobs."},{"text":"\"@Josh_leonard99: If America was as successful and planned like @realDonaldTrump we would be in good shape."},{"text":"\"@ScillieriJr: @alexskoog @realDonaldTrump if he can run america like he runs a business, he'd be a good president\" You mean great."},{"text":"\"@jamison1013gma1: @realDonaldTrump @burger__meister I pray that the good lord will give you the strength to run MR. TRUMP\" Thank you."},{"text":"\"@ShaneJoseph: Can @realDonaldTrump please run for president just so I can watch him and @HilaryClinton debate. #goodTV\""},{"text":".@BretBaier  I will be interviewed by Bret (on Fox) tonight at 6:00. Watch, it will be good!"},{"text":"\"@tarashuman: DonaldTrump Thank you so much for your amazing HOPE message!!! I'm so grateful. #hopeisagoodbreakfast http://t.co/H3ts8iFuNe"},{"text":"\"@tijfbutler: Greatest Easter greeting ever RT“@realDonaldTrump: I wish everyone, including the haters and losers, a very happy Easter!”\""},{"text":"I wish everyone, including the haters and losers, a very happy Easter!"},{"text":"Have a fantastic, beautiful and happy Easter everyone and then, when Easter is over, have great wins and triumphs in life. Never give up!"},{"text":"\"@OliverOmrf  Very excited to start reading #theartofthedeal after being so inspired by #howtogetrich  @realDonaldTrump\" Great. Good luck!"},{"text":"\"@LauraMontaguxox: @realDonaldTrump You would be a good president! Your a great businessman and care about our country!\" Thanks."},{"text":"\"@nikkio:  Good interview on O'Reilly - Many people r unaware how foreigners play around w/ currency to win trade over USA companies.\""},{"text":"\"@msft9: @realDonaldTrump @RichRichie725 good job on O'Reilly tonight!\""},{"text":"\"@RichRichie725: @realDonaldTrump You can't make a BAD Deal GOOD\""},{"text":"\"@agoodeye: @oreillyfactor v @realDonaldTrump Bill you're out of your league. Don knows what he's saying\""},{"text":"\"@Beyon: @oreillyfactor You know... DonaldTrump is looking pretty damn good as a presidential candidate. Maybe he is our modern day Patton?\""},{"text":"\"@GiamattiJenna: @realDonaldTrump @oreillyfactor it's going 2 b good\""},{"text":"\"@josephangel247 @realDonaldTrump So true after reading the Art of the Deal #AMustReadBook #GoodAdvice\""},{"text":"\"@JustSoldCom: @realDonaldTrump trump has a very good chance at 2016! We need you Mr Trump, The US needs you!!\""},{"text":"\"@foxrocks2012: \"@TrumpGolfLA\"@Daniel_Logan \"Amazing double rainbow above the course\": \"http://t.co/xG0cDntP1x\" A Good Omen for DonaldTrump"},{"text":"\"@ArsenalHobbo Just finished watching celebrity apprentice @realDonaldTrump @IvankaTrump on the BBC great work guys for such a good cause\""},{"text":"\"@SamDoyle12 @realDonaldTrump Thanks for the quotes today---a month away of starting my own business #helpful\"  Good luck."},{"text":"\"@TalkerNewYorker  I love the Trump Family. They have done so much just in #NYC, how lucky other parts get to benefit! #GoodFamily\""},{"text":"Entrepreneurs: Success is good. Success with significance is even better. Make your work count."},{"text":"\"@AlorAcai: #GoodAdviceIn4Words Vote @realDonaldTrump For President.\""},{"text":"\"@DNorrell: @greta @StateDept @FoxNews Trump is only good canidate - non-politician non-insider - bring transpaency back. @realDonaldTrump\""},{"text":"I am happy to announce that the @PGAGrandSlam will be held at @TrumpGolfLA this year! https://t.co/CHFxHiRqii Follow @TrumpGolf for more!"},{"text":"\"@JxCookie96 @realDonaldTrump I really appreciate your tips. Just started a business, going for gold. Thank you.\"  Great--good luck!"},{"text":"Being good in business is the most fascinating kind of art. Making money is art &amp; working is art &amp; good business is the best art\nAndy Warhol"},{"text":"\"@SamDoyle12  thx for the RT--what is a good book I can read, that can help me in starting my business?\" The Art of the Deal and Midas Touch"},{"text":"\"@scottsiebs: Good Monday morning from my room at the beautiful TRUMP OCEAN CLUB Panama. A great, great hotel!!  http://t.co/fa7XMxMVib\""},{"text":"\"@la_loquita We are breaking into real estate investing and we love @realDonaldTrump because he knows his business!!\"  Great, good luck!"},{"text":"\"@SamDoyle12 @realDonaldTrump great posts. As a budding entrepreneur, I appreciate the quotes\"  Great--work hard and good luck!"},{"text":"Entrepreneurs: Be tough, be smart, be personable, but don’t take things personally. That’s good business."},{"text":"#TBT With the cast of GoodFellas https://t.co/Jk4tNhDF9X"},{"text":"\"'Good Chance' Trump Will Run for President\" http://t.co/7VD05VjGHK via @Newsmax_Media by @melaniebatley"},{"text":"I told everybody the Oscars were no good—Nielsen ratings confirmed, one of the lowest ratings in history."},{"text":"What ever happened to the good old days of The Academy Awards. This show is an insult to the past, just plain bad!"},{"text":"\"@KeatsBen: @realDonaldTrump Good Evening Mr President! @realDonaldTrump\""},{"text":"\"@cookit1960: @TODAYshow @Carson Daly's @realDonaldTrump so happy 4 Leeza. I was hoping she'd win all along.\""},{"text":"\"@chingaling3: @realDonaldTrump Happy Valentines Day to you and your lovely wife. Jesus Loves you both.\""},{"text":"\"@AllGoodEggs:  @LoriMoreno @TrumpNewYork @TrumpChicago @TrumpWaikiki @TrumpToronto @Forbes Any chance you can make America 5Star please?\""},{"text":"\"@StartupSupaStar: \"I wasn't satisfied just to earn a good living. I was looking to make a statement.\" -Donald Trump http://t.co/scDWnOZizi\""},{"text":"Entrepreneurs: Success is good. Success with significance is even better."},{"text":"\"@Prayformetoo: @realDonaldTrump @davidaxelrod I knew when I heard him say it you would speak up. Good on ya!\""},{"text":"\"@alexiskrystina: Love the #celebapprentice flashback! The winners are always the good people who DON'T play dirty. Donald keeps it #classy\""},{"text":"\"@JamesSchlosser: When does the next season start? @realDonaldTrump can't end something this good!\""},{"text":"\"@njoh1234: Great show! good time to replay past 'relationships' lol Hope Leeza wins! Would love to see NYC &amp; Trump Towers one day!\""},{"text":"Happy Birthday President Reagan #FlashbackFriday http://t.co/g2jvQaM1ta"},{"text":"Entrepreneurs: Vision remains vision until you focus, do the work, and bring it down to earth where it will do some good."},{"text":"\"@YMcTier: Celebrity Apprentice is So Good 2night! Everyone going in Hard to Not get Fired! @YMcTier Favorite Monday TV Show #LuvIt\""},{"text":"\"@jonihubbard: \"@realDonaldTrump: Best Apprentice episode EVER tonight at 8:00.\" It's been hilarious ! Good pick Mr Trump!\""},{"text":"\"@fordmartin33: This Celebrity Apprentice is looking good so far... Can't wait for the boardroom !! @realDonaldTrump\""},{"text":"\"@Priece714: if @realDonaldTrump ran for president that would make me so happy\""},{"text":"Entrepreneurs: Success is good. Success with significance is even better. Work on what you will be proud to be associated with."},{"text":"\"@VladimirRussia7  @realDonaldTrump You are the best #billionare and the great teacher!I love your inspiring books!\" Thanks and good luck."},{"text":"Entrepreneurs:  Be tough, be smart, be personable, but don't take things personally. That's good business."},{"text":".@TrumpCollection continues to deliver the goods   http://t.co/iNyM2MoQUy"},{"text":"\"@Dustin_Sloane: Kate Gosselin is low key good at these tasks @Kateplusmy8 #CelebApprentice @realDonaldTrump\""},{"text":"\"@KenyaMoore: “@Mr_Noguez: Trump recognized Kenya's effort #CelebApprentice that's good @KenyaMoore” @realDonaldTrump thank u!\""},{"text":"\"@hoban36:  Sig &amp; Johnny Damon are good guys. Met Damon several times last at Eric Trump's St JUDES Event he is always the gentleman.\""},{"text":"\"@FreidaWashingt: @realDonaldTrump Good morning to you. The pageant was fabulous! Ms USA came so close. Then tonight is Celeb Apprentice."},{"text":"\"@JayhawkRunner: Good work @RoccoMediate shooting -5 today in the @ChampionsTour event in Hawaii ; sporting the @realDonaldTrump hat."},{"text":"\"@good_vibration7: @realDonaldTrump @NBCNews filipinos love u Mr Trump! you are famous in the Philippines!! we love what u do! thank you\""},{"text":"\"@Allstars_S2: @realDonaldTrump @IvankaTrump @CelebApprentice You did a good job Ivanka. Great show!\""},{"text":"\"@stkhlder3: @BrandiGlanville awww looks like such fun! #TeamBrandi I'm loving ya on @ApprenticeNBC !! Good job @realDonaldTrump"},{"text":"\"@KentBulle: Heading to @realDonaldTrump Trump International in West Palm for a match with @MarkSilvers3 @gene_sauers and Mike Goodes."},{"text":"\"@bensardella: All class on #CelebApprentice by @terrellowens - good job TO! cc @realDonaldTrump\""},{"text":"\"@jdm_jennifer: @realDonaldTrump wow Monday is going to be a good one! you had to be one of the last people to work with Joan Rivers.\""},{"text":"\"@mattygeorge: #CelebApprentice is back! 1st episode on now in Australia! Love the boardroom drama, so good raising $$ for charity\""},{"text":"\"@d_bunzz: @realDonaldTrump The donald looking good in the red tie on David letterman #VoteRed #2016\""},{"text":"You have enemies? Good. That means you've stood up for something, sometime in your life. -- Winston Churchill"},{"text":"Goodnight everyone, sleep tight!"},{"text":"\"@SRT_SuLLy:  @realDonaldTrump geraldo is an egotistical selfcentered pain! Strong competitor &amp; makes for a good show #someonepunchgeraldo\""},{"text":"\"@SONYGYRL: @realDonaldTrump @tlp_trac @terrellowens no, gilbert wasn't good. he cant be focused on the product, more interested in a laugh\""},{"text":"\"@tlp_tracylee: @realDonaldTrump Was Gilbert good? @terrellowens Cough cough cough\""},{"text":"\"@twinkle_s  Apprentice is so good this season. I'd like to thank @realDonaldTrump for these 2 back to back episodes !!!! this show amazing\""},{"text":"\"@Conman13: Great episode of celebrity apprentice! @realDonaldTrump #goodstuff #yourfired\""},{"text":"\"@haileemh13: @realDonaldTrump Geraldo looks happy they lost bc he wasn't project manager. #CelebApprentice\""},{"text":"\"@YMcTier: @realDonaldTrump Watching tonight's New episode! @YMcTier feels this 1 will be Good like All the rest @nbc\""},{"text":"\"@SparkleAWin: DonaldTrump Alot of good looking guys but what's important is R they #CelebApprentice material Can't wait 2 C them in action\""},{"text":"\"@Mari907: @realDonaldTrump &amp; @IvankaTrump back on my TV! I'm a happy gal ❤️😍\""},{"text":"\"@Prochekhomeinsp: Would be the greatest start to the new Year that I could ever imagine!!! Happy New Year Mr. Trump and Team!!!\""},{"text":"\"@JustSoldCom: @realDonaldTrump SO HAPPY #CelebrityApprentice is back on! Thanks Donald for keeping it real!\""},{"text":"\"@KristaCantwell: @realDonaldTrump I'm so happy that @ApprenticeNBC is back! #CelebApprentice\""},{"text":"\"@MY_2BCOLLIES: @MiloandJack  Actually Milo, Mr Trump felt Kate has a good shot at winning. DonaldTrump was very complimentary about Kate.\""},{"text":"\"@rona65: @ApprenticeNBC @realDonaldTrump @nbc good luck on your umpteenth season from the show Producer of show 1\""},{"text":"\"@rexhispaniae: @realDonaldTrump will be watching with my entire family. We are so happy you're back on TV, Mr Trump! Huge fans here!\""},{"text":"\"@VeryOddDog: @realDonaldTrump You are a good Christian! You are right! Also, you should be Presedent! The sooner the better! #TRUMP\""},{"text":"I just saw the movie \"Unbroken\" -- very good except I thought the ending was weak, no retribution! And we complain about waterboarding."},{"text":"\"@RunningDeep67: @UniqueCaptures Too strong? Point out a time in America's history where it was good to have a PUSSY in the White House!\""},{"text":"\"@bbolaji9: Happy new year my president @realdonaldtrump\" Thank you."},{"text":"\"@ericleebow: @realDonaldTrump Hope you finally run for President. That should be your new year's resolution.\" Good thought!"},{"text":"\"@archangeljf12: @realDonaldTrump Palm Beach is one of the greatest places in the World to Live!  #TrumpPOTUS2016 #HappyNewYear"},{"text":"\"@JoshHammer77: @realDonaldTrump happy new year sir can't wait for #CelebrityApprentice\""},{"text":"\"@TalentlessCook: @realDonaldTrump You're only a year away from #2016 ...pick a running mate. Happy New Year\""},{"text":"\"@gillule4: @realDonaldTrump incredible experience at the world famous Mar A Lago Club😄happy New Year\""},{"text":"To EVERYONE, including all haters and losers, HAPPY NEW YEAR. Work hard, be smart and always remember,  WINNING TAKES CARE OF EVERYTHING!"},{"text":"\"@krb117: “@IvankaTrump: @CoachDanMullen Welcome to #TrumpDoral and good luck on Wednesday! cc:  #OrangeBowl” well well.. #HailState\""},{"text":"\"@TheOnlyCdorsey: Wearing the @realDonaldTrump signature collection today #lookgoodfeelgoodscangood\""},{"text":"\"@MarriamF: My bday just been so perfect so far 💗 only way it will be better if my inspiration @realDonaldTrump wishes me happy bday 👌\""},{"text":"\"@stinger_inc: Good thing I tuned into this Steelers/Bengals NFL game on NBC as I found out that Donald's @ApprenticeNBC starts next Sunday!"},{"text":"\"@_Snurk: @realDonaldTrump is Xmas present I want 2016! Not just a Happy Holiday! The MOST IMPORTENT day in the world if #TRUMP is PREZ!\""},{"text":"\"@teresayarbor: @realDonaldTrump love that you say #MerryChristmas, not just Happy Holidays!\""},{"text":"So many people think I will not run for President.Wow, I wonder what the response will be if I do. Even the haters and losers will be happy!"},{"text":"\"@jimmycapo65: @realDonaldTrump I would work ur campaign and u wouldn't even have to pay me, Happy Holidays!\""},{"text":"\"@BernardCastro3: @realDonaldTrump Wishing you Happy Holidays. Can't wait for the #CelebrityApprentice to start in January.\""},{"text":"\"@nancypa14679248: @realDonaldTrump @bisignano912704 Happy Holiday to you and your loved ones,God Bless\"  Thank you!"},{"text":"\"@StacieLarson777: @foxandfriends Im waiting....4..President Trump!!!!!! :)...I love when u come on fox n friends!! Good Morning..\""},{"text":"\"@SHMann55:DonaldTrump Good Morning Mr. Trump just heard you on @foxandfriends. El Presidente, Holder, Sharpton have set race back 30 years\""},{"text":"\"@GClass914: thanks for the good word @realdonaldtrump http://t.co/nAH5RpMVnb\""},{"text":"The Jets should have let them score to get the number one draft pick, who will be really good. It will just never change for them!"},{"text":"\"@PianoBecca: @realDonaldTrump is so Right about everything for SURE! Not olny is he smart he has BUSINESS EXPERENCE that makes good #Prez\""},{"text":"People are really unhappy with the endless security checks at the new World Trade Center. Durst is a terrible manager. Tenants furious!"},{"text":"\"@joelde: You RT'ing these is the equivalent to band's tweeting good reviews. Do you ever tire of patting yourself on the back?\"  No, never!"},{"text":"\"@Youxia88: Good idea. RT @realDonaldTrump: \"@harpers1niter: @realDonaldTrump Let's just put you in the white House now.\"\""},{"text":"\"@tweetbarryb: Looking good in Vegas today @realDonaldTrump http://t.co/ts2q8yserk\""},{"text":"\"@iosuahh: It feels good working overtime &amp; knowing your next check is gonna make you feel like Donald Trump for a day. 😂\"  Cute!"},{"text":"\"@FLGorman_HB: Lunch w Donald Trump @icsc New York National Dealmaking. Really good.\""},{"text":"\"@kyleraccio: @realDonaldTrump The View was terrible today. I feel sad for ABC!\"  Rosie killed what was once a very good show - no ratings!"},{"text":"\"@Jagbarron Finally get to watch one of my favorite shows again trailer looks good  #celebrityapprentice   http://t.co/jVDSR2rVEw …"},{"text":"\"@amegarity: @realDonaldTrump was down in Doonbeg on sunday, stunning place, any chance of a good deal on a room for me and my good wife."},{"text":"\"@SaggaSwagga: @realDonaldTrump I believe in America and I believe in you Mr.Trump! You will bring REAL (GOOD) change to America! #Trump2016"},{"text":"\"@MsVivicaFox: @LeezaGibbons @Jules_2010 @ApprenticeNBC  @IanZiering @lorenzolamas @kevinjonas Miss ya too darling! Happy Holidays! TTYS;)\""},{"text":"\"@MSmoldt: @realDonaldTrump \"The American dream is alive and well\" good interview on @FoxNews this AM #GYTU ☝️\""},{"text":"\"@ronmeier123: @realdonaldtrump You can never be wrong if you vote for MR. TRUMP in 2016! He is the RIGHT MAN for President! Happy Sunday!\""},{"text":"Happy Thanksgiving - I hope everyone can get together to MAKE AMERICA GREAT AGAIN! It won't be easy, nothing is, but it can be done."},{"text":"\"@UP1775: @RitaEvelynYanez @realDonaldTrump yeah true, but hey he would be a good president\""},{"text":"\"@Longviewmayor: @realDonaldTrump you're up at 5 am and you're awake at 1am. How do you have so much energy? Seriously!?\" Good genes!"},{"text":"\"@SHMann55: @realDonaldTrump Good Morning Mr. Trump! Your comment's were dead on this a.m. on F&amp;F\""},{"text":"\"@iamnextroom: @realDonaldTrump I decided that I'll choose to live in the US when you are the president.\"  Good choice!"},{"text":".@aaronschock  Aaron, it was great to meet you at Trump Tower. Also, really good job on television!"},{"text":"\"@spicedevilz: @realDonaldTrump How did you keep your hair looking good over the decades?\" Wow, one of the few nice comments about my hair!"},{"text":"“Be tough, be smart, be personable, but don’t take things personally. That’s good business.” – Think Like a Champion"},{"text":"\"@joblink31: @realDonaldTrump Trump is so important, that every time he's makes a decision, it's good for the economy .\""},{"text":"“Remember that some things are worth waiting for. Plans can change, sometimes for good reason.” – Trump Never Give Up"},{"text":"\"@frankboesch: Sad cause my wife &amp; I checked out of @TrumpDoral today after 4 amazing days. Happy cause we're planning our return visit!\""},{"text":"Happy #VeteransDay to all.  And it is nice to have Sgt. Andrew Tahmooressi back home."},{"text":"Happy 5th Anniversary to @TrumpWaikiki&lt;https://t.co/Lu0Heblb0W&gt;! Can't believe it's already been 5 years.."},{"text":"\"@USNewsTravel: .@TrumpChicago's location &amp; modern rooms make visitors feel like they're livin' the good life: http://t.co/QK8bsIVi9l\""},{"text":"\"@THEPIZZAPOPO: It feels like I've been waiting for the @ApprenticeNBC FOREVER!!!!!! I'm so happy and ready for this season @realDonaldTrump"},{"text":"\"@Chancesare420: @realDonaldTrump Good morning Big Guy... Here's hoping we both make a bundle of money today. : )\""},{"text":"\"@BenPack3521: @Espngreeny @realDonaldTrump @FrankCaliendo That was very well done! Thanks for a good laugh to start the day!\""},{"text":"\"@ChiliDawgFan: @Espngreeny  @FrankCaliendo Outstanding. Maybe Frank could do @criscarter80 someday. And Mr. Trump is a good sport.\""},{"text":"\"@ReglarWiglar:  @heelshoops23 Trump would make a very, very good POTUS. He is really, really smart and makes great business decisions.\""},{"text":"\"@Mitchwa: @realDonaldTrump What a great night for the good guys. I'm worried about Obama using executive power to pass immigration law\""},{"text":"\"@Debralynnxx:  @STN_Entertain @GeraldoRivera @kevinjonas Well, that is quite the line-up ! Predict very good ratings for you Mr. Trump !\""},{"text":"Good luck to @joniernst. You will make a wonderful Senator."},{"text":"@ThomTillis, you have run a wonderful campaign. Good luck today!"},{"text":"\"@PGWELLMAN: You have influenced me to become an entrepreneur, I am still preparing my business plan. You're a good man, and thank you.\""},{"text":"\"@CahlRStorrie: After watching @hannityshow w/ @realDonaldTrump on it, made me realise how good a president Trump will make #Trump2016\""},{"text":"\"@carguy_95 Have you written anything torwards young adults/college students on how to be successful?\" Think Like a Champion is a good start"},{"text":"Happy Halloween! http://t.co/FGwbbjK21A"},{"text":"Happy Birthday @IvankaTrump! You are an amazing daughter!"},{"text":"\"@TheRealPWeight: You did say that when we leave bad guys will take the oil in Iraq.. ISIS controls a lot of it today. Good foresight.\""},{"text":"\"@cindylestrada: @seanhannity @realDonaldTrump good interview. we definitely need more conservatives to speak up.\""},{"text":"\"@MaiNu586: #hannity @realDonaldTrump You, good sir, are a great American and created a lot of jobs, not like a looney lib! God bless.\""},{"text":"\"@xoxo_La_La_xoxo: @realDonaldTrump #Trump4President ##Trump2016 please run for president you can do so much good\""},{"text":"\"@Theramenes: @foxandfriends  Good job @realDonaldTrump for not being afraid to speak truth, that is what people need to hear is truth.\""},{"text":"There is a good possibility that a person who treated patients in West Africa and who FLEW into New York has Ebola. Touched many, bedlam!"},{"text":"\"@MELANIATRUMP: Good night Washington D.C. 🇺🇸 http://t.co/cS2XfGVjnH\""},{"text":"\"@HabsHappy: Starting 2believe Ujust may want 2run for Presidency after-all. Uknow what they say 'Reach For The 50 Stars' We Need CHANGE\""},{"text":"\"@sunglasspros: @realDonaldTrump @SteveKingIA Good job Donald! We need you to get more involved!!! Way to go!!\""},{"text":"\"@shawnrss: @realDonaldTrump @shanevanderhart I vote for Trump to make us all rich.\" Good call."},{"text":"\"@shanevanderhart:  @realDonaldTrump in Iowa: Next President Needs to Be Great, Not Just Good - http://t.co/NO8au7SydM #iagop #2016\""},{"text":"\"@mattyms: @realDonaldTrump it's my birthday today. The best present you can give me is to be my next President.\"  Happy birthday!"},{"text":"\"If you never want to be criticized, for goodness' sake don't do anything new.\" -- Jeff Bezos"},{"text":"Happy belated birthday to Chris Wallace! Chris does a great job every week on @FoxNewsSunday. Like father, like son."},{"text":"The people of Buffalo should be happy Terry Pegula got the team but I hope he does better w/the Bills than he has w/the Sabres. Good luck!"},{"text":"Wow. @nfl ratings are down big league. Glad I didn't get the Bills. Rather be lucky than good."},{"text":"\"@joshhobson: Hey, the sign looks good this morning! See it everyday, as I work around the corner at SOUTHCOM. http://t.co/GI37XyFAzP\"Thanks"},{"text":"Something very important, and indeed society changing, may come out of the Ebola epidemic that will be a very good thing: NO SHAKING HANDS!"},{"text":"\"@jrhennessy: There's only one man I'd trust to fight ISIS. That's right: @realDonaldTrump\"  Good choice, thanks."},{"text":"\"@Joeyssmyth @realDonaldTrump played turnberry ailsa today it was awesome good job\""},{"text":"\"@RockChristopher: I wasnt satisfied just to earn a good living. I was looking to make a statement. ~ Donald Trump"},{"text":".@Rosie—No offense, and good luck on the new show, but remember, you started it!    http://t.co/Ag3TyZZxOh"},{"text":"Happy New Year to all my Jewish friends celebrating the holiday."},{"text":"\"@jdbailey08: @realDonaldTrump you're my hero. Keep up the good work. #TrumpForPresident\""},{"text":"\"@socalmike_SD: @realDonaldTrump @foxandfriends Why do all u haters follow Trump...pathetic\" Good question!"},{"text":"Good morning. I will be on Fox and Friends at 7.00 (30 minutes). Enjoy! @foxandfriends"},{"text":"\"@AndyAy:DonaldTrump Good to hear news of you and Turnberry in Ayrshire Scotland. South Ayrshire has best weather in Scotland,so good choice"},{"text":"Roger Goodell must stop apologizing to everyone who will listen and toughen up. His street smart players are laughing at him and the NFL!"},{"text":"\"@_spock: RT @mrgrumpystephen: Hi @realDonaldTrump it’s my birthday any chance of a retweet\"  Happy birthday!"},{"text":"\"@VinceMcMahon: Way to go @realDonaldTrump, what a good sport. http://t.co/qqxRaTlKpP\"  Vince, only for you!"},{"text":"\"@iMarle64: @MikeandMike Wow,an actual good guest😳 @RealDonaldTrump keeping it real on his view of the #NFL🏈 #refreshing\""},{"text":"\"@coreymccrack3n: @realDonaldTrump had a good point this morning on @MikeAndMike. The refs are flag happy, and make watching games boring.\""},{"text":"I left Atlantic City years ago, good timing. Now I may buy back in, at much lower price,  to save Plaza &amp; Taj. They were run badly by funds!"},{"text":"Good luck to the people of Scotland, whatever their decision may be on Thursday. The whole world is watching—really exciting!"},{"text":"Attention Arnold Palmer:  Happy Birthday, Arnold. There is no one like you --The King! @KingdomMag  http://t.co/Cde5TciZdw"},{"text":"\"@Cringe_Fringe @Joan_Rivers You were a good friend to Joan and I enjoyed the Apprentice show with her.  Thanks, Mr. Trump.\" Thank you."},{"text":"\"@JoePerry: Always good to see @realDonaldTrump Rock and Rollin' at the Aerosmith show.\" Joe--it was great meeting you--fantastic concert."},{"text":"\"@216th: @realDonaldTrump you made joan rivers very happy when u rightfully chose her to win apprentice.\""},{"text":"Remember, anything you read about Atlantic City has nothing to do with me. I sold years ago and left. Good timing but very sad!"},{"text":"\"@OnlineOnTheAir: My friend's son, immediate #autism after #vaccines 10 yrs ago. So sad. Keep up good work Nay-sayers will understand soon.\""},{"text":"\"@rcstaley @LoisWeiss @realDonaldTrump I loved your ALS  challenge! I'm so happy that you showed real men can do it! Obama NOT!\" Thanks"},{"text":"\"@lansdalepadre @realDonaldTrump what a great sport!!  Good job!! #ALSIceBucketChallenge\"  Thank you."},{"text":"\"@StFFP We just received a #DoodleForHunger by @realDonaldTrump for our 2014 Celebrity #Art Auction:   http://t.co/Uk4qE20rNN\" Good cause."},{"text":"\"@VinceMcMahon Way to go @realDonaldTrump, what a good sport.  http://t.co/qqxRaTlKpP\" Thanks Vince, but you are the greatest of them all."},{"text":"\"AngieApon I think you should try wearing your hair combed back.  It looked good when you slicked it back Mr. Trump ;) #ALS\" May happen, thx"},{"text":"\"@bradcooney1:Wise words. My Nephew is a US Marine soon to be heading into harms way again. It's gonna be a long 7 months for us.\" Good luck"},{"text":"\"@EricTrump  I officially accept @realDonaldTrump's #ALSIceBucketChallenge...\" Very good Eric, I am always proud of you  #StrikeOutALS"},{"text":"Good luck and best wishes to my dear friend, the wonderful and very talented Joan Rivers!  Winner of Celebrity Apprentice, amazing woman."},{"text":"I will be doing the A.L.S. Ice Bucket Challenge this morning on twitter. It is not something I look forward to doing but is for a good cause"},{"text":"\"@kornegay_danna: @EmpireofSocial I love Donald Trump. People are just jealous. I admire his family. Good man that would be a great Potus\""},{"text":"Congratulations to @Graeme_McDowell and @kristinstape. Your baby has seriously good genes, will be a champ!"},{"text":"\"@Spongebob501R: @HomerJSimpson Good job, Homer! @realDonaldTrump Good luck!\"  Thanks, I'll need it!"},{"text":"\"@amirite_: @realDonaldTrump never got why seth meyers was funny, good point!\""},{"text":"Our politically correct country will read the ISIS terrorists who beheaded the reporter their Miranda Rights prior to good food &amp; care!"},{"text":"Re Negotiation: Persistence can go a long way. Being stubborn can be good. The key is to know when to loosen up."},{"text":"\"@SnoopyBarber: it'd be a good thing for USA if @realDonaldTrump be POTUS in 2016.\""},{"text":"“Diligence is the mother of good luck.”  - Benjamin Franklin"},{"text":"\"@ash_talks: Have to meet @realDonaldTrump in the morning. Good night.\""},{"text":"\"@bahia6085: @realDonaldTrump Saw Show on IVANKA Fox News. Very good. She is a great role model--like you,\" Thank you!"},{"text":"\"@BoogBannon: Can't wait till @realDonaldTrump is president\" I don't blame you, things would get really good, really fast!"},{"text":"Vision remains vision until you focus, do the work, and bring it down to earth where it will do some good."},{"text":"\"@happygirl71929: Our current government doesn't have the balls to do what needs to be done....Yet ANOTHER reason for you to Run!\""},{"text":"\"@BigBoie7531:  To all the liberal do gooders, this is the Plague you idiots! No cure! @ You may have confidence in the CDC, but I don't!\""},{"text":"\"@IntegralDevices: @realDonaldTrump @IR7DJ2 @buffalobills Congrats #NFL good choice\""},{"text":"\"@RickieFowlerPGA: Good fun yesterday slapping it around Trump International Golf Links with @skovy14 and Sammy… http://t.co/pNl5bDPhan\""},{"text":"\"@hillerjohn @DonaldJTrumpJr @realDonaldTrump @IvankaTrump @EricTrump 'good looking family.' \" Thank  you."},{"text":"Making money is art and working is art and good business is the best art. -- Andy Warhol"},{"text":"\"@JackEvansWard2 Happy to join @realDonaldTrump at kickoff of Hotel at the Old Post Office http://t.co/ckp6FlUpUf\"  Thx for being with us!"},{"text":"\"@DragonMamba: @steve_hofmeyr \" You have enemies? Good. That means you've stood up for something sometime in your life. Winston Churchill\""},{"text":"You have enemies? Good. That means you've stood up for something, sometime in your life. -- Winston Churchill"},{"text":"\"@McDeLLaware: How would Donald Trump handle Vladimir Putin? http://t.co/skxbin7moS\"  Easily and with good results for U.S."},{"text":"\"@TheDougGrant: @realDonaldTrump Good advice for Romney during the last election - maybe this time he will listen.\""},{"text":"Diligence is the mother of good luck. -- Benjamin Franklin"},{"text":"\"@jimjacobs18: @realDonaldTrump are you overqualified to be president since you have actually held a job???? :)\" A very good question!"},{"text":"\"@BackOnTrackUSA:We should be placing tariffs on Mexican goods coming into this country to reimburse the American taxpayer&amp;secure the border"},{"text":"\"@txblondegrad: @realDonaldTrump @IMill5 I'd vote for Trump in a heartbeat. No question.\" Good decision."},{"text":"\"@linnie13: @realDonaldTrump Very good points made tonight on Greta.\""},{"text":"\"@GoodGuyKuchar: Keep fighting for the #American flag @realDonaldTrump!\" I will!"},{"text":"Happy 4th of July to everyone,  including the haters and losers!"},{"text":"\"@CaledonianGolf: Also good to see @realDonaldTrump not being drawn into independence debate. Either way, Trump Turnberry is a winner.\""},{"text":"Eli Wallach was a great actor and a great guy. My opinion-- his performance in The Good the Bad and the Ugly was his all time best!"},{"text":"\"@GZervs: All I want for my birthday is for @realDonaldTrump to wish me a happy birthday!\"  Happy birthday."},{"text":"\"@_MHall:  Flew through LGA on Friday and got a good look at your amazing plane. To bad LGA is such a dump. Not a great welcome to NYC\""},{"text":"\"@Gunny44: @realDonaldTrump @CarrollGroupCHI @TrumpChicago classic lettering gives it a good classy feel\"  Thanks."},{"text":"\"@Mike_Sherwood03: I love the new sign in Chicago! It makes my drive down Lakeshore Drive that much better! Keep up the good work!\" Thanks."},{"text":"\"@Pearls_n_Bows: \"@realDonaldTrump: Be tough, be smart, be personable, but don't take things personally. That's good business.\"\""},{"text":"\"@BobLafleur1 @realDonaldTrump good job on @HowardStern you really are an inspiration you need your own radio show!\"  Thank you."},{"text":"\"@th4tk1dryan: @realDonaldTrump brought up a lot of good points on @sternshow this morning, I really hope he runs for president\""},{"text":"\"@JohnMarsicano: @realDonaldTrump on @sternshow was certainly an entertaining start to my morning.\"  Good!"},{"text":"\"@grapewhiskey: @sternshow  Can't believe all the hate trump gets. Hearing him and @HowardStern go back&amp;forth is good radio simple as that!\""},{"text":"\"@FlightAJ: Hey @realDonaldTrump what is your view on George Bush?\" He got us into Iraq instead of making America great again. Not good!"},{"text":"I bought the great Turnberry Resort today - considered by many to have the greatest golf course in the World. I will take good care of it!"},{"text":"\"@Theramenes:  Get @realDonaldTrump into WH He can lead and fix anything He is also strong and unafraid to do what is good for people.\""},{"text":"\"@NeecieMarie: @realDonaldTrump I concur~ Your children are indeed exemplary~ grace, &amp; poise~ well done, &amp; #HappyFathersDay Sir.\" Thanks."},{"text":"\"@davidcanlas88:  I wish you would advice the Kardashians and the Jenner sisters on child rearing. You did a good job upbringing your girl.\""},{"text":"\"@magnumCJ: @realDonaldTrump told the truth all day about Pinehurst 2. It is just not a good looking US Open course.\"  So true!"},{"text":"\"@quotedojo: A little more moderation would be good. Of course, my life hasn't exactly been one of moderation. ~Donald Trump\""},{"text":"\"@benSEXT0N: @Cfeetsrevenge @LukeDonald @realDonaldTrump course didn't look good in HD just saying\"  No, it looked terrible, bad for golf!"},{"text":"\"@MomMom: Just saw the video of the bus driver saving the woman from jumping off overpass. You gave him a reward....good job Donald!\" Thanks"},{"text":"I would like to wish all fathers, even the haters and losers, a very happy Fathers Day."},{"text":"\"@zp_3: @realDonaldTrump Happy Birthday from your Trump Towers in West Palm. Keep up the good work!\" A great place, thanks."},{"text":"\"@edcloud9: No one man can turn this country around and get us back on track. But one @realDonaldTrump can! 2016! HappyBirthday!"},{"text":"\"@rgb0y: @realDonaldTrump happy birthday sir! Nothing but respect for what you've accomplished.\"  Thanks."},{"text":"\"@Kirby_Weasley: @realDonaldTrump Happy Birthday to one of the most entertaining and smartest men alive.\"  Thanks."},{"text":"\"@SKMcCrty: Happy Birthday, Mr. @realDonaldTrump, you have been a great mentor in my life! #teamskm\"Thanks Stephen"},{"text":"\"@noahhoch: Happy birthday to @realDonaldTrump the wisest man in the US. #2016\"  Thanks."},{"text":"\"@CareyTim6: Happy birthday to @realDonaldTrump, the man we need to lead us in the future. #Trump2016\"  Thank you."},{"text":"\"@AAndreakis: @realDonaldTrump Happy B-Day Mr. Trump, you are a great inspiration for many people around the world! May God Bless You Mr. T!"},{"text":"\"@der_karsten: @realDonaldTrump Happy birthday to the best businessman in the world\"  Thank you."},{"text":"\"@jwkeen: Happy Birthday to The Donald @realDonaldTrump. It will take men like him to make the USA great again. #2016.\" Thanks."},{"text":"\"@tx_shaun: @realDonaldTrump happy birthday Donald! Thanks for never being afraid to tell it like it is\""},{"text":"\"@keegster51: HAPPY BIRTHDAY to my idol @realDonaldTrump! I hope one day to be as successful as you! #TRUMP2016\"  Work hard!"},{"text":"\"@felberjosh: Happy #Birthday to an awesome business icon! Read my first Trump book at 14 which jump started my business success. Thanks."},{"text":"\"@commishjoe: Happy Birthday to successful businessman and true American success story. He certainly tells it like it is! Thank you."},{"text":"\"@MoshoodAluko: Happy birthday to an American icon and a real estate el-supremo... @realDonaldTrump\"  Thanks."},{"text":"\"@ruvie18: Happy Birthday @realDonaldTrump,my best author, I never get tired of reading\" think big\" and the apprentice!"},{"text":"\"@ryanbushby: @realDonaldTrump Happy birthday to the best businessman in America!\"  Thank you."},{"text":"\"@warrencasselljr: Happy Birthday to @realDonaldTrump. I wish you many more success! You are greatness!\"  Thanks."},{"text":"\"@cjlrx: @realDonaldTrump Happy Birthday to an American icon!\"  Thank you."},{"text":"\"@ColinSWood: @realDonaldTrump The TRUMP sign looks great! The haters are giving you good publicity though!\""},{"text":"\"@ColinSWood: @realDonaldTrump The TRUMP sign looks great! The haters are giving you good publicity though!\""},{"text":"\"@nikkio: I know I'm a day early for your weekend celebrations-Happy Birthday Donald! Looking forward to your surprises for 2014-2015 Thanks"},{"text":"\"@lifesanthem @TrumpVancouver Good news. 1 of the most exciting people coming to 1 of the most exciting cities in the world!\" A great place!"},{"text":"\"@GOOD_ggg  @TrumpGolf With GOOD service at his clubs imagine the service Mr Trump could give American people as Pres!\"  True!"},{"text":"\"@david_j_roth: \"I was never one who looked at success as bad. For me, success was always good. I loved it, and still do.\"  Donald Trump"},{"text":"Happy 30th Birthday #Ghostbusters! It was great to have @TrumpTowerNY be a part of the series. http://t.co/PNGpHifMNI"},{"text":"\"@GleisisSantos Reading @realDonaldTrump 's Think Like a Champion . What a great and inspirational book.\"  Thanks, good luck!"},{"text":"The five Taliban leaders released for a deserter must really be laughing and having a good time right now. They are saying how dumb U.S. is!"},{"text":"\"@Ralphige: Who knew al Qaeda had such good negotiators. Impressive 5 for 1 against the mighty USA @realDonaldTrump\""},{"text":"\"@iPlanned: \"A good #plan violently executed now is better than a perfect #plan next week.\" - General George S. Patton"},{"text":"\"@deniseprobe: Your time on the David letterman show was so much more interesting than dr Phil on kimmel show. You look good. I'd vote 4 u\""},{"text":"\"@amitgupta9 @realDonaldTrump is the visionary with the midas touch. America, Good times are on their way...\"  Thanks."},{"text":"\"@JoyceGoodman64: @realDonaldTrump running the US is much like running a business, who better at that than The Donald? #Trump2016\""},{"text":"\"@happygirl71929: @realDonaldTrump If you don't run in 2016..... I'm moving to Canada..... Please help us Mr. Trump\"  Don't move so fast!"},{"text":"\"@not_that_actor:  @IGotAngelEyes @JoyceGoodman64 If Donald doesn't run, the US will never regain its #1 world super-power status\" True!"},{"text":"\"@RowdyRoadie11: @realDonaldTrump @JoyceGoodman64 I agree mr trump. I am a veteran and can't stand what is happening\""},{"text":"\"@IGotAngelEyes: @realDonaldTrump @JoyceGoodman64 Mr. Trump Is A Fine Man &amp; So Intelligent &amp; Dnt Bk Down. I Wid B The 1st N Line 2 Vote."},{"text":"\"@JoyceGoodman64: @realDonaldTrump run Mr. Trump...please we need you!\""},{"text":"\"@EllaKAgency @realDonaldTrump saw the Facebook specs for the new trump tower in Dubai looking good!!\"  Thanks."},{"text":"\"@Grizz524  @realDonaldTrump thanks for getting me through finals week Mr. Trump\"  Good luck!"},{"text":"Just returned from Ireland, Scotland and Dubai. Amazing trip, great places--but always good to be back."},{"text":"I really like Jay Z but there is trouble in paradise. When his wife's sister starts whacking him, not good! No help from B leads to a mess."},{"text":"\"@TrumpPhillyGM: One week from today, we open our amazing pool #trumpnationalphiladelphia! Thank you @EricTrump!  GOOD LUCK ERIC Q!"},{"text":"Teams are making a big mistake not taking Johnny Manziel - he is going to be really good (and exciting to watch)."},{"text":"@dallascowboys   Jerry, GREAT pick - you will have a really good season!"},{"text":"“No matter how good you get you can always get better and that's the exciting part.” - @TigerWoods"},{"text":"\"@Double_A2011: Yoo @Beyonce and Jayz On The RunTour tickets are way to high they think everywhere got Donald trump money 🙅🙅🙅🙅\" Not good"},{"text":"\"@salpie  @realDonaldTrump and how many of the jobs report uptick is due to Feds hiring #Obamacare exchange temps!\"  Good question. ?"},{"text":".@jamieaydt  Happy Birthday Jamie!"},{"text":"If you have passion, confidence, resilience, &amp; vision, you could become an entrepreneur. Add focus to the list &amp; you're off to a good start"},{"text":"\"@KingMeeetch: @realDonaldTrump celebrity, business man, or politician? Who cares, you're damn good at all three\""},{"text":".@McIlroyRory  Thanks for your nice note - they love you at Trump National Doral. You are looking good - will have a GREAT year!"},{"text":"\"@Chuck_Kelly13 @frankpro @HarvickFan_4  He IS a damn good businessman and a wise investor. I'd say he'd run a great team.\" @nflcommish"},{"text":"\"@Prayformetoo: @realDonaldTrump I detest @ariannahuff with a passion!\"   And for good reason, she is a complete phoney!"},{"text":"\"@906reynolds: Donald Trump is a leader and savvy businessman, two qualities we lack and desperately need in DC.\" Thank you, HAPPY EASTER!"},{"text":"\"@Joshua_Weaver_: The @nfl needs the @realDonaldTrump! Happy Easter!\" @nflcommish"},{"text":"HAPPY EASTER - HAVE A GREAT DAY!"},{"text":"\"@irondan_93: No matter what the occasion, you always feel confident in a @realDonaldTrump button down #almostgraduating\" Great, good luck."},{"text":"Have to go now to sign a great and job producing deal! Good night."},{"text":"\"@markmilliken21: @realDonaldTrump @GeneralTso316 I own a few DT ties from Macy's, best ties I ever purchased...good stuff!!\"  Thanks."},{"text":"\"@MrJPL: An Aussie @TrumpWaikiki, such an amazing place. Well done @realDonaldTrump @IvankaTrump @DonaldJTrumpJr @EricTrump &amp; happy Easter"},{"text":"\"@Humphreychabu: @realDonaldTrump thanx DJT, ua my inspiration! Happy holidays\""},{"text":"\"@InTheElections: @realDonaldTrump A very happy, blessed Easter to you, Mr. Trump.\"  Thank you, and you also!"},{"text":"I will be working late into the evening closing a big real estate deal—soon to be announced. Happy Easter and/or Holiday to all."},{"text":"Remember, negotiations are fluid. Remain calm and don’t settle easily. If you have the goods, you will ultimately win."},{"text":"\"@RustyWynnewood:  Great day at Trump National in Charlotte. You took a good club and made it great. Well done sir. http://t.co/NeAQ8xZkgy\""},{"text":"\"@HappyGuy201: I honestly think @realDonaldTrump would fix the mess this country has become.\"  I could and would'"},{"text":"\"@TeddiLocke: @realDonaldTrump Absolutely! Plz Run! Bring Respect back to the Presidency with integrity &amp; good moral standing!!\""},{"text":"\"@DenizTweets @realDonaldTrump 16 and finished all your books. Awesome.\" Great--good luck!"},{"text":"\"@rossdstarkey: Good luck to everyone playing the @SMOpen this week, watch out for @realDonaldTrump at Doonbeg http://t.co/jnhORNbxxv\"THANKS"},{"text":"It's 4.35 a.m. and I am working on a very exciting (and hopefully very good) deal - a major resort. THE HARDER I WORK, THE LUCKIER I GET!"},{"text":"\"@BilldaBeastII: @realDonaldTrump you done good in L.A. They need to play a PGA tourney here... for real! http://t.co/pTBzlPxcWf\"  Thanks!"},{"text":"\"@jplw70: @realDonaldTrump @Lexi So happy for her too, she played super!\"  She is a great player and a great person!"},{"text":"\"@LUTHERVII: @realDonaldTrump do you think Bush Jr. was a good President?\" No, not even close!"},{"text":"\"@CMHollon:                @MCuban being rejected by #MLB (Bud Selig) is a good thing http://t.co/OyUxD0e2gM\"  A good decision!"},{"text":"\"@PbrunnerRr: @realDonaldTrump You should go to Wrestle Manina. Its Good for business. Us Fans want you as President\""},{"text":"\"@JHKING17: @realDonaldTrump please do our nation a favor and run for president!! #trump2016\"  Somebody good better do that, and fast!"},{"text":"\"@graciesavy: @HoustonGunn the next Donald Trump! Still marveling at your accomplishments, keep up the good work :)\"  Thank you."},{"text":"\"@__HotDawgs  @realDonaldTrump hey can we get a shout out for a start up company in our Entrepreneurship class\" Work hard and good luck!"},{"text":"\"@TpGraf82 @realDonaldTrump I'm training my employees today wearing a #trumpcollection #tie #shirt feeling good and powerful!\"   Great!"},{"text":"\"@xadusx @realDonaldTrump @SamJabbo or \"Never give up\" they're all my favorite though, read them all!\" Thanks--good luck!"},{"text":".@MagicJohnson  Good luck with the Dodgers this season, if they were like you they would never lose a game!"},{"text":"\"@pwnza: @realDonaldTrump why aren't you president yet?\"  A very good question!"},{"text":"For Entrepreneurs: A good question to ask yourself –“What can I provide that does not yet exist?”"},{"text":"\"@SamJabbo  @realDonaldTrump i haven't read any of your books yet, which one should i start with?\" The Art of the Deal is a good start."},{"text":"Healthy young child goes to doctor, gets pumped with massive shot of many vaccines, doesn't feel good and changes - AUTISM. Many such cases!"},{"text":"\"@SamJabbo Trump you inspire me to be successful everyday.\"  Great--good luck!"},{"text":"\"@meade1214 @realDonaldTrump trump for office!! He's a good man!\" I am?"},{"text":"\"You have enemies? Good. That means you've stood up for something, sometime in your life.\" --  Winston Churchill"},{"text":"Not good or smart for Obama to be calling Russia a \"regional\" power or to mention the concept of a nuclear weapon going off in NYC."},{"text":"\"He that is good for making excuses is seldom good for anything else.\" -- \nBenjamin Franklin"},{"text":"It's almost like the United States has no President - we are a rudderless ship heading for a major disaster. Good luck everyone!"},{"text":"\"@70sBaseball A great sports fan &amp; business man! DT &amp; his son w/George &amp; Billy during Spring Training http://t.co/DhUK4RQPxY\" Good memories!"},{"text":"There are many editorial writers that are good, some great, &amp; some bad. But the least talented of all is frumpy Gail Collins of NYTimes."},{"text":"\"@mattmiller728                         @realDonaldTrump I love all of your books very helpful\"  Thanks, good luck!"},{"text":"I’ve been watching very little @CNBC lately—the good news is I’m switching over to  @BloombergNews and @FoxNews."},{"text":"\"@jtthebossman: @realDonaldTrump Keep fighting the good fight. You speak the truth. Trump 2016!!!\""},{"text":"\"@IbeJakeB    Just read  Midas Touch cover2cover. Tons of notes for @FlowWraps thank you &amp; Robert too!\" Thank you, good luck!"},{"text":"@CharlieRymerGC  Charlie, sounds good to me!"},{"text":"@TheEllenShow  Ellen, you should get rid of Andy Lassner - the guy has absolutely no imagination or talent. Good try last night!"},{"text":"I have always liked Ellen, done her show numerous times, but she was not good last night - fumbling and stumbling!"},{"text":"M.M. is a good choice - also, nice guy! #Oscars"},{"text":"I should host the #Oscars just to shake things up - this is not good!"},{"text":"\"@barrettag: Had a meeting with an ex Trump employee yesterday who went on for hrs about how good &amp; nice you are to employees. So cool.\""},{"text":"\"@BARMES_andnoble: If donald trump runs for president I will be beyond happy...if he wins I will be beyond, beyond happy\" So nice, thanks!"},{"text":"\"@leoncekakore: @realDonaldTrump what is the secret behind your success?\" Good ideas and concepts but, beyond everything, I NEVER QUIT!"},{"text":"\"@KieranLalor: .@realDonaldTrump why didn't you just add \"Be sure to tune in to NBC this Fall for the Apprentice\"?\" A very good point!"},{"text":"\"@minlarrycornel: @realDonaldTrump @TrumpDoral Spectacular! Please keep up the good work @minlarrycornel\" Thank you."},{"text":"\"@DatAdamGuy                         \n@realDonaldTrump @TrumpSoHo hotel looks great, can't wait to build something just as epic\" Good luck!"},{"text":"\"@mbmirish: @realDonaldTrump congrats on your purchase in Ireland. How do I apply to work there?\" Write to manager Joseph - good luck!"},{"text":"\"@robertfritz308                       \n@realDonaldTrump can u please wish me a happy birthday! I'm a big fan! Thank you.\" Happy Birthday."},{"text":"\"Being good in business is the most fascinating kind of art.Making money is art &amp; working is art &amp; good business is the best art.\" A. Warhol"},{"text":"\"@LangWillar: @realDonaldTrump When? If it was before today, you're good. If you sold it today, not that good...\" I sold it last week!"},{"text":"\"@kwrcrow: @realDonaldTrump Tell it like it is Sir. Don't pull any punches. Keep up the good work.\" I will, thanks!"},{"text":"\"@ASenaPhotograph Today is my 61st birthday .The best gift I could receive is a retweet from you. Supporting you in 2016\" Happy Birthday."},{"text":"Happy Anniversary to my wonderful wife @MELANIATRUMP -- a truly great decision by me! http://t.co/eO9ei1njWv"},{"text":"\"@istoddisgood: @realDonaldTrump Even in Australia you're an inspiration!\"  Thanks!"},{"text":"\"@diamondman23: @realDonaldTrump this guy has got good stuff, your the man Trump, 130am and I'm up reading your book, http://t.co/M938F91fyf"},{"text":"\"@LacroixRoxane: @realDonaldTrump I believe you as all your Children are poised, respectful and genuine. Good job :)\"  Thanks Roxane!"},{"text":"To be really successful it is always good to have A COOL HEAD, WARM HEART AND BEAUTIFUL COMMON TOUCH!"},{"text":"\"@WLynton                            \nIt's my 30th B Day today, and a reply from you would be the best gift ever?\"  Happy Birthday"},{"text":"\"@robmotmotcally: @realDonaldTrump good day mr trump any updates on ur golf course in Aberdeen ?? #scotland\"  Record business!"},{"text":"\"@JacksBeach: @realDonaldTrump @jeffredman5 Trump's a strong leader. Letterman is a weak, passive, insecure person.\" Thanks, but he is good!"},{"text":"\"@ApprenticeNBC: Sending warm wishes to our dear friend @hollyrpeete on her birthday today! Happy birthday, Holly!"},{"text":"@cmo626 long time admirer.  Want to buy one of your books for a friend.  Any suggestions?\"  The Art of the Deal is a good start."},{"text":"\"@CarolynGoltman  It's my birthday and what a wonderful gift if I could get a retweet from such an inspirational man :-)\" Happy Birthday"},{"text":"Be tough, be smart, be personable, but don't take things personally. That's good business."},{"text":"Thanks everybody for the Happy Birthday greetings, but it’s actually the 10th birthday of The Apprentice. My birthday is June 14th...."},{"text":"\"@tylerthurston: Happy Birthday @realDonaldTrump, I always look forward to reading your advice.\".Great!"},{"text":"\"@debragarrett: @realDonaldTrump happy Birthday to one of my most admired men!!! Like a fine wine Mr. Trump🍷 Have a great Birthday! THANKS!"},{"text":"\"@PatKetley: Birthdays are special and a retweet from @realDonaldTrump would make it even more special\"  Happy Birthday!"},{"text":"\"@PIETIEV: @realDonaldTrump happy new year, Mr. Trump. Who was your role model before you became successful?\"  My father, Fred Trump."},{"text":"@Paula_White  One of the all-time greats - a true spiritual leader and wonderful person. Keep up the good fight!"},{"text":"Why didn’t Gates resign if he was so unhappy about what he was being told by Obama? The fact is, Iraq etc. have always been disasters!"},{"text":"\"@noahshappy: @realDonaldTrump very true comment Donald, I'm glad we have people like you in this day and age\""},{"text":"Have a happy, successful and healthy New Year!"},{"text":"Make sure to have fun and celebrate NYE with friends and family. Happy New Year everyone!"},{"text":"“Tomorrow is the first blank page of a 365-page book. Write a good one.” — @BradPaisley"},{"text":"\"@Bayojay: “@realDonaldTrump: A good head and a good heart are always a formidable combination. -- Nelson Mandela”\""},{"text":"I'd like to wish all of my friends--and even my many enemies--a very Merry Christmas and Happy New Year."},{"text":"\"@MrsDFRizzo7 good thing about Trump..NOT a snob. A straight-arrow w/street sense. Appeals to the masses..a leader all can appreciate\" Thx."},{"text":"\" @ZootmanTom                 \n@realDonaldTrump love your words of wisdom.  Merry Christmas &amp; happy new year\"  Thanks."},{"text":"I like Rob Astorino. He's a friend and really good guy. Sadly, he has ZERO chance of beating Cuomo and the 2 to 1 Dems for governor!"},{"text":"@ali_nugent  Good luck on your real estate test - you will be the biggest star of all!"},{"text":"I really like Nelson Mandela but South Africa is a crime ridden mess that is just waiting to explode-not a good situation for the people!"},{"text":"@BenCooner @RED931FM @SCOTTHALLNWO @Jassisidhu @b_coalition @WWE @0 Happy Birthday Sarina."},{"text":"\"@warrencasselljr                      \nWatching The Apprentice UK. Not as good as @realDonaldTrump's Apprentice.\" True!"},{"text":"P.S. - There is also something really good to say about humility. Being confident and humble is a great combination, maybe the best of all!"},{"text":"\"@happypaultk                     \n@realDonaldTrump look what heavy winds did to one of our Scottish wind turbines\" http://t.co/goNBiALCek"},{"text":"A good head and a good heart are always a formidable combination. -- Nelson Mandela"},{"text":"@MichaelArrante Happy Birthday"},{"text":"@puddlejumper365 You have to have passion for your work. That's most important. Then keep your focus intact. Good luck."},{"text":"HAPPY THANKSGIVING EVERYONE, ENJOY YOUR DAY!"},{"text":"Happy Thanksgiving to all--even the haters and losers!"},{"text":"@thesween_bean Thank you and Happy Thanksgiving."},{"text":"Mr. President, tell Iran to immediately free the CHRISTIAN PASTOR, as a sign of good faith, &amp; if they refuse break off talks--big sanctions"},{"text":"Vision remains vision until you focus, do the work, and bring it down to earth where it will do some good."},{"text":"Tom Brady is a good friend of mine, a great player, a great guy and a total winner! Fantastic comeback win-this is what our country needs!"},{"text":"Tom Brady has done a great job tonight-amazing New England comeback. Good game- not over yet!"},{"text":"@Pattycake77777 Happy Birthday!"},{"text":"\"@IanCKeffer: Rocking a @realDonaldTrump brand tie today for good measure. The picture does it no justice. Available @Macys  LOOKS GREAT!"},{"text":"I took some heat a long time ago when I said that George Zimmerman was a sicko and bad news. I know people and this guy is no good-trouble!"},{"text":"@not_that_actor   Very good!"},{"text":"\"@swetasamota:  “Be tough, be smart, be personable but don’t take things personally. That’s good business.” – Think Like a Champion\"  DJT"},{"text":"Rumor has it Apple is going to release iPhones with bigger screens. That's good news."},{"text":"“Be tough, be smart, be personable but don’t take things personally. That’s good business.” – Think Like a Champion"},{"text":"\"@iverson233: @realDonaldTrump can I run your hotels while you run the country ?\"  Sounds good to me!"},{"text":"\"@dany8ro: Aha RT \"@realDonaldTrump: You have good taste! \"@JayRobby: I love Bill Gates and Warren Buffet and Donald Trump. I so love them.\""},{"text":"ICYMI-- \"@MELANIATRUMP               \nReading newspapers and see...  #BillyGraham95 #happybirthday  @BillyGraham http://t.co/cdYT5btamI\""},{"text":"\"@Dexter_Cn: @realDonaldTrump President Trump sounds good to me\"  I'll tell you one thing, the country would be back on top again!  Thanks."},{"text":"\"@JayRobby: I love Bill Gates and Warren Buffet and Donald Trump. I so love them.\"  You have good taste!"},{"text":"\"@AarranMcPherson: @realDonaldTrump Good luck in your case against the wind turbines in Aberdeen Bay, most sensible Scots agree with you!\""},{"text":"Happy Veterans Day to ALL, in particular to the haters and losers who have no idea how lucky they are!!!"},{"text":"Drew Brees is having a great game - a fantastic quarterback and really good guy!"},{"text":"Our NOBEL PRIZE FOR PEACE president said \"I'm really good at killing people\" according to just out book Double Down. Can Oslo retract prize?"},{"text":"Will be on Fox &amp; Friends in five minutes - enjoy and good morning!"},{"text":"\"@BobKurlander: @realDonaldTrump Awesome new clock at Trump Jupiter. Would look so good between range, putting green.  Will happen."},{"text":"\"@MaryHukill: @realDonaldTrump The Donald J. Trump shirt from Macys looks GOOD!!! Sharp, good fabric, great color...it ROCKS!!! Classy look."},{"text":"Looks like a very good World Series game!"},{"text":"Yesterday was Matt Drudge's birthday --Happy Birthday @DRUDGE--and great job!"},{"text":"Good night everyone - sleep well and tomorrow have many victories!"},{"text":"@ManagersDiary   Thank you-always a good thought."},{"text":"\"@KaburuOle: “@realDonaldTrump: Good advice from my mother, Mary MacLeod Trump: “Trust in God and be true to yourself.””Awesome advice.\""},{"text":"Good advice from my mother, Mary MacLeod Trump: “Trust in God and be true to  yourself.”"},{"text":"Good advice from my father, Fred C. Trump:\n\"Know everything you can about what you're doing.\""},{"text":"@RajvirBoparai  Thanks, good luck."},{"text":".@VanityFair magazine is doing so poorly that they make even @NYMag look good. Graydon Carter should’ve been fired a long time ago."},{"text":"@Beliefheals  Thank you, good luck."},{"text":"@ArcturusRex4. Good question!"},{"text":"\"@TheMissis: @realDonaldTrump you're certainly giving @DanAmira and @NYMag publicity!! Even neg publicity is 'good' to some folk.\"  It's not"},{"text":"\"@MCdex207: See, @realDonaldTrump isn't as bad as people think. Great interview with @LateShow #goodguy\""},{"text":"\"@russellwestofa:  I'm a Democrat, have not been your biggest fan, but you made some very good points on the #Davidletterman show tonight.\""},{"text":".@BMP_Music_Event  Read 'Midas Touch' -- great book for entrepreneurs. Good luck!"},{"text":"@BMP_Music_Event  Read 'Midas Touch' -- great book for entrepreneurs. Good luck!"},{"text":"What a great day it was yesterday showing the public Trump Links at Ferry Point. I took over a disaster and made it GREAT! Good job to all!"},{"text":"@KarenAsh1560 @B_Cat41 Happy Birthday!"},{"text":"@BillNojay   Thank you for your great confidence! OUR STATE, LIKE OUR COUNTRY, IS IN SERIOUS TROUBLE. Keep up the good fight."},{"text":"@TiffanyATrump   Happy birthday to my baby - and keep up the great work at school. We are all proud of you!"},{"text":"@jacobmathews @PiersMorganLive Piers is a good man, even if we disagree with him."},{"text":"\"@Mary_Eg: @realDonaldTrump Sir, that was a great interview you had with Piers, keep up the good work sir\"  Thank you."},{"text":"\"@swooshl31: @realDonaldTrump TRUMP for president !!!!\"  Well, our Country would become very rich, very fast....and then, lot's of good!"},{"text":"A-Rod’s appeal will go nowhere. He will get a long suspension. Good for the @Yankees. And sends strong message to @MLB players."},{"text":"@growingupbryce Happy Birthday!"},{"text":"\"@bahia6085: @realDonaldTrump Don't think I can watch news anymore. O is doing such a good job of turning US into joke, I can't look anymore"},{"text":"\"@adammatruski: @realDonaldTrump stop investing in hotels and focus on our structure and your campaign for presidency\" Good point!"},{"text":"On Monday, ObamaCare kicks in with all goodies of 300% increased premiums, higher taxes and part-time replacement employees."},{"text":"\"@AnastasiaRubine: @realDonaldTrump ....I love people who can act to finish projects efficiently and fast. Good job!\" Thank you."},{"text":"I am so happy that I was able to do something really good for the Bronx - and lots of jobs!"},{"text":"@stretch33701  Good point, yes!"},{"text":"“A very good way to pave your own way to success is simply to work hard and to be diligent” – Think Like a Champion"},{"text":"Happy belated birthday wishes to @BarbaraJWalters. Barbara is terrific!"},{"text":"@ColetonEmr Happy Birthday!"},{"text":"In real estate, all locations can be enhanced through good marketing. Be smart!"},{"text":"The shale boom is saving our economy http://t.co/dnZXz1RyIU Good for jobs, national security &amp; trade balance. Frack Now &amp; Frack Fast!"},{"text":"@NeNeLeakes   NeNe asks me for advice and I am happy to oblige. Tonight at 9.00 on Bravo (and watch her ratings go through the roof!)."},{"text":"\"@SissyRichQueenb: Can't wait to Watch #IDreamofNene tonight I no @realDonaldTrump will give @NeNeLeakes some good Advice @Bravotv\"  WATCH!"},{"text":"I am a defender of @MileyCyrus, who I think is a good person (and not because she stays at my hotels), but last night's outfit must go!"},{"text":"The Emmys are sooooo boring!  Terrible show. I'm going to watch football! I already know the winners. Good night."},{"text":"@MelissaIl   Really good, thanks M."},{"text":"@PatsIntensity  Happy birthday!"},{"text":"Republicans must unite to defund Obamacare - it will drive our country into oblivion and, by the way, the healthcare is no good anyway!"},{"text":"\"@joshjame: Best Twitter follow I ever made: The Donald. Random 24/7 MT @realDonaldTrump: I believe that @MileyCyrus is a really good person"},{"text":"An important part of my (or anybody's) success is the ability to judge people. I believe that @MileyCyrus is a really good person."},{"text":"\"@mark_yamin: @realDonaldTrump Right! And who files a lawsuit on a Saturday anyway? Good call D.T. He thought you would settle because of pr"},{"text":"\"@Dropz11: @realDonaldTrump @Chloe_Eliise Unfortunately, the good men like Trump only run for President once a century.\"  Thank you."},{"text":"@seanhannity   Thanks Sean, keep up the good work!"},{"text":"\"@99awesomeone: @realDonaldTrump How about Wrestlemania 30 Donald vs Vince?!?! #WM30\"Sounds good to me, I already hold the record!"},{"text":"\"@Mbrown1047: @realDonaldTrump - 52 and thinking of trying real estate as a new career. Good idea in our current economy, or not? Great idea"},{"text":"\"@Tee_Rellzz: I may not agree with everything he says but your definitely a good businessman @realDonaldTrump\"  Very true!"},{"text":"@FloydMayweather  My prediction of Floyd is looking good!"},{"text":"\"@exLWaters: @realDonaldTrump @Rizz_Lizz Not all Four Seasons Hotels are good. Every Trump is Always Perfect.\"  So true, thanks!"},{"text":"I will be doing #GDNY Good Day N.Y. with Rosanna &amp;Greg live at 8.30 A.M.  I will be giving money to a great guy who lost his son in the WTC."},{"text":"Putin is having such a good time. Our President is making him look like the genius of all geniuses. Do not fear,we are a NATION OF POTENTIAL"},{"text":"\"@TheTeflonDante: @realDonaldTrump who should be the AG replacement? Any thoughts?\" There are a number of very good people!"},{"text":"I fought hard against Spitzer and Weiner, and both lost. For a while, when Spitzer was way up, it seemed that I was a lone voice! Good power"},{"text":"@AustinOdusanya1                  \n\"@realDonaldTrump you are a great mentor. I have all your books\"  Great--good luck!"},{"text":"@1996Goldberg Happy Birthday!"},{"text":"@ArsenioHall   Arsenio, may your run be long, successful and important-just be yourself and you will be a smash! Good luck."},{"text":"\"@dongibson12: @realDonaldTrump @RiqardPaliq Hopefully Donald Trumps fate is to be a very old, rich ex president in good health. So nice!"},{"text":"\"@toughnewworld: I may not always agree with @realDonaldTrump statements.. But he does have a good looking line of shirts and ties\""},{"text":"\"@CosmosTickets: @realDonaldTrump @macy your apparel is the first thing I look at when I go to the mall!\"  Thanks - you have good taste!"},{"text":"@dexterpugh   Great looking couple-good to have him back!"},{"text":"Former President Jimmy Carter is so happy that he is no longer considered the worst President in the history of the United States!"},{"text":"“If you plan for the worst – if you can live with the worst – the good will always take care of itself.” – The Art of the Deal"},{"text":"\"@walterdisneyusa: @realDonaldTrump you would make such a good president\" Thank you!"},{"text":"\"@Sebast_Valmont: @realDonaldTrump when is @MacMiller gonna pay you?\" That is a very good question! His only good song is Donald Trump."},{"text":"Happy New Year to all of my Jewish friends and supporters. Shana Tova. Hopefully it will be a great year!"},{"text":"\"@DavidAGoodman: @realDonaldTrump:How can General Dempsey tell Obama delaying Syria bombardment will have no consequences?  He's no Patton!"},{"text":"President Obama's \"Arab Spring\" is not looking so good right now!"},{"text":"\"@SwagDaddyYol0: Why isn't @realDonaldTrump president instead of Obama ??\"  That is truly a good question!"},{"text":"@BrandiHarmon   Good luck."},{"text":"@TheGrumpyHusky  Happy birthday."},{"text":"\"@jayneg53: @realDonaldTrump can't say Obama doesn't know how to throw a polite war!\"  General Patton would not be happy right now!"},{"text":"\"@kingsfansouth: @realDonaldTrump I usually agree with you, not tonight. Stop criticizing The President.\"I will when he makes good decisions"},{"text":"@dhfr64 Happy Birthday Deborah."},{"text":"Thx Mark--I appreciate your words about the school. You sound like you're doing well--happy for you. @businessinsider http://t.co/EuMSV9bOJS"},{"text":"\"@dlhanno64: @JaneyGodley @realDonaldTrump Donald makes you happy. .thats good ..we need something to make us happy with this President."},{"text":"@ritter1025 Happy Birthday Bernice."},{"text":"Do not settle for remaining in your comfort zone. Being complacent is a good way to get nowhere. Take control and move forward every day."},{"text":"\"A general is just as good or just as bad as the troops under his command make him.” -   Gen. Douglas MacArthur"},{"text":"As I predicted long ago, the war in Iraq was a disaster for the U.S. Heading for civil war, there are bombings all over the place.Iran happy"},{"text":"\"@JPM17: @realDonaldTrump @TomNocera I've taken a few of the classes on line. Thought they were very good\"."},{"text":"@BBPACK  Happy birthday!"},{"text":"\"@TarekR: @realDonaldTrump What do you think should be done about Gun Control in the US?\"All good folks that have a gun should control it!"},{"text":"@TxSi  Happy Birthday!"},{"text":"@TheTeflonDante         \n\"@realDonaldTrump @gretawire I bet her ratings were great! Good work Mr. Trump\" They were great--thanks!"},{"text":"\"@RichardFlorenc1: @realDonaldTrump can you put out a shout for aberdeen football club today as big game\" Good luck, WIN!"},{"text":"“Good communicators control space.” – Roger Ailes, ‘You Are The Message,’@FoxNews"},{"text":"@RyneCPL              \n\"@realDonaldTrump Just finished #TheArtOfTheDeal.  Awesome book w/ great insight!\" Thanks, good luck."},{"text":"\"@Caleb_Watson: @realDonaldTrump never actually considered running for President. All a publicity stunt #GoodBusinessMove   WRONG!"},{"text":"\"@lovemyklr: @ShawnaTova @realDonaldTrump she did good. Trump could if he can talk in a way that everyone can understand. Just like Reagan."},{"text":"@Randirobics Great, good luck!"},{"text":"Looks like Anthony Weiner Is through-most recent poll has him deeply in last place. GOOD NEWS"},{"text":"The Patch, a total loser for @AOL, will be a good deal compared to @HuffingtonPost. @ariannahuff laughs at “stupid” Armstrong!"},{"text":"@RoyalStr8tFlush  Wow, good competition!"},{"text":"@coffeepleaseAM         \n\"@realDonaldTrump I'm so happy that you find time to tweet. I really enjoy following you.\"  Thanks Amy."},{"text":"Good.morning, I'm going to work!"},{"text":"\"@samvuko: Mac Miller has one good song &amp; its \"Donald Trump\" &amp; its really just the beat that's cool.\"  AND THE NAME!"},{"text":"\"@D_Raww16: Donald Trump is his only good song in my opinion\"  EXCEPT FOR HIS DONALD TRUMP SONG, LITTLE MAC MILLER'S MUSIC SUCKS!"},{"text":"\"@39caroline: @realDonaldTrump @HuffingtonPost @ariannahuff all good cos I dont read huffington post. Its garbage\"   It is failing badly!"},{"text":"@tayloroftexas   So nice, good morning!"},{"text":"@NY2DC_N_BACK @blackpoolsinger @piersmorgan Wrong, Piers is smart &amp; tough and, when you get to know him, a really good guy--and loyal!"},{"text":"Obama should meet with Putin snd convince him to do what is good for the U.S.  It's called good dealmaking or, simply, leadership! Cajole."},{"text":"@ClemensIsland13   Have a great time-happy birthday!"},{"text":"@scottlara1961 Have a Happy Birthday."},{"text":"“It’s a good idea to take your own pulse once in a while instead of focusing on what the masses are doing.” – Think Like a Champion"},{"text":"@bradleymenglin Good luck!"},{"text":"@Rudmania20  Happy Birthday Shane."},{"text":"@Mikeveltman Good luck again!"},{"text":"@Deneetro  Happy birthday!"},{"text":"@BrianRyback Thank you Brian and good luck."},{"text":"“Be tough, be smart, be personable, but don’t take things personally. That’s good business.” – Think Like a Champion"},{"text":"Take your work seriously, take yourself less seriously. It’s a great recipe for some good times &amp; great memories."},{"text":"\"@tomuchpolitics: @realDonaldTrump I would like to hear the answer to that johnny football question?\"  With a little good guidance, great!"},{"text":"Do not settle for remaining in your comfort zone. Being complacent is a good way to get nowhere. Get your momentum going and keep it going."},{"text":"A good question for would-be entrepreneurs to ask themselves:  What am I pretending not to see? There are a lot of opportunities out there."},{"text":"@amyg2200 Happy Birthday!"},{"text":"@glenda_goff Happy birthday Glenda!"},{"text":"Poll numbers have nosedived for pervert NYC mayoral candidate Anthony Weiner- good news for New York!"},{"text":"@tuserious854 The Art of the Deal is a good start."},{"text":"@chef2234 @Cloutsnchara Happy Birthday."},{"text":"@MontoyaMania                \n\"a good 75% of @realDonaldTrump 's tweets get favorited\"   Great!"},{"text":"\"@lazyj70: @realDonaldTrump @Maathewdavis beating China, and I'd just like to see someone that's in it for the good of the USA.  Great!"},{"text":"@vin7768   Thank you-work hard and good luck."},{"text":"\"@JohnTorcasio: @realDonaldTrump is what happened to Detroit a good thing (long term) ??? It has been sliding for decades.\"  Incompetence"},{"text":"\"@ZachKrantz: @realDonaldTrump Cant wait for tourney next March, always good to have you on with @JoeRoseShow before big tournament\""},{"text":"@cccabrera10                       \n\"@realDonaldTrump reading The Midas Touch now, what an amazing source of good information.\"  Thanks."},{"text":"\"@jcalcat: @realDonaldTrump give me a good reason why I shouldn't unfollow you\" Because you can't live without.me or my extreme knowledge!"},{"text":"\"@Dskoon152_part2: Doing Greta tonight ... I bet her husband is pissed at you ! @realDonaldTrump\" Yes, but she is very happy!"},{"text":"@sepamu @rainnwilson Citizen Kane, Gone with the Wind, The Good the Bad and the Ugly, etc."},{"text":"@ashleyemom23 Happy Birthday!"},{"text":"@RickyMadsen @HeidiMads @Oprah Happy Anniversary Heidi!"},{"text":"If you've got some problems today, that's a good sign--that's life. So give them some thought and make the most of the situation."},{"text":"Some good news for New York – Weiner has dropped 12 points in the polls &amp; that is before more of the pervert’s old texts are released."},{"text":"@elbatata_ok The Art of the Deal is a good introduction."},{"text":"“One thing I’ve learned about the press is they’re always hungry for a good story, the more sensational the better.” - Art of the Deal"},{"text":"@lakotadlustig  Good luck!"},{"text":"@Terrell87               \n\"@realDonaldTrump I read your book: \"Trump 101 The Way to Success\" and I absolutely love it.\" Thanks, good luck!"},{"text":"@owenkopitekavan               \n\"@realDonaldTrump I just finished reading think like a champion, I loved it...\" Thanks and good luck."},{"text":"\"@J4K9FLATLEY: @realDonaldTrump can I get a Happy 21st birthday wish from you? Huge fan of you and the Apprentice\""},{"text":"\"@IMUNCIRCUM5IZED: @Bman2095 my heroes are either @realDonaldTrump or @mark_wahlberg\"  Mark is a great guy (and good golfer)."},{"text":"\"@RogerRainier: .@nathsky Good to hear. That's what this article says too. Did you see this? http://t.co/uc4gyL2tDO  Yes, really nice story!"},{"text":"\"@ClareAurelio: @realDonaldTrump @Gamecockmtm1967 Run!!! Or this country will turn out like ancient Rome!\"  Perhaps so, not good!"},{"text":"@trace_barden Good luck."},{"text":"\"@EEpplin: @carterj1982 is getting married today and he's a huge fan! Can you give him a RT to celebrate? @realDonaldTrump\" Good luck!"},{"text":"@EvanSMSolutions   Good luck!"},{"text":"\"@FraserPorteous2: @realDonaldTrump I took a drive to Trump Scotland last week- what an incredible course your built. Good work, Trump!\"  T"},{"text":"\"@nikkio: @realDonaldTrump Spitzer thinks since Wiener did it - so can he. I hope the good citizens of NYC show both the door."},{"text":"@djRandyRan Happy Birthday."},{"text":"Eliot Spitzer was a horrible Governor and A.G. who ruined many good people and cost the Country billions of dollars in losses (and jobs)."},{"text":"\"@cowpokes6369: @realDonaldTrump any word on if Celeb Apprentice is coming back for 7th season? Please give us the good news.\"   YES!"},{"text":"@BrandIdeator The Art of the Deal is a good start."},{"text":"@MarcoCompagno You are probably correct, I am too honest to be a good politician!"},{"text":"\"@oralobgyn: @realDonaldTrump @ctobin22 Good timing for Paula Dean to go public, and lots of lawsuits. Where's her lawyer? Asleep?\"  ASLEEP!"},{"text":"\"@MathemagicianUK: @realDonaldTrump @Numerologynow. I'm pretty sure it was like 10M. To turn that into 10B clearly shows he's good!"},{"text":"\"@TowerRecordsPrj: @realDonaldTrump any memory of you and Tower Records founder Russ Solomon? A good guy and fine tenant."},{"text":"@Pourquoipas20  Good idea, will create one."},{"text":"“You have to have a good reason for doing what you’re doing because people connect with the why.” – Midas Touch"},{"text":"\"@fvb123: \"@realDonaldTrump \"You have enemies? Good. That means you've stood up for something, sometime in your life.\" - Churchill\"\""},{"text":"\"@YoungBasedGod_g: @realDonaldTrump your dad gives good brain?? Damn\"  It's called genes!"},{"text":"What my father really gave me is a good (great) brain, motivation and the benefit of his experience-unlike the haters and losers (lazy!)."},{"text":"You mean the fact that my father left me some money (as a good father will) and I multiplied it many, many times to over $10 billion-is bad?"},{"text":"@DerrinTexada Good luck--work hard!"},{"text":"\"@JFSargent: I feel like that last tweet by @realDonaldTrump is gonna be a good one to have on record.\"  Yeah, for me!"},{"text":"@513pango That's really nice--good luck!"},{"text":"@ARMusicPlanner Happy Birthday Anthony,"},{"text":"@WWEfan123444  Good luck."},{"text":"@BarriMedia Good luck."},{"text":"Vision remains vision until you focus, do the work, and bring it down to earth where it will do some good."},{"text":"After one of the great chokes in the history of sports, it will be hard for the Spurs to beat the Heat - but who knows. Good game on now!"},{"text":"Watch the game-really good."},{"text":"\"@athompson362: Why did I quit following @realDonaldTrump? Twitter is boring without him. I'm back for good!\"  Everybody comes back!"},{"text":"\"@glcarter7: @realDonaldTrump @peaceloveandmeg Mr. Trump, Im 45 today. Can I get a retweet for luck this year?\"  Good luck!"},{"text":"Frankly, for a writer, I don’t think @DannyZuker’s stuff is good. In fact, it’s terrible."},{"text":"\"@TiffanyATrump: Happy Father's Day dad! Love you! @realDonaldTrump http://t.co/lvDgZWvOIQ\"  Thanks Tiffany, I am proud of you!"},{"text":"Happy Father's Day to all, even the haters and losers!"},{"text":"@quicksorter Have a good time, enjoy this great city."},{"text":"\"@ilory: Whao! So good to know that I share the same birthday as my mentor @realDonaldTrump. Tomorrow's our Birthday!!!!!!\" Happy birthday!"},{"text":"\"@JustMeNoahB: @realDonaldTrump Please Run For President... Be Good To Have A Real Business Man In Office\""},{"text":"@lovevictoria   Happy birthday Victoria."},{"text":"@shelleysherwin  Wish your mother a happy birthday."},{"text":"\"@mrbocce: @realDonaldTrump This Red Sox fan says let 'em keep paying!  Boston.must be very happy!"},{"text":"\"@an2nym: @realDonaldTrump Good luck. If I had known Id have come to shake your hand. Fab job in Aberdeen.\""},{"text":"My son @EricTrump has just done another great event and raised a lot of money for @StJude. He is a really good boy who loves helping kids."},{"text":"@happyloner   Wrong you idiot!"},{"text":"@ArthurDeMeyer Happy Birthday!"},{"text":"\"@TristenHeath: @realDonaldTrump what's the secret to all your success?\"  Always need good and sound concepts and ideas-THEN, NEVER GIVE UP!"},{"text":"@ArronJ1  Find something you love doing--you have to have passion for your work. Then work hard and keep focused. Good luck!"},{"text":"@Fan_JCena Good luck!"},{"text":"\"@metaltyger98: “@realDonaldTrump: Happy 8th Anniversary to @MELANIATRUMP. http://t.co/nlxIXoepKZ” Way to go Mr.Trump!\" Great beauty-person!"},{"text":"@jakewittman   Happy birthday!"},{"text":"@BollingsBalls   But I know @ericbolling and think he would do really well-tough, smart and a good guy!"},{"text":"@MANDCNorthEast Yes you can for country's good."},{"text":"\"@aliyuaminuahmed: @realDonaldTrump @Bobbysoo80 Donal J. Trump is a good Presidential candidate - he has answers. Thanks, very nice!"},{"text":"\"@alpugh1: @realDonaldTrump Donald sir, played your course on Friday and let me tell you this, it was spectacular. Good work!  Thanks!"},{"text":"\"@DominicFormaro: @realDonaldTrump it's hilarious to see all these dumbasses hating on you. I bet it feels good to laugh at them."},{"text":"@DannyZuker Come on Danny, are u afraid of the DEAL (be careful, I'm really good at deals)."},{"text":"\"@warrencasselljr: @realDonaldTrump I agree! She tried to ruin the good old Trump brand! You can not let her get away with it.\"  TRUE!"},{"text":"@Pourquoipas20 Happy Birthday!"},{"text":"\"@YouAreNotDeep: @realDonaldTrump Thanks, Professor Trump.\"  Dr John Trump, uncle, for many years at M.I.T. -good genes, I get it!"},{"text":"\"Trust yourself. Create the kind of self that you will be happy to live with all your life.\" - Golda Meir"},{"text":"Good timing: @TraceAdkins won big for American Red Cross last night on @ApprenticeNBC. Now the Red Cross is in Oklahoma doing a great job."},{"text":"@Holly_Looya @divermam Ok. Ben--Congratulations on your graduation--and good luck!"},{"text":"\"@13crazyjwd: @realDonaldTrump still in awe of what u did for lil Jon !!! Best night of good TV in years!!! God bless\""},{"text":"The cast for next season looks really good!"},{"text":"@chrishansen   Good to see you also - I will be watching!"},{"text":"@AnubisJudge  Happy Birthday!"},{"text":"@Billingsley29  Do what you love, work hard, keep your focus and your momentum intact. Good luck!"},{"text":"@Lord_Sugar can't hold a.candle to Donald.Trump - he is a laughing stock in Great Britain (but his show pays me lots of money, so I'm happy)"},{"text":"@african11   But I love insulting people who don't have the goods but think they do!"},{"text":"\"@hotair25159: @realDonaldTrump lol.. Justice for Travis\"   It shows that the legal system is still intact-good news!"},{"text":"Man, we had a great day today at Trump Tower - lots of money was given to many people who really needed it - good feelings and happiness!"},{"text":"I just gave lots of money away at Trump Tower to people who needed it...they were very happy and appreciative!"},{"text":"What a great time we just had in the atrium of Tump Tower for http://t.co/tSLfuNNAPI. The place was happy and packed!"},{"text":"\"@JoshIs: Super happy to #unsubscribe @realDonaldTrump now that his asinine election antics are over. Then don't talk, do it asshole!"},{"text":"The jury in the Jodi Arias trial is, believe it or not, still out. You never know but such a long deliberation could be good for the defense"},{"text":"\"@DigitalPianoMan: @realDonaldTrump You do more good just commenting on Twitter than most haters do their whole lives\""},{"text":"Turn to QVC now to watch Melania - really good stuff!"},{"text":"@adb1707 @TrumpTowerNY @THEGaryBusey Good point!"},{"text":"\"@kilgorecf: Dang @DannyZuker v @realDonaldTrump has been too good.\"   No, too easy-Danny is a dummy!"},{"text":"@mtshastacola   Happy birthday!"},{"text":"\"@shillelagh2: @realDonaldTrump @tomspiglanin @TrumpNationalLA if its good enough for The Donald it should be ok for me\" Directly on Pacific"},{"text":"\"@NNNmrk: @realDonaldTrump You need to write another Time to Get Tough Book. It'll be another new york times best seller.\" GOOD IDEA!"},{"text":"\"@JohnRMcCabe: @realDonaldTrump deserves to be President of the United States of America\"  Thanks John, we need someone Really good (great)."},{"text":"\"@firephoto67: @realDonaldTrump Big fan Mr. Trump, always have been. Keep up the good work\"  Thanks Woody!"},{"text":"\"@NearBatman: @realDonaldTrump You aRe my favoUrite! Someday U Could be prez. How About a rt Good luck."},{"text":"\"@GabiOliver26: @realDonaldTrump @maffucci93 My 17th bday is tomorrow :D plzzzz will u retweet me...\"  Happy B-day!"},{"text":"@GerhardM_com   Perhaps, but the Country is in really big trouble!  I do love real estate though (and am seriously good at it)."},{"text":"@MarkkCole  Happy Birthday Mark."},{"text":".@bretmichaels and George Ross are back as advisors. Good to see them! #CelebApprentice"},{"text":"The shirts and ties at Macy's are so good-beautiful and do so well that guys like the one that sued me wrongly want a piece-l kicked his ass"},{"text":"Oh no, they are worried that they didn't read the Boston killer his rights and he may have a good legal argument. 12 year case to finish?  t"},{"text":"\"@sverriss: @realDonaldTrump what good will killing him/her do?\" He'll never kill again-and others will start to think about consequences!"},{"text":"@Gabagul_ Hi Dan and good luck!"},{"text":"\"@itsHODAIFA: @realDonaldTrump I wish someday i would be like you! You're my inspiration! Keep up the good work.   Thanks!"},{"text":"Great to see @RedSox win big yesterday. Good for Boston and the country. Yesterday we were all @RedSox fans."},{"text":".@alexsalmond  RT @islandbluenose \nYou'll be doing us in scotland a great service if you win. Good Luck."},{"text":"@terryvanburen @TheRealMarilu @ApprenticeNBC .@TheRealMarilu \nwill be happy--she's also a great person."},{"text":"@oparinde Macy's will be happy--and so am I."},{"text":"\"@chuckyc78: @realDonaldTrump happy the apprentice is back to two hours having my weekly apprentice party\" You will love it tonight!"},{"text":"\"@gameexpress1: @realDonaldTrump Angel Cabrerra will win the MASTERS..265lbs of everyman golfer..Ole!\" He is looking good!"},{"text":"@tjwacker. Good luck!"},{"text":"\"@CoolCanuckChick: @realDonaldTrump I thought China was good with the U.S.?\"  Only if you want no country left!"},{"text":"\"@loganfaris: Have to do an essay on a hero....... Definitely picking @realDonaldTrump. Perfect idol\"  Very nice-good luck!"},{"text":"All eyes are on @TigerWoods @The_Masters.  He’s in good position!"},{"text":"\"@salesdan48: @realDonaldTrump Mark Cuban is a sad, unhappy man. A facade, masquerading as a Trump wannabe.\" Very interesting!"},{"text":"\"@ElliotD224: @realDonaldTrump do you think Bloomberg is a good mayor?\" Yes!"},{"text":"The $200M renovations at Trump @DoralResort are right on target.  When completed, the course will be as good as it gets."},{"text":"“Donald Trump Wishes Kristen Stewart A Happy Birthday” http://t.co/UMN4QpgmHN via @HollywoodLife"},{"text":"@DanSt_Schwind Thanks--and good luck."},{"text":"\"@miketilley13: Prepping for my job interview by reading \"The Art of the Deal\" by @realDonaldTrump Inspirational\"  Good luck Mike!"},{"text":"I am very impressed by @dennisrodman. His return to this season’s @ApprenticeNBC  showed who Dennis really is--which is very good."},{"text":"@angie_ncislover  Have a happy one!"},{"text":"\"@rab4488: @realDonaldTrump @BillMoyers @PBS @JeremiahWright Bill Moyers is a good man---1000 times better then you are\"  He is a dummy!"},{"text":"Starting next week, and by popular demand (plus good ratings) NBC will broadcast only two hour episodes of Celebrity Apprentice at 9 P.M."},{"text":"\"@GiovaChris: \"@SammartinoBruno: @realDonaldTrump and I backstage at WWE Hall of Fame. A great man and good friend. http://t.co/8FMQzJbwZQ\"\""},{"text":"@BillLMU Lili will call you - thanks and good luck!"},{"text":"@blazey53 Great, good luck."},{"text":"\"@mfon_essien: One day I'd shake hands with @realDonaldTrump - my business and leadership mentor.\"  Work hard and good luck!"},{"text":"Look for good ideas outside of your own areas of expertise. Find innovations, approaches, and practices that you could adapt in your field."},{"text":"Another freezing day in the Spring - what is going on with \"global warming\"?  Good move changing the name to \"climate change\" - sad!"},{"text":"It was my great honor to defend @dennisrodman on @ApprenticeNBC last night—he has come a long way and for the good!"},{"text":"@South_Said  Good luck."},{"text":"\"@lucaswilson911: @realDonaldTrump PLEASE REPLY TO ME!!! Yay! I'm your number 1 fan!!! I will die happy if you respond to this tweet :D $$$$"},{"text":"\"@FutureCutler: @realDonaldTrump Couldn't be happier! Now #CelebrityApprentice is without a doubt the best show on tv!\" Glad you are happy!"},{"text":"\"@SullyThinks: why is @realDonaldTrump not the president of the US right now?!\" A very good question!"},{"text":"Have a great Good Friday and a Happy Easter."},{"text":"\"@MichaelScarbrou: @realDonaldTrump Good Job Donald. I'll call NBC a see if they'll giv you Leno's spot..lol\""},{"text":"\"@craigashwood: @realDonaldTrump Nice job Mr.Trump! Smooth, relaxed, and in good humour.\" Thanks!"},{"text":"\"@Higgie0: @realDonaldTrump @Late_Show... watched you Letterman.. Good Job! Your Hired!\" Thanks!"},{"text":"@MisterMcFlee Thanks--and good luck!"},{"text":"General Petraeus should stop apologising and get on with his life. He is a good man and should have a great future."},{"text":"@Javi8104 Great--good luck."},{"text":"For all of my many Jewish friends, Happy Passover."},{"text":"Good Morning America weather headline for U.S. - \"NEVER ENDING COLD\""},{"text":"@JoelKrautter   Very good Joel!"},{"text":"Always good to have @ArsenioHall back as advisor as well as @DonaldJTrumpJr. They have their own fan clubs at this point. #CelebApprentice"},{"text":"@1fos1 Pay attention, study more than what is required, keep your focus on the big picture. And good luck."},{"text":"@chrisr52 Happy Birthday Christine."},{"text":"@balloon_69 @AFCHaywards  Good luck!"},{"text":"@iklemieux @theRealKiyosaki  Thanks--and good luck."},{"text":"@t_thabane Happy Birthday."},{"text":".@NBC just announced that all 1 hour @CelebApprentice episodes are being expanded to 2 hours—it’s amazing what good ratings will do!"},{"text":"@MandMpanelbeat Thanks and good luck."},{"text":"\"@sisson_travis: @realDonaldTrump when's good for me to head down to doral with the boys? #kimMitchell\"  In September"},{"text":"And happy to welcome @ArsenioHall back as an advisor— he will have his own show and is doing great. #CelebApprentice"},{"text":".@TraceAdkins is back—good news for Plan B. #CelebApprentice"},{"text":"\"@helen39639472: @realDonaldTrump I think that you should run for President and be elected to that office. Good luck in all you do. THANKS!"},{"text":"Just won The Club Championship at Trump International Golf Club in Palm Beach-lots of very good golfers-never easy to win a C.C."},{"text":"Good move by @MSNBC in downgrading @WeGotEd to a dead weekend spot. This is truly a guy who shouldn't be on tv."},{"text":"To show you how shallow politicians can be, many are jealous of my @CPACnews speaking slot &amp; also their fellow Republicans! Not good!"},{"text":"@kevconnorsespn. Great and good luck!"},{"text":"“You have to have a good reason for doing what you’re doing, because people connect with the why.” – Midas Touch"},{"text":"Best of luck to my good friend Derek Jeter on his first game today back at shortstop. @Yankees Captain is a warrior &amp; winner."},{"text":".@LukeDonald You are so good and so talented that I have no doubt you will conquer the 18th hole at the \"New\" Blue Monster @DoralResort"},{"text":"@heyavampirebat Good idea--I wish him luck."},{"text":"@hrtbrknomore74 Thanks and good luck."},{"text":"@HammerleAmanda @theRealKiyosaki  Thanks--and good luck."},{"text":"Trace and his team raised an amazing amount of $.  Looks like a good season for charities."},{"text":"@Ziggi92  Good luck."},{"text":"@melpoluk  Good luck!"},{"text":"@a123r7o  Thanks, good choice &amp; good luck."},{"text":"@SMK4ye  Good goal."},{"text":"@PabloRaffaele  Good thing to remember."},{"text":"\"@ClaudiaMota: Good Morning, @realDonaldTrump . I admire your leadership &amp; look forward to hearing you speak next week.\" Thank you!"},{"text":"@kstan500. Good luck!"},{"text":"\"@jguer042: Good morning @realDonaldTrump. Started reading Think Big yesterday and already almost finished. Thank you for writing it\" Thanks"},{"text":"@lovitt_marisa Good to hear, enjoy!"},{"text":"@xo_deannayoung Good subject, good luck!"},{"text":"It’s been great making so many new friends at Trump @DoralResort for the @CadillacChamp. Good luck to everyone!"},{"text":"It is my great honor to be speaking at CPAC 2013. They are all about what's good for America."},{"text":"@TheEvanGruver Thanks Evan and good luck."},{"text":"@wrightmomof3 @iansomerhalder @paulwesley @joshduhamel @Zak_Bagans  Happy Birthday Tiffany."},{"text":"@SvenIsaksson Thanks Sven and good luck."},{"text":"@M_Sallis Matt--Hope you will have a Happy Birthday."},{"text":"Paul Teutul is always good on the show. #CelebApprentice"},{"text":".@LisaRinna looks better with her reduced lips. Good move, Lisa. #CelebApprentice"},{"text":"\"@JonReidHotchner: @realDonaldTrump I wanna be noticed by the next president of the good ol' US of A any chance of that?\" Yes!"},{"text":"Is Chris Jackson as dumb as I hear - but I still like that he follows me like a good little soldier!"},{"text":"Everyone should cancel HBO until they fire low life dummy Bill Maher!  Get going now and feel good about yourself!"},{"text":"I am happy that \"The Job\" on CBS, the 16th. knockoff of the Apprentice, was just cancelled. I love to see my opponents lose (not nice)!"},{"text":"@MyStudentApt  Thanks Rob and good luck."},{"text":"@pammygb  Good work, Pam."},{"text":"You haven’t seen fireworks until you see @OMAROSA &amp; @piersmorgan go at it again! Let’s just say it’s no happy reunion…"},{"text":"One good aspect of the Obama depression is that it will separate the winners from the losers. If you can make it now, you deserve it!"},{"text":"Remember, no one ever said success was easy.Good luck doesn’t come overnight.But if u work hard &amp; love it, u will find success &amp; luck."},{"text":"@Looayg  Thanks and good luck."},{"text":"@JTDixon_Inker Happy Birthday &amp; enjoy NYC."},{"text":"@misskhan  Happy Birthday."},{"text":"Is everything ok over there @Salon? I actually got some good press from them today."},{"text":"@TheRealChosen1 Thanks and good luck."},{"text":"\"@my_deeary: I wish @realDonaldTrump would teach me all his little secrets to success\"  Good idea!"},{"text":"I will be on @LateNightJimmy tonight.  Always have a good time with @jimmyfallon.  Now we know he will get high ratings tonight."},{"text":"Now I know that Yahoo is in good hands. It took great courage for @marissamayer to take away the right of employees to work at home."},{"text":"RT @NRCC: Good to hear @realDonaldTrump is on board.GOP is the party of free enterprise.Join us as we innovate: http://t.co/RhGNVk4O9r"},{"text":"@RPMNANA Thanks, good question/good point."},{"text":"@dynomike3 Hi Mikey--work hard and good luck."},{"text":"@jaderomaine  Thanks and good luck!"},{"text":"@JUrciuoli19 Very good!"},{"text":"I've had enough of this - good night!"},{"text":"Anne Hathaway is a good winner!"},{"text":"Shirley B did a very good job singing Goldfinger! Not easy."},{"text":"@Shopgirlusa. Good idea."},{"text":"What would All-Star @ApprenticeNBC be w/out a Baldwin? @StephenBaldwin7 is at the top of his game this season. Our fans will be happy."},{"text":"Congrats to Miss Universe 2011 @RealLeilaLopes &amp; @Giant great @OsiUmenyiora on their engagement! I am very happy for you both."},{"text":"@JamesRobert_  Hi Robert--good luck."},{"text":"@leatherneck03  Thanks and good luck!"},{"text":"I am hearing that @NRCC Digital Director @lansing is doing great work expanding and modernizing @GOP social media.  Good – we need it."},{"text":"My ties &amp; shirts at Macy’s are doing great. Stupid @GoAngelo is making people aware of how good they are!"},{"text":"@bguzqueda Thanks Boris, good luck."},{"text":"@TaylorSangOrDie Focus on your goals, work hard and never give up. Good luck!"},{"text":"@JerryYanks  Thanks Jerry. Good luck."},{"text":"Good news - @AFPhq is going to fight back against Rove’s attack on the Tea Party http://t.co/UiAfH2sm Go get em! @marklevinshow"},{"text":"@gleasondp  Good idea."},{"text":"@philegl That's good news! Congrats."},{"text":"Success is good. Success with significance is even better. Work on what you will be proud to be associated with--make your work count."},{"text":"@Cynlanjoh Keep up the good work Cynthia."},{"text":"@Preppermeister  Thanks and good luck."},{"text":"@MooreReva  Good. Never give up!"},{"text":"@hosscasey  Happy birthday Matt."},{"text":"@JMBruh @jdmael  Complete is good."},{"text":"@MamaBabyHood Thanks--keep up the good work."},{"text":"@mandielaurin Good!"},{"text":"@mayorgas  Good! and good luck!"},{"text":"@foodnfocus Happy Valentine's Day!"},{"text":"@tonystang Thanks Tony, good luck."},{"text":"@meliabila Great--and good luck!"},{"text":"@McHaleFrank Thanks and good luck."},{"text":"@gilbertobm Thanks Gilberto and good luck."},{"text":"@JUrciuoli19 Happy birthday!"},{"text":"@marrs_cat Sounds like a good idea to me!"},{"text":"@BeckettGOP Thanks Brian and good luck."},{"text":"@JulesPQ Thanks--glad it was good."},{"text":"@steffanpiper Very good!"},{"text":"@nydave77 Good luck!"},{"text":"@DalHines  Thanks--they are good kids!"},{"text":"@ellis38671w Thanks--work hard &amp; good luck."},{"text":"@EAWIII  Thanks and good luck."},{"text":"@pathselo  Good luck!"},{"text":"@carsenadeline Yes, absolutely. There are always opportunities and therefore hope. Good luck Carsen!"},{"text":"My Doral Country Club purchase was made just before Miami real estate market went through the roof—good timing!"},{"text":"Sorry, but @piersmorgan is a good &amp; smart man who is doing really well. That’s why he won @ApprenticeNBC."},{"text":"A mediocre person tells. A good person explains. A superior person demonstrates...."},{"text":"Good luck @RoccoMediate and nice hat! http://t.co/zSd5J3IS"},{"text":"@MaryGraceDH Good!"},{"text":"@JXGriffen  Be confident, pay attention--and good luck."},{"text":"@ATunaMeltOnRye  Good idea."},{"text":"@lucasg203 Good luck!"},{"text":"@Adetonaoris Great, good luck."},{"text":"@citychik_  Thanks Andrea and good luck."},{"text":"@rayk71 Happy Birthday Ray."},{"text":"@DJColes1 Great! Good luck."},{"text":"@jayceemccain Thanks and good luck."},{"text":"@ColeneChia116  Thanks Colene--very nice! Keep up the good work."},{"text":"Be tough, be smart, be personable, but don't take things personally. That's good business."},{"text":"Happy 102nd birthday to President Ronald Reagan. Every day that passes, Reagan's presidency looks better and better."},{"text":"@SMarsh7818 @Stern100 Thanks and that's good news. Good luck."},{"text":"The best deals are good for everyone, which creates a win-win situation. Negotiation is persuasion more than power."},{"text":"“You should always feel comfortable bargaining for goods and services. I do it all the time.” – Think Like a Billionaire"},{"text":"$4 gasoline – wow—OPEC is very happy!"},{"text":"@jamester49 Good luck."},{"text":"@PRW_StaysFresh That's good news!"},{"text":"@Asklepios333 True and not good!"},{"text":"@DrewHemijk  Thanks Drew. Good luck."},{"text":"@JohnNyire1  True--good luck!"},{"text":"@dirkbockel  Thanks and good luck."},{"text":"@ktsarita  Good ideas and hard work!"},{"text":"@RFussell Good idea!"},{"text":"@TBrown2334  Not good!"},{"text":"@gotowardsthesun Good luck!"},{"text":"@DaraghRohan  Happy Birthday and good luck!"},{"text":"@Cletendre21 @LetendreLarry But not hard enough--good luck Chris."},{"text":"I wonder how @JoeBiden feels after last night’s love fest between Obama and Hilary on @60Minutes. Can’t be too happy."},{"text":"@Kevin_Johnson68 @trapasso2501 Happy Birthday."},{"text":"@denoforensics Good idea--enjoy!"},{"text":"@amilcaralvarez  Great! Good luck!"},{"text":"There is no world problem which cannot be solved if people of good will &amp; intelligence want it to be."},{"text":"Happy 8th Anniversary to @MELANIATRUMP. http://t.co/y45SSfYx"},{"text":"@adkradio Thanks and good luck."},{"text":"@JustJoanne247 @BarackObama  Of course I do--for good of country!"},{"text":"@mscijihenderson Midas Touch is a good choice for those with entrepreneurial interests."},{"text":"If the Republicans need a chief negotiator I am always available--or can recommend some really good ones!"},{"text":"@MattMogul Happy Birthday tomorrow, Matt"},{"text":"Alabama people are saying their team has real football &amp; real girlfriends—not good for Notre Dame—but they’ll be back!"},{"text":"@ChristianFranzH  Thanks Christian and good luck."},{"text":"Lance Armstrong’s liability &amp; lawsuits against him have just increased tenfold—his lawyers will be very happy—lots of fees!"},{"text":"@pattilee22   Thanks and good luck."},{"text":"@pellscuse11  Happy Birthday"},{"text":"@BowsByBaby  Thanks and good luck."},{"text":"@tonytuanvu  Thank you and good luck."},{"text":"\"Good investors are good students. It's as simple as that.\" - Think Like a Billionaire"},{"text":"@Itsbrttanybitch  Thanks and good luck."},{"text":"@robgoodwin72 @_KatherineWebb True! They are great."},{"text":"@Jimmy_Farney @QueyNewton  Great -- Good luck James"},{"text":"@brose783  Thanks. Good luck."},{"text":"@sandramdocer Happy New Year Sandra."},{"text":"@kristine_kaplan  Happy Birthday Kristine"},{"text":"The Iranians are sure happy with Obama’s nomination of Hagel.  Already praising Hagel as ‘Anti-Israel’ http://t.co/Y3hDxIO2"},{"text":"@yfentrepreneur  thanks--work hard and good luck."},{"text":"I hope the Republicans are happy.  Just as I predicted, that stupid deal they voted for only whetted Obama’s appetite for more taxes."},{"text":".@ewanshearer  Happy Birthday"},{"text":".@ArsenioOFFICIAL  Thx for the good wishes--you are going to have a really big year!"},{"text":"@prncsmo_ @LibertyU  Hi Morgan and good luck."},{"text":"@AdeleBrumley  Adele--Happy Birthday."},{"text":"@NYPatriots4Life  Thanks and Happy New Year."},{"text":"@jacksback2009 Thanks Jack and Happy New Year."},{"text":"@beverlism  Good place!"},{"text":"@Fleur498  The Art of the Deal is a good start."},{"text":"Via @politicalwire: “Trump Not Happy with Republicans” http://t.co/iNQYwBSS"},{"text":"“I always follow my own instincts, but I am not going to kid you: it’s also nice to get good reviews.” - The Art of the Deal"},{"text":"@opus_6  Thanks, it's a wonderful place to be--and Happy New Year."},{"text":"@Earther57  Sounds nice--and thanks. Happy New Year to you and yours."},{"text":"@phillykayman The Art of the Deal is a good start."},{"text":"@ptlyons Thank you. Wishing you and yours a Happy New Year too."},{"text":"@mattmaddix  Good luck."},{"text":"@MikeyAdamsWEEI  Thanks--and Happy New Year to you."},{"text":"@mayorgas  Good."},{"text":"“To be successful, you must become very good at finding creative solutions to what appear to be impossible problems.” – Think BIG"},{"text":".@NBC really happy with how well the #MissUniverse pageant went."},{"text":"@MikeCosgrove1  Thanks and good luck."},{"text":"@LeahNelBulos Happy Birthday Leah"},{"text":"@jaimeennis @examinercom  Thanks Jaime, Happy Holidays"},{"text":"@mdslhrst  Good move!"},{"text":"@JNorr11  Good reason for a celebration."},{"text":"Thousands of fans have been sending letters to Trump Tower in anticipation of @CelebApprentice.  Really good show."},{"text":"@BrettNPU32  Happy Birthday"},{"text":"I let @pennjillette come back on the record 13th season of ‘All Star’ @CelebApprentice after he relentlessly begged me to--good t.v."},{"text":"@RandyTotty @tjtotty  Happy Anniversary Teresa"},{"text":"...If you plan for the worst—if you can live with the worst—the good will always take care of itself."},{"text":"@LeviThompson93   Happy Birthday Levi--Work hard!"},{"text":"The UK is seriously thinking about halting wind turbine subsidies. Good news, killing country."},{"text":"Good luck to Bob Kraft, Tom Brady, and Coach Bill Belichick tonight."},{"text":"The Ground Zero Mosque should not go up where planned. It is wrong.  My offer still stands to buy the property.  Good deal for everyone."},{"text":"“You can’t con people, at least not for long.  If you don’t deliver the goods, people will eventually catch on.” - The Art of The Deal"},{"text":"Today's job report is not a good sign &amp; we could be facing another recession. No real job growth. We need over 300K new jobs a month."},{"text":"“There are 2 things I’ve found I’m very good at: overcoming obstacles and motivating good people to do their best work.”–The Art of The Deal"},{"text":"\"A general is just as good or just as bad as the troops under his command make him.\" --Douglas MacArthur"},{"text":"Sugar @Lord_Sugar—you should say thank you, Donald, like a good little boy... ..."},{"text":"When I made the Apprentice the #1 show in the US, that was a good day for you..."},{"text":".@Lord_Sugar  If you think ugly windmills are good for Scotland you are an even worse businessman than I thought..."},{"text":"@danabrams True--but keep up the good work!"},{"text":"Speaker @johnboehner seems to have gained strength in house—a good thing!"},{"text":"I am happy to hear that Pres.Obama is considering giving Anna Wintour @voguemagazine an ambassadorship.  She is a winner &amp; really smart!"},{"text":"@Danusia234 @SaintsFootyNews  Happy Birthday Andrew"},{"text":"@bf2088 Thanks--and good luck."},{"text":"@osaFoLmiK Happy Birthday and best wishes."},{"text":"@AmishFlyers66 Try Trump Grill in Trump Tower. Excellent food, good prices. Enjoy your visit."},{"text":"Back by popular demand, the record 13th season of ‘All Star’ @CelebApprentice features the return of @bretmichaels.  Our fans will be happy."},{"text":"Great that Pres. O is seeing @MittRomney today—lots of good things can happen."},{"text":"@JosephbyNature Good luck Joe!"},{"text":"7 of 10 Americans prefer 'Merry Christmas' over 'Happy Holidays' http://t.co/Xjimd3KU  No surprise."},{"text":"Susan Rice is a good woman but Pres. O should not taunt the Republicans by appointing her S of S..."},{"text":"...Get along &amp; make deals for the good of the country!"},{"text":"\"You can benefit from others’ wisdom. Not just their mistakes but the good decisions and insight they have to offer.” -- The Way To The Top"},{"text":"@LouisWalshXFact @CelebApprentice @TraceAdkins  They raise a great deal of money for good causes and work hard at it."},{"text":"@shanesgranny Thanks and Happy Holidays."},{"text":"HAPPY THANKSGIVING to everyone--I love you all, even my many enemies (sometimes!)."},{"text":"I hope Washington makes a good deal to avert the fiscal cliff.  Both sides need to work together."},{"text":"Pres. Obama’s steady support of @Israel throughout this crisis helped stop the war.  He did a good job."},{"text":"“We are fully supportive of @Israel's right to defend itself.” -- @BarackObama\n--Very good, I like it."},{"text":"It makes me feel so good to hit \"sleazebags\" back -- much better than seeing a psychiatrist (which I never have!)"},{"text":"@BriannaTurano Good!"},{"text":"Social media has changed the news &amp; communication landscape for good. Everything must be up to date by the second instead of the hour or day"},{"text":"Robert Pattinson is putting on a good face for the release of Twilight. He took my advice on Kristen Stewart...I hope!"},{"text":"China's Communist Party has now publicly praised Obama's reelection.  They have never had it so good.  Will own America soon."},{"text":"“A man always has two reasons for doing anything: a good reason and the real reason.” -- J. P. Morgan"},{"text":"Another four years--not good for the country but we'll have to live with it!"},{"text":"Obama just stated \"It's always good to ignore Donald Trump.\" I state he is right, especially when the truth is against him."},{"text":"It’s extremely cold in NY &amp; NJ—not good for flood victims. Where is global warming?"},{"text":"It was announced this morning that unemployment rose--this can't be good for Obama."},{"text":"Let's continue to destroy the competitiveness of our factories &amp; manufacturing so we can fight mythical global warming. China is so happy!"},{"text":"President Obama, please take the $5M check for charity tomorrow. It is so easy and could do so much good!"},{"text":"People are happy that I left the Trump Tower atrium open as opposed to taking the easy way out. http://t.co/LYXCvaOl"},{"text":"Hurricane is good luck for Obama again- he will buy the election by handing out billions of dollars."},{"text":"I always said Obama is lucky for himself but unlucky for the country. The storm could be very good for him as he (cont) http://t.co/BbBpnYfY"},{"text":"I want to end the day by saying there is no check I would rather write than that to a good charity designated by our President."},{"text":"I hear they are very unhappy w/ Arianna and @huffingtonpost at @AOL. I’ll bet she won’t be there for long!"},{"text":"By the way, where is @Oprah? Good question. 4 years ago she strongly supported Obama--now she is silent. Anyway, who cares, I adore Oprah."},{"text":"@RyanSeven Sounds like a good idea."},{"text":"@politico has really become a laughing stock of good political reporting."},{"text":"I am happy to have started #ObamasFavoriteCharity. Really enjoying reading everyone's tweets."},{"text":"I am happy to donate $5 million to a charity Barack Obama chooses.  All I am asking is that he is transparent with the American people"},{"text":"Why don't we ask the Navy SEALs who killed Bin Laden? They don't seem to be happy with Obama claiming credit. All he did is say O.K."},{"text":"Good luck to Derek on his operation. I know it will be a success--- he is a great champion."},{"text":"@YouthPastorDarr @seanhannity @megynkelly @JohnCena Good luck!"},{"text":"When Strasburg leaves @Nationals for another team for more money, will Washington still like the decision to shut him down for his good?"},{"text":"While the next season of @CelebApprentice is packed w/ All Stars, ours fans will be happy to see @Joan_Rivers in the board room.She is back!"},{"text":"Now there is talk of A-Rod being shipped to @Marlins. If A-Rod is not a @yankee next year, the fans will be happy."},{"text":"I think the @yankees will win today. Unlike A-Rod, CC is good under pressure. I hope A-Rod plays, however."},{"text":"Major grudge match this weekend between @nyjets &amp; @Patriots. I have a dilemma, I am good friends w/ both Woody (cont) http://t.co/latxc1K9"},{"text":"Obama better than last time, but again, @MittRomney wins. Good night. #debate"},{"text":"Good response on jobs by @MittRomney."},{"text":"Good luck @MittRomney tonight--have no doubt you will be great."},{"text":"The Coca Cola company is not happy with me--that's okay, I'll still keep drinking that garbage."},{"text":"Verlander is great but  very beatable. Does not have a good ERA in playoff games"},{"text":"@jbluvx2 Happy Birthday!"},{"text":"If @MittRomney has a good debate tomorrow night, Obama is finished!"},{"text":".@MittRomney's poll numbers are looking really good. One more great debate performance and it will be a total knockout. "},{"text":"Great to hear that our loyal @CelebApprentice fans are happy with today's announcement of the new cast. This will be something special!"},{"text":"Excellent story on @MittRomney- very good moment for Ryan. #VPDebate"},{"text":"Congrats to @Yankees on finishing 1st in the AL East. Derek Jeter is great--good luck in the playoffs!"},{"text":"@HighTide1989 Amazing is good too."},{"text":"Happy to have just passed 1.5M followers on twitter. We picked up over 14,000 yesterday alone. It's great to speak to everyone daily."},{"text":"Congratulations to Mitt Romney. He was not only good, he was absolutely fantastic tonight!"},{"text":"In August, 2012, Obama said the so called Arab Spring sprung from 'joyful longing for human freedom'  http://t.co/HgP9Kf1W  Good call!"},{"text":".@ritter1025  Wishing your wife a Happy Birthday"},{"text":"\"I've learned that mistakes can often be as good a teacher as success.\" --Jack Welch"},{"text":"@jeffphilbin Wishing you good luck and a happy birthday."},{"text":"No matter how good the replacement refs do, they will be soundly criticized--they can't win!"},{"text":"Housing prices will be going up big league--a great time to buy--good luck!"},{"text":"...Never let yourself be pushed around--but treat the good folks great."},{"text":"@susanvhinds  A happy and healthy family."},{"text":"@JesseStroup  Nice to hear--and good luck!"},{"text":"Still a buyer's market. Buy directly from a bank. They want to offload properties that have defaulted, will give good prices &amp; financing."},{"text":"What a coincidence that Obama's good friends in Libya and Egypt picked 9/11 to attack our embassies."},{"text":"Barack Obama used to mock Bush's 300K monthly job reports http://t.co/OMBeIR4x Now Obama wishes he could have a month half as good."},{"text":"\"You have enemies? Good. That means you've stood up for something, sometime in your life.\" -- Winston Churchill"},{"text":"Dems had a very good and professional convention. The Republicans must be smart and tough--and fast!"},{"text":"The Republicans must get Virgil Goode out of the race in Virginia. He will take votes away from @MittRomney."},{"text":"The Democrats dropped all references to God from their platform. Not good!"},{"text":"Very good speech by @MichelleObama--and under great pressure--Dems should be proud!"},{"text":"Great going Andy Roddick! Another victory for a fabulous player. Brooklyn Decker is good luck."},{"text":"Great speech by my good friend @GovChristie. He did something you won't hear at @BarackObama's convention---tell the truth."},{"text":"Happy to hear that @ralphreed's Faith and Freedom chapters are at the @RNC convention supporting @MittRomney. We must be united to win!"},{"text":".@ariannahuff is unattractive both inside and out. I fully understand why her former husband left her for a man- he made a good decision."},{"text":"Florida has been very good to me. I am really esxcited to give back at the Sarasota GOP event and @RNC convention. Will be fun!"},{"text":".@RogerJStoneJr was great on @TheKudlowReport last night. Roger and Larry are good friends!"},{"text":"Good news - @MittRomney has pulled ahead in Wisconsin  http://t.co/CrJ8tEr7 WIth @PaulRyanVP on the ticket, Wisconsin is in play."},{"text":"Richard Mourdock--a very good man running for the Senate in Indiana. Hopefully, he will win! @richardmourdock"},{"text":"Waste--@BarackObama's Dep. of Energy was warned in advance by Treasury that it wasn't loaning $ out in good deals http://t.co/ZHTrUAAa"},{"text":"To all struggling young entrepreneurs--stay positive in this tough climate and keep looking for good deals. They are out there."},{"text":"Good--@marcorubio is trying to eliminate the tax on Olympic medals http://t.co/ARumQ0yi  Our athletes should not be taxed on their wins."},{"text":"Good article: \"What Happened to American Men\" from @Newsmax by Michael Cohen http://t.co/xoo32RR9"},{"text":"Good news - @RasmussenPoll has @MittRomney beating @BarackObama 49%-44%  http://t.co/qvUIlevF  Obama was up by 5% at same point in '08."},{"text":"I am confident when American public gets to know @MittRomney, the race will go his way. He's honorable &amp; successful man--polls looking good."},{"text":"Happy 94th birthday to Nelson Mandela!"},{"text":"Happy to have just passed 1.3M Twitter followers. Love communicating with everyone daily."},{"text":"\"A general is just as good or just as bad as the troops under his command make him.\" --General Douglas MacArthur"},{"text":"Interesting that Roberts said it was a tax in order to come out with his good public relations decision when (cont) http://t.co/w47Efau7"},{"text":"Good messaging and staying on point. @MittRomney called @BarackObama \"anti-investment, anti-business, anti-jobs\"\nhttp://t.co/N7bVK7IY"},{"text":"Good news--@MittRomney is now leading in North Carolina according to @ppppolls. The NC GOP is united after their (cont) http://t.co/O5YRxtOd"},{"text":"Good--@FLGovScott is suing the Federal Government so he can protect the voter rolls  http://t.co/4TYPvqvh  Florida must be a legal election."},{"text":"It's good to see that @FLGovScott is protecting the sanctity of this November's elections, Voter fraud must be broken."},{"text":"\"A market is never saturated with a good product, but it is very quickly saturated with a bad one.\" -- Henry Ford"},{"text":"Reverend Wright was dumped like a dog by @BarackObama--he can't be feeling too good."},{"text":"Glad to see that Sacha Baron Cohen's new movie is not only a dud but not too good at the box office. He is talentless. @Sacha_B_Cohen"},{"text":"\"Diligence is the mother of good luck.\"\n--Benjamin Franklin"},{"text":"Glad to see that Jamie Dimon passed yesterday's shareholder vote. The JP Morgan stock holders understand that a good CEO is worth keeping."},{"text":"@Cher should stop with the bad plastic surgery and nasty statements about good people running for office. I (cont) http://t.co/2CP8oCFD"},{"text":"Good news. Voters give @MittRomney the edge over @BarackObama on handling the economy according to @gallupnews http://t.co/qPjiA1mR"},{"text":"\"It's not that I'm so smart, it's just that I stay with problems longer.\"  Some good words from Albert Einstein. It pays to be tenacious."},{"text":"VOTE 4 @mariamenounos &amp; derekhough#01 tonight! She's doing a great job on Dancing with the Stars #DWTS (&amp; a good person). 1-800-868-3401"},{"text":"\"Ultimately, Trump Tower became much more than just another good deal. I work in it, I live in it, and I have a (cont) http://t.co/JXUofag8"},{"text":"#CelebrityApprentice It’s good to have Jack back too with @marleematlin. He’s become a star. #sweepstweet"},{"text":"Good move by Aubrey to be the red-headed model they didn’t have. #sweepstweet"},{"text":"Could be a fight over red-heads with @lisalampanelli—this could be good. #sweepstweet"},{"text":"Orders for U.S. factory goods in March record biggest decline in 3 years http://t.co/YtC2mTRE China is eroding the US manufacturing sector."},{"text":"The EPA official who wants to crucify gas companies resigned http://t.co/7V5KiE1c  Good- but his attitude is endemic in the EPA"},{"text":"\"Our Founding fathers got it. They understood that nothing good in life--religious freedom, economic freedom, (cont) http://t.co/tTKxpAnc"},{"text":"Good Morning America is thrilled @Rosie is working for the @todayshow--that means almost guaranteed success for @GMA"},{"text":"\"I'm loyal to people who've done good work for me.\" #TheArtofTheDeal"},{"text":"I knew disgusting and unwanted porn star @REPWEINER was a sleazebag the first time I met him. Thank goodness he was revealed (so to speak)."},{"text":"Axl Rose should take his #rockhall2012 honors and be happy. Stop the no induction nonsense. Do it for your fans @axlrose."},{"text":"The Celebrity Apprentice delivers the goods--and the puppets-- Sunday at 9 pm on NBC http://t.co/pdeRzTC1"},{"text":"Good news--@RickSantorum did the right thing. I congratulate him on running a very good race. Now it's onto @BarackObama -- go get him Mitt!"},{"text":"He @newtgingrich is sounding more and more like a real team player...he is a really good guy!"},{"text":"When @BarackObama is not vacationing, he is hosting his top donors in the White House http://t.co/RAB2Lahw  Always having a good time!"},{"text":"Happy Birthday to my legendary friend Aretha Franklin."},{"text":"Trump Tuesday on @SquawkCNBC, 7:30 AM, is getting very good ratings as is @Foxandfriends on Mondays, 7:30 AM."},{"text":"@MittRomney should consider Gov McDonnell of VA, Gov Christie of NJ and Senator Rubio of FL for VP. Really good men doing a really good job."},{"text":"Why gas prices will cost @BarackObama re-election: pain-at-the-pump-not-good-for-obama http://t.co/YeGZtD8A"},{"text":"@NicolletteSheridan lost a big motion yesterday--she is entitled to nothing. The show made her--she should have been happy."},{"text":"Happy and proud to help @MittRomney win Ohio with robo-calls in pivotal Cuyahoga County"},{"text":"This is good news: @MittRomney is now leading in Michigan by 6 points according to @RasmussenPoll http://t.co/5W62qQc9"},{"text":"The Fed is considering issuing even more US bond debt into the market. Not good!"},{"text":"Very successful fund raising for @MittRomney yesterday. Good to see my friend Woody Johnson."},{"text":"When the economy is bad, @BarackObama wants to raise taxes. When the economy is good, @BarackObama wants to raise taxes. Notice a trend?"},{"text":"I see @FLGovScott poll numbers are improving. Good man doing a good job."},{"text":"My appearance this morning on Good Morning America...\nhttp://t.co/7qrilC0x"},{"text":"Food stamps up 45%. Federal handouts up 45%. Is @BarackObama happy? http://t.co/HFw1bcye"},{"text":"Canada will now sell its oil to China because @BarackObama rejected Keystone. At least China knows a good deal when they see it."},{"text":"Rick Perry--a good man, a great family and a patriot."},{"text":"I bought Tim Tebow's jersey and helmet at auction for a good cause- fighting breast cancer http://t.co/dXRxZm8N"},{"text":"“@BarackObama may have been a good ‘community organizer,’ but the man is a lousy international dealmaker.” #TimeToGetTough"},{"text":"\"People who have the ability to work should. But with the government happy to send checks, too many of them don't.\" #TimeToGetTough"},{"text":"A good friend: @SarahPalinUSA. More importantly she is a tremendous voice for policies that would put America on (cont) http://t.co/Vxx9Pcvz"},{"text":"\"People who have the ability to work should. But with the government happy to send checks, too many of them don't.\" #TimeToGetTough"},{"text":"Happy to have @ralphreed and the FFC's endorsement of the Newsmax-@iontv debate. FFC  is a great organization."},{"text":"Rick Perry is a good guy who had a really tough evening.  @RickPerry"},{"text":"I am happy to see the majority of the GOP candidates agree with me that the tax code must be simplified and the rates dropped."},{"text":"Happy to have passed 800,000 followers.  Looking forward to passing 1M sooner than later."},{"text":"Happy New Year to all my Jewish friends."},{"text":"Bob Turner--great guy, great businessman, will be a great Congressman. Was happy to help him win."},{"text":"China is happy to learn that @BarackObama plans to borrow another $300 Billion. @BarackObama is their favorite client."},{"text":"My interview this morning on Good Morning America  with George Stephanopoulos  http://t.co/N7Urafm"},{"text":"A good example of how our country wastes money... http://t.co/iWRhaUy #trumpvlog"},{"text":"Mike Huckebee, a great guy, said the President should appoint me Treasury Secretary. China and OPEC would not be happy."},{"text":"All those politicians in Washington and not one good negotiator."},{"text":"No taxes the only good thing about DC Debt Deal."},{"text":"@johnboehner  @EricCantor  \"You can't con people...if you don't deliver the goods, people will eventually catch on.\" - The Art of the Deal"},{"text":"Watch my appearances on Good Day NY... http://bit.ly/jxjHgU and @FoxandFriends... http://bit.ly/iINif1"},{"text":"Wishing everyone a Happy Memorial Day, and a thank you to all the soldiers who protected our great country."},{"text":"Keep talking about me: use #TrumpRoast to tweet about how good I look on @ComedyCentral tonight at 10:30/9:30c  http://bit.ly/hN3jow"},{"text":"WIshing everyone a happy, healthy and prosperous New Year!"},{"text":"Wishing everyone a very Happy Holiday season!"},{"text":"My best wishes to everyone for a Happy Thanksgiving!"},{"text":"My interview last week with Greta van Susteren is available here in slightly abridged form. http://bit.ly/96ztOA  Good info to know about."},{"text":"I am very happy to have the civilian version of \"The Apprentice\" back on the air this fall. There will be excitement as well as opportunity."},{"text":"Wishing everyone a Happy Memorial Day Weekend, with a special thought for all the veterans who have done so much for our freedom."},{"text":"Congratulations to Bret Michaels, the new Celebrity Apprentice. Bret's a true champion, all of us were happy to see him and to see him win!"},{"text":"We're all very happy to hear of Bret Michael's progress and send our best wishes for his full recovery."},{"text":"I am happy to announce that theoriginal Apprentice --which will offer job opportunities to those in need--is coming back."},{"text":"From Donald Trump: Wishing everyone a wonderful holiday & a happy, healthy, prosperous New Year. Let’s think like champions in 2010!"},{"text":"Wishing you and yours a very Happy and Bountiful Thanksgiving!"},{"text":"Here's to a safe and happy Independence Day for one and all - Enjoy it! --Donald J. Trump"},{"text":"- Wishing a Happy Father's Day to all the Dad's out there - YOU are a champion today and everyday! http://tinyurl.com/kn95ju"}]